[
  {
    "title": "Principle Engineer - Frontend Technologies (CEN02137)",
    "location": "Bangalore",
    "company": "Acko",
    "description": "We are a Direct-to-Consumer (D2C) insurance company with a fully digital platform encompassing a customer-facing website, mobile application, and internal intranet tools. As a Software Architect (Frontend – Web & Mobile), you will lead the front-end technology strategy and architecture across all these platforms. This includes making key decisions on frameworks, libraries, and tools, designing both high-level and low-level architecture, and providing hands-on coding support for critical features. The role bridges user experience design, technical implementation, and strategic planning – ensuring our web and mobile applications are performant, scalable, and deliver a seamless user experience. You will work closely with cross-functional teams (UI/UX, backend, DevOps, product) to build intuitive and reliable user interfaces that drive our online insurance business.\nJob Responsibilities\nArchitectural & Cross-Platform Responsibilities\nFront-End Technology Leadership: Own the overall front-end architecture for web, mobile, and internal tools, ensuring the design is scalable, modular, and maintainable . Define architectural patterns and guidelines (e.g. component-based design, state management, caching strategy) that apply across platforms.\nTechnology Stack Decisions: Evaluate and select appropriate frameworks, libraries, and development tools for each platform. Make informed choices (e.g. React, Angular or Vue for web; React Native, Flutter or native SDKs for mobile) that balance innovation with stability and team expertise. Regularly review and update stack components to leverage the latest improvements (such as new build tools or transpilers).\nReusable Design System: Establish a unified design system and component library to be used across web and mobile applications for a consistent look and feel. Ensure UI components are reusable and standardized, so that all front-end apps present a cohesive user experience . This includes defining common styling guidelines, UI components, and ensuring consistency between the website and mobile app.\nSecurity and Compliance: Implement front-end solutions with robust security in mind. Ensure adherence to security best practices (e.g. protecting against XSS/CSRF, secure storage of tokens, input validation) and compliance with data privacy regulations relevant to the insurance industry. Safeguard customer information on the client side and incorporate measures like encryption for sensitive data in transit.\nHigh-Level & Low-Level Design: Create and document High-Level Designs (HLD) and Low-Level Designs (LLD) for front-end systems and features. Outline the front-end architecture diagrams, component interaction, data flow with backend APIs, and integration points. For complex features, provide detailed LLDs (e.g. sequence diagrams, component breakdowns) to guide developers in implementation.\nCross-Platform Performance Optimization: Define performance budgets and optimize front-end performance across all clients. Strategies include code-splitting, lazy loading, asset optimization, and caching to achieve fast load times and smooth interactivity. Continuously monitor performance (web Core Web Vitals, mobile app startup time and frame rates) and guide the team in improving these metrics.\nQuality Assurance: Ensure a high standard of front-end code quality. Establish coding standards, UI testing strategies, and code review practices for all front-end teams. Work with QA engineers to implement automated testing (unit, integration, end-to-end) for front-end components, and ensure that web and mobile UIs are thoroughly tested across browsers/devices.\nTroubleshooting & Support: Act as the go-to expert for resolving complex front-end issues. When critical bugs or performance issues arise in production (whether on the web platform or in the mobile app), provide hands-on debugging and solutions. Optimize and refactor existing code where needed to improve stability and maintainability.\nInnovation and R&D: Stay abreast of the evolution of frontend technologies and emerging industry trends. Proactively research new architectural approaches (e.g. micro-frontend architecture for modular web apps) and modern frameworks or tools that could benefit the product. Evaluate the potential of trends like Progressive Web Apps, WebAssembly, or newer JavaScript frameworks, and prototype solutions to assess their fit for our needs . Provide recommendations to adopt improvements that keep our front-end stack modern and efficient.\nWeb Platform (Customer-Facing Website)\nArchitect the Web UI: Design and oversee the architecture of our customer-facing website where users learn about and purchase insurance policies. Ensure the web app is built with a responsive, mobile-first design that works seamlessly across all modern browsers and devices. Emphasize SEO-friendly architecture (e.g. Server-Side Rendering or pre-rendering for key pages) to maximize discoverability and traffic.\nFeature Development & Integration: Guide the web development team in implementing user-facing features (quote flows, policy management dashboards, etc.) with an intuitive UI/UX. Integrate web interfaces with backend services and APIs in an efficient manner (minimizing API calls, using GraphQL or batching where appropriate). Ensure data displayed (policy details, quotes, etc.) is updated in real-time through websockets or polling when necessary, providing a dynamic single-page app experience.\nPerformance & Optimization (Web): Continuously optimize the website for fast performance and high conversion rates. Implement techniques like CDN usage, asset minification, bundle analysis and optimization, and using modern build tools (Webpack/Vite) for efficient loading . Monitor web performance metrics (load time, Time to Interactive, First Input Delay, etc.) and optimize the UI to meet Core Web Vitals targets.\nAccessibility & Cross-Browser Compatibility: Ensure the web platform is fully accessible and usable by all customers, including those with disabilities. Enforce WCAG accessibility standards in the UI (proper ARIA roles, keyboard navigation, screen-reader support). Also guarantee cross-browser compatibility by testing and fixing issues on different browsers (Chrome, Safari, Edge, Firefox, etc.) and various screen sizes.\nUX Collaboration: Work closely with UX/UI designers in the web team to review design proposals, provide feedback from a technical perspective, and ensure designs are feasible within the chosen technical framework. Contribute to making trade-off decisions (for example, when animations or interactive elements might impact performance, propose alternatives). Ensure that the final implementation of the web UI remains faithful to the intended design and branding.\nMobile Application (Customer-Facing Mobile App)\nMobile App Architecture: Design the architecture of our mobile application (for iOS and Android) which allows customers to manage their insurance on-the-go. Decide on the appropriate development approach – whether it’s native development for each platform or using a cross-platform framework (like React Native or Flutter) – based on long-term scalability and team expertise. If cross-platform, define how shared code vs platform-specific code is organized; if native, ensure both apps follow consistent design principles and parity in features.\nHigh Performance Mobile UI: Ensure the mobile app delivers a native-like, high-performance user experience. Optimize for quick launch times, smooth transitions, and minimal lag. Guide developers in using platform-specific optimizations (e.g., efficient list rendering, background thread use, memory management) and in leveraging device capabilities (camera, biometric auth, etc.) without compromising performance or security.\nOffline Capability & Reliability: Architect the app to handle intermittent connectivity gracefully – e.g., caching critical data, enabling offline modes for certain features, and syncing data when a connection is available. Ensure the app handles errors or network failures in a user-friendly way. Incorporate robust logging and crash analytics to monitor app stability (aiming for a high crash-free user rate).\nIntegration and APIs (Mobile): Work with backend teams to shape APIs that cater to mobile needs, such as more granular or combined endpoints to reduce network calls on mobile networks. Ensure efficient data transfer and usage (e.g., using compression, handling pagination for large datasets like policy lists or transaction history). Also oversee integration of mobile-specific services such as push notifications and in-app updates, ensuring they are architected properly.\nApp Store Deployment & Compliance: Oversee the technical preparations for app releases. Make sure the app meets all App Store and Google Play requirements (performance, privacy policies, proper use of SDKs). Review the build and deployment pipelines for automating app releases and ensure versioning and release processes are smooth. Stay aware of mobile OS changes (new iOS/Android versions, new device form factors) that could require architectural adjustments or updates to the app.\nInternal Intranet Tools (Employee-Facing Applications)\nInternal Frontend Architecture: Architect and guide development of the internal web applications/tools used by our operations, support, and analytics teams. These could include admin dashboards, customer service portals, or analytics dashboards. Choose front-end technologies for these tools that align with our overall stack (for instance, if our public site is in React, likely use React for internal tools as well for consistency and reusability).\nUsability & Efficiency: Ensure that intranet tools have intuitive and efficient user interfaces that maximize employee productivity. Design UI layouts for complex forms or dashboards such that users (e.g., support agents processing claims) can accomplish tasks with minimal clicks and errors. Incorporate user feedback from internal users to continuously refine the tools’ usability.\nIntegration with Backend/Internal APIs: Work closely with backend and IT teams to integrate intranet UIs with internal services or databases. Ensure these tools reflect real-time data (e.g., policy details, customer info) and allow staff to perform actions (approvals, adjustments) seamlessly. Consider using role-based access control, so the frontend only shows features or data that a given internal user role should access.\nMaintainability: Since internal requirements can evolve quickly, design the internal tools’ front-end architecture to be flexible and maintainable. This could involve modularizing features, using a micro-frontend approach for different internal modules, or simply clean separation of concerns in code. Ensure that adding new features (like a new report or a new workflow in the tool) can be done with minimal impact on existing functionality.\nTool Performance and Reliability: Even though internal, these tools should meet performance standards – optimize load times for data-heavy pages (e.g., using virtualized lists for large tables of customers/policies) and ensure they can handle large data sets without crashing the browser. Implement thorough testing for internal tools as well, to prevent business disruptions caused by tool outages or bugs.\nRequired Technical Skills\nFrontend Expertise: Extensive experience (8+ years) in front-end development using HTML5, CSS3, and JavaScript/TypeScript. Deep understanding of core web fundamentals (DOM, browser rendering, performance tuning, responsive design techniques).\nModern Web Frameworks: Hands-on proficiency with one or more modern web frameworks such as React, Angular, or Vue.js for building single-page applications. Strong React experience is preferred, as React remains one of the most widely adopted front-end libraries . Familiarity with server-side rendering frameworks or meta-frameworks (e.g., Next.js, Nuxt) for SEO and performance optimization is a plus.\nMobile Development: Strong knowledge of mobile app development. Experience building native mobile apps (iOS Swift/Objective-C and Android Kotlin/Java) and/or cross-platform apps (React Native, Flutter). Should understand the mobile development lifecycle, differences between platforms, and how to design a codebase for cross-platform sharing. Familiarity with mobile UI frameworks and native UI components, as well as the process for publishing apps to Apple App Store/Google Play.\nUI/UX and Design Systems: Demonstrated ability to implement pixel-perfect user interfaces and to work with design systems. Experience creating or maintaining a design system/style guide for front-end is important – including reusable UI components, standardized CSS (or CSS-in-JS methodologies), and design tokens. Should be comfortable using design tools and translating UX prototypes into code, while ensuring consistency in user experience across web and mobile.\nPerformance Optimization & Tools: In-depth knowledge of front-end build and optimization tools (Webpack, Vite, Babel, esbuild, etc.) and strategies for optimizing performance. Proficient in using debugging and profiling tools (Chrome DevTools, Lighthouse, Xcode/Android Studio profilers) to analyze and improve performance. Should understand techniques like lazy loading, bundling and tree-shaking, optimizing network calls, and using CDNs/caching to improve speed .\nAPI Integration & State Management: Strong understanding of RESTful API integration and handling data in front-end. Experience with GraphQL and real-time data (WebSockets) is a plus. Should be adept at implementing state management (using Redux, Context API, Vuex, etc.) for complex applications, managing client-side state and caching effectively across pages/screens.\nTesting and CI/CD: Experience with front-end testing frameworks (unit testing with Jest, Mocha, or Jasmine; end-to-end testing with Cypress, Selenium, or Appium for mobile). Knowledge of setting up CI/CD pipelines for front-end projects – e.g., automated builds, test runs, and deployments for web (to staging/production environments) and mobile (continuous integration for app builds and facilitating deployments to stores).\nVersion Control & Collaboration: Proficiency with Git and collaborative development workflows (pull requests, code reviews). Experience using project management and collaboration tools (JIRA, Confluence, etc.) to document designs and track progress.\nFront-End Security & Accessibility: Solid grasp of web security principles (CSP, OAuth token handling, preventing vulnerabilities like XSS/CSRF) and applying them in front-end code. Also, strong awareness of accessibility standards and implementing them (ARIA roles, color contrast, semantic HTML usage), ensuring our applications are usable by people with disabilities.\nUp-to-Date with Trends: Continuous learner who keeps up with the evolution of front-end tech. Aware of current and upcoming trends such as the rise of TypeScript, popularity of new frameworks (e.g. Svelte, Solid), emerging architecture patterns like micro-frontends and edge computing, and improvements in browser APIs. Comfortable quickly learning new technologies and assessing their maturity for production use.\nLeadership Responsibilities\nTechnical Leadership & Mentorship: Lead the front-end development teams (web and mobile) by providing technical direction and mentorship. Review code and designs, share best practices, and help engineers resolve complex technical problems. Foster a culture of clean code, knowledge sharing, and continuous improvement within the team.\nCross-Functional Collaboration: Work closely with Product Managers, Designers, Backend Architects, and DevOps to ensure front-end architecture aligns with product vision and backend capabilities. Participate in requirements discussions and planning, providing technical insights and ensuring that front-end considerations (like effort for a given UI feature, potential performance impacts) are accounted for in project plans.\nProject Planning & Execution: Collaborate with engineering managers and project leads to plan front-end development activities. Help break down epics into actionable technical tasks, estimate effort for front-end work, and identify dependencies. Ensure that front-end deliverables are on track and coordinate across teams to resolve any blockers (for example, API dependencies or design clarifications).\nArchitectural Governance: Serve as the guardian of front-end architecture by conducting architecture reviews and audits of the front-end codebases. Make sure that implementations adhere to the prescribed architecture and coding standards. Where multiple teams contribute to the front-end, enforce consistency and guide the integration (for example, if multiple web modules or micro-frontends are used, ensure they conform to shared standards).\nDocumentation & Communication: Clearly document architectural decisions, diagrams, and guidelines for the front-end. Conduct training sessions or tech talks for team members to understand the architecture. Communicate complex technical concepts in simple terms to stakeholders or leadership when needed – for instance, explaining why a certain framework or refactor is necessary in the context of business goals.\nInnovation and Continuous Improvement: Encourage and evaluate new ideas from the team. Stay updated on industry best practices and proactively propose improvements to our front-end stack or processes. For example, if a new testing tool can improve quality or a new library can reduce load time, lead the effort to trial and adopt it. Ensure the team is not just executing tasks but also continuously modernizing and improving the product’s front-end.\nHiring & Team Development: Play a key role in hiring for front-end talent. Interview candidates for technical skill fit, and help onboard new developers by educating them on our architecture and standards. Provide career guidance to existing team members, helping them grow into senior engineers or architects over time.\nSoft Skills\nExcellent Communication: Ability to clearly communicate technical ideas and decisions to both technical team members and non-technical stakeholders. Can articulate the rationale behind architectural choices in terms of business value and impact.\nLeadership & Collaboration: Strong leadership presence – able to inspire and lead by example. Collaborative mindset to work with cross-functional teams and bring together perspectives from design, product, and engineering. Skilled in mentoring and guiding teams through challenges.\nProblem-Solving: Analytical thinker who can quickly break down complex problems (like debugging a sporadic front-end bug or tackling a performance bottleneck) and devise effective solutions. Comfortable making decisions under uncertainty, using a mix of experience, data, and intuition.\nAdaptability: Embraces change and new challenges. In the fast-evolving front-end landscape, able to adapt to new technologies and frameworks and guide the team through transitions. Also flexible in adjusting plans when business requirements change, without losing sight of long-term architectural goals.\nAttention to Detail: A keen eye for detail in the user interface, ensuring that the final product not only works well but also looks polished and professional. Cares about pixel-perfect implementation, consistency in design, and a smooth user experience. Also diligent in code details – catching edge cases and preventing defects.\nUser-Centric Mindset: Always keeps the end-user experience in focus. Even as a deep technologist, empathizes with the user – whether it’s a customer using the mobile app or an employee on an internal tool – and drives the team to build interfaces that are intuitive, accessible, and delightful to use.\nStrategic Thinking: Ability to zoom out and see the big picture of how front-end systems contribute to business success. Balances immediate project needs with a long-term vision for the product’s evolution. Skilled at planning ahead to ensure the front-end architecture can accommodate future requirements and scaling.\nEffectiveness and Performance Indicators\nHow will success be measured in this role? A successful Frontend Architect in our D2C insurance context will demonstrate:\nHigh-Performing Web & Mobile Apps: The customer-facing website and mobile app are fast, responsive, and reliable. Key metrics like page load time, Time to Interactive, and mobile app startup time consistently meet targets (e.g., Core Web Vitals in the “good” range). The mobile app maintains a high crash-free rate and positive app store ratings, indicating stability and performance.\nSeamless User Experience: A consistent and intuitive user experience across web and mobile platforms. This can be observed through improved user engagement metrics (longer session durations, higher conversion rates on purchase funnels) and positive user feedback. Fewer user complaints or support tickets related to UI issues or confusion.\nArchitecture Scalability & Flexibility: The front-end architecture proves adaptable to new requirements. For example, when new insurance products or features are introduced, they can be integrated without major refactoring, thanks to a modular architecture. This is evidenced by development velocity – new features are delivered quickly and with minimal bugs, showing that the architecture is not a bottleneck.\nCode Quality & Maintainability: High code quality as indicated by metrics like test coverage, static code analysis, and low defect rates. Few critical bugs escape to production, and those that do are resolved quickly. The front-end codebases (web, mobile, intranet) remain clean and organized, making onboarding of new developers faster and reducing the cost of maintenance.\nEffective Team Collaboration: Smooth collaboration between front-end and other teams, facilitated by the architect’s guidance. For instance, backend APIs are well-aligned with front-end needs (few iterative changes needed), and design handoffs to development are efficient with minimal rework. The architect’s presence reduces miscommunication and ensures a shared understanding of technical constraints and possibilities.\nInnovation & Technical Improvement: Over time, visible technical improvements in the front-end stack. Examples include successful implementation of a design system (with high adoption across teams), introduction of performance enhancements (like migrating to a faster build tool or implementing a new caching strategy) that yield tangible benefits, or adopting a new framework/module that improves developer productivity. The architect is seen as driving these positive changes.\nMentorship and Team Growth: The front-end development team shows skill growth and confidence. Junior developers improve their capabilities under the architect’s mentorship (e.g., able to take on more complex tasks), and the team as a whole follows best practices consistently. High team morale and low turnover in the front-end team can be an indirect indicator of effective leadership and a healthy development culture.\nRecommended Maturity and Seniority Level\nExperience: Typically 8–12+ years of software development experience, with a significant focus on front-end engineering. Within this, at least 3–5 years of experience in a lead/architect capacity overseeing complex web and/or mobile applications.\nProven Track Record: The candidate should have a demonstrated history of architecting and delivering successful UI applications (both web and mobile) ideally in direct-to-consumer or other high-user-volume contexts. Experience in the fintech, insurance, or e-commerce domain is a plus, showing an ability to handle transaction-heavy or form-intensive applications.\nSeniority: This individual operates at the level of a Principal Engineer/Architect or similar, capable of decision-making with minimal guidance. They should be comfortable influencing and guiding other senior engineers and be recognized as an expert in front-end technologies. The role requires both technical depth and strategic insight, so a mature perspective on balancing short-term vs long-term technical decisions is essential.\nEducation: A Bachelor’s or Master’s degree in Computer Science or related field is generally expected (or equivalent practical experience). More importantly, the person should exhibit continuous learning – through courses, certifications, or community involvement – to stay updated in this fast-evolving field.",
    "url": "https://www.acko.com/careers/jobs/55525/"
  },
  {
    "title": "Lead DevOps Engineer (DEV02136)",
    "location": "Bangalore",
    "company": "Acko",
    "description": "The Role:\nThe Lead DevOps Engineer in our team will be a key member who will be managing various aspects of our cloud infrastructure that includes Infrastructure & Configuration management, Cost optimization, Release management and CI/CD, Monitoring & Alerting, Database management, and Infrastructure security.\n\n\nSkills & Experiences:\n6+ years of DevOps experience in managing all aspects of large-scale systems/ infrastructure and proficiency at working in AWS Cloud.\nShould be a hands-on person who can work independently or with minimal guidance and can drive the team’s deliverables by mentoring and guiding junior team members.\nSolid understanding and experience in various technology domains like Infrastructure-As-Code and Configuration Management (Terraform/ Ansible), CI/CD (Jenkins), Observability tools (Prometheus, Statsd/Graphite, ELK Stack), Container Orchestration (Kubernetes), Network and Application Security in AWS, SQL/NoSQL databases (Postgres/ Elasticsearch, etc).\nShould be comfortable in working with other stakeholders to ensure the timely completion of cross-functional projects.\nShould have sound knowledge of general technology best practices and should know how to use them together in an efficient way to improve the quality of results.\nShould be always open to embracing new technologies or solutions.\nShould have good communication, interpersonal, and leadership skills.\nB.E./B.Tech in Computer Science or equivalent from a reputed college.\nResponsibilities:\nYou will be a core hands-on contributor to the team’s projects and will actively participate in the Planning and design phase across projects, and work closely with all stakeholders toward their execution.\nEnsure that Availability, Scalability, Security, and other aspects of Software Operability are improved and maintained across the stacks.\nThink out of the box and come up with innovative ideas that help the business run more efficiently.\nTake initiative and work on evaluating new tools/technologies which will be helpful in the long run.\nEstablish technical best practices to be followed by the teams and help others to adopt them.\nCome up with long-term solutions to frequent problems and work with the team to achieve those goals.",
    "url": "https://www.acko.com/careers/jobs/55524/"
  },
  {
    "title": "DevOps Engineer - 2 (DEV02135)",
    "location": "Bangalore",
    "company": "Acko",
    "description": "Responsibilities:\n3+ years of experience operating & owning end-to-end availability and performance of a large scale production environment.\nExcellent understanding of cloud environments and technologies, especially AWS.\nSolid understanding of containerization and microservices architecture.\nHands-on experience and understanding of the Kubernetes ecosystem and best practices with K8s.\nAbility to dissect complex problems into simple sub-problems and use available solutions to resolve them.\nExcellent understanding of cloud environments and technologies, especially AWS, Azure, GCP.\nHand-on experience  in Python/Go\nUnderstanding of auto-remediation, alert correlation frameworks.\nUnderstanding of SLO/SLIs, error budgeting, KPIs for highly critical services.\nExperience with logging & metrics platform at scale.\nProven strengths in identifying, mitigating, and root-causing issues while continuously seeking ways to drive optimization, efficiency, and the bottom line.\nEssential Skills:\nPublic Cloud (AWS/GCP)\nKubernetes\nCI CD  (Jenkins/Github Actions)\nProgramming Skills (Python Preferred)\nTerraform\nDesirable Skills:\nService Mesh\nMulti-Cloud Exposure\nDatabase Management (Postgres, Mongo)",
    "url": "https://www.acko.com/careers/jobs/55523/"
  },
  {
    "title": "DevOps Engineer - 3 (DEV02132)",
    "location": "Bangalore",
    "company": "Acko",
    "description": "As a DevOps engineer, you are expected to work as a key enabler who builds the framework that takes care of the end-to-end seamless setup/deployment by defining the standard CI / CD, management, and periodic review of infrastructure and applications.\n\n\nResponsibilities :\nWork closely with the Application development and QA teams to have an automated framework for seamless setup and deployment of infrastructure, applications, and databases (RDBMS and NoSQL).\nDefine and implement the Continuous Integration and Continuous Deployment life cycles for all the services and Business units of Auto, Health, partnerships, Electronics, etc.\nDesign the right infrastructure architecture using either open source or Commercial tools and build a scalable and cost-effective model.\nAutomated deployment of code across all the SDLC environments.\nEstablish rollback mechanisms for both the application and database deployments.\nCreate automated process frameworks related to release engineering, database administration, space management, security, monitoring, and performance that can be easily scaled and utilized by the stakeholders.\nDevelop the right service discovery and service mesh models.\nDevelop frameworks for logging across the Troubleshoot and solving complex application and database deployment problems through research, analysis, and collaboration with the Reliability engineering team.\nEnsure high quality, adherence to standards and best practices, high performance, and scalable, repeatable processes and deliverables.\nQualifications and Skills:\nBS degree in Computer Science or related engineering disciplines\n6- 9 years of relevant DevOps engineering work experience in any of the Online technology companies.\nExperience in Python or other scripting languages such as Perl, Ruby, etc.\nExpertise in developing and maintaining CI/CD processes for enterprise SaaS and on-prem applications using tools like Git, Gerrit, Jenkins, Maven, Gradle, etc Expertise in AWS or GCP and all related services, including cloud provisioning tools.\nExpertise in release engineering/management of deploying code designed in Java stack and Open-source or any other proprietary.\nExperience with configuration management tools such as Ansible, Chef, Fabric, Puppet, or SaltStack.\nExperience with Orchestration tools such as Nomad, Spinnaker, Terraform\nExperience running 24*7 production code with reliable deployments with the right monitoring and alerts for CI / CD breaks.\nExperience in building the right logging framework across the Infra, application, databases, and NoSQL.\nExperience in building monitoring and alerting frameworks for Infrastructure, applications, databases, and NoSQL.\nHands-on experience in building and administering VMs and Containers using tools such as Docker and Kubernetes Experience in designing and maintaining cloud-based solutions, either Private or Public or Hybrid.\nProven automation skills.\nExperience in Linux or Unix variants, both system, and Admin level, is a plus.\nExperience in any database or NoSQL is a plus.\nAbility to work with multiple stakeholders like the Application development and QE teams.\nGreat team player with strong communication skills, both verbal and written.",
    "url": "https://www.acko.com/careers/jobs/55520/"
  },
  {
    "title": "Senior Manager- Business development (ELE02112)",
    "location": "Bangalore",
    "company": "Acko",
    "description": "Key Responsibilities:\n1. OEM Sales Program Execution\nLead and manage on-ground sales and claims engagement for key OEMs.\nDrive FMCD-aligned sales strategy in coordination with local OEM teams and retailers.\nTroubleshoot mPOS or process-related issues and serve as the single point of contact for execution.\n2. Relationship Management\nBuild and maintain strong working relationships with OEM leadership, including Chinese CEOs across different states.\nActively engage in partner WhatsApp groups to drive mindshare and influence local sales behavior.\nBe the face of Acko for both sales and service escalations across state networks.\n3. Performance Visibility and Competition\nShare cross-state performance insights to create healthy competition and improve engagement.\nDrive visibility initiatives that highlight success stories and actionable metrics.\n4. Field Engagement\nConduct monthly visits to key states to ensure Acko's strong local presence and reinforce brand mindshare.\nMonitor market activities, support field teams, and identify improvement areas.\n5. Business Development\nIdentify and onboard new OEM partners in mobile and appliances verticals.\nDevelop partnerships with Large Format Retailers (LFRs) based on similar engagement and sales activation models.\nIdeal Candidate Profile:\n5–7 years of experience in Sales, Partner Management, or Business Development, preferably in FMCD, telecom, or consumer tech sectors.\nStrong relationship-building skills, especially with senior stakeholders and cross-cultural teams.\nHands-on approach with field experience and comfort in handling dynamic, on-ground challenges.\nExcellent communication skills, both verbal and written.\nWillingness to travel frequently across states.",
    "url": "https://www.acko.com/careers/jobs/55500/"
  },
  {
    "title": "Senior Product Designer (DES02110)",
    "location": "Bangalore",
    "company": "Acko",
    "description": "We are looking for a highly skilled Senior Product Designer to join ACKO. The ideal candidate will have a strong background in UX research, visual design, and UX writing, and will be responsible for creating compelling and intuitive product experiences for our users. As a Senior Product Designer, you will collaborate with cross-functional teams and be responsible for prioritizing tasks and delivering high-quality experiences for our users.\n\n\nResponsibilities:\nLead and participate in user research, usability testing, and collaborate with multidisciplinary stakeholders to inform design decisions\nCreate wireframes, prototypes, and high-fidelity designs to communicate design concepts and solutions\nCollaborate with product managers, engineers, and stakeholders to define product requirements and user stories\nPrioritize and manage design tasks and deliverables within project timelines\nIncorporate data and metrics into the design process to evaluate and improve the effectiveness of design solutions\nAdvocate for user needs and design best practices throughout the design and development process\nProduce clear and concise documentation for design assets, patterns, and guidelines\nEffectively communicate and collaborate with engineering teams to ensure designs are implemented to spec\nYou will be a great fit if you are...\nA designer who has the ability to see the big picture while keeping a keen eye on details\nA designer who is excellent at persuading peers and executives with strong rationales for design decisions\nSomeone with a good sense of humor\nWe will be looking for...\n6+ years of experience in product design\nStrong portfolio showcasing design process, problem-solving skills, and the ability to design for diverse platforms and form factors\nExpertise in user-centered design principles, design thinking, and design systems\nExcellent communication, collaboration, and interpersonal skills\nA demonstrated track record of working with teams that have shipped quality software across web and mobile",
    "url": "https://www.acko.com/careers/jobs/55498/"
  },
  {
    "title": "Product Designer - 2 (DES02109)",
    "location": "Bangalore",
    "company": "Acko",
    "description": "We're on a mission to transform the way we serve our customers, focusing on what truly matters to them and reducing uncertainty in their lives. As a Product Designer, you'll play a pivotal role in shaping our D2C experience, including various customer-facing products and our app experience.\nWe're seeking someone with experience in designing end-to-end D2C flows and collaborating with stakeholders across various disciplines. We're looking for individuals who are inherently curious, willing to experiment, and adept at fostering a respectful and collaborative environment.\n\n\nAbout the Design team\nWe’re a fast-paced, innovative team. We collaborate with product and business teams to seamlessly integrate their offerings into our product ecosystem, ensuring alignment with our principles and frameworks. We are friendly, approachable, data-driven, and value hypothesis-driven design over “shots in the dark.”\n\n\nIn this role, you will:\nDeliver designs that are innovative, scalable, and thoroughly documented.\nDrive design projects aligned with our OKRs by collaborating closely with strategy, product, business, and engineering teams.\nOwn design for products in their respective pods, from ideation and prototyping to user testing and final production, ensuring timely delivery.\nUtilize data insights, including metrics and usability studies, to inform and refine design decisions.\nDemonstrate a strong understanding of design patterns, best practices, and standards for both iOS and Android platforms.\nEffectively communicate and collaborate with engineering teams to ensure seamless implementation of designs.\nWhat we’re looking for:\nSomeone comfortable with deep diving into complex products and simplifying them.\nA designer who can see the big picture while keeping a keen eye on details.\nA designer excellent at influencing peers and leadership with strong storytelling and design rationale.\nA Figma expert who can prototype quickly, with motion design in mind.\nSomeone with a good sense of humor is a plus.\nWhat you’ll need:\n3+ years of experience designing D2C digital products.\nA stellar portfolio showcasing design process, problem-solving skills, and the ability to design for diverse platforms and form factors.\nExpertise in user-centered design principles, design thinking, and design systems.\nExcellent communication, collaboration, and interpersonal skills.\nA demonstrated track record of working with teams that have shipped high-quality experiences.\nEnthusiasm for learning and adapting to new technologies – a commitment to exploring the exciting world of AI is a fundamental part of our culture.",
    "url": "https://www.acko.com/careers/jobs/55497/"
  },
  {
    "title": "DGM - Business Finance (FIN02102)",
    "location": "Bangalore",
    "company": "Acko",
    "description": "• Co-own the growth charters for partners along with the business heads\n• Lead insightful reviews of the business with the team to highlight risks in the business and suggest corrective actions\n• Create meaningful insights to lead business improvement and cost reductions.\n• Work closely with business and cost centre owners for management review discussions and provide commentary for budget vs. actual result variations\n• Support for board/ investor presentations\n• Continuously monitor leading and lagging indicators to actively support decision making\n• Analyse key business drivers, benchmark with competition and provide actionable insights to the management\n\n\nQualifications\n• CA/MBA/PGDM with 6+ years of experience\n• Prior experience of leading a business finance team with expertise in planning, budgeting & forecasting\n• Experience developing financial reports and metrics\n• Ability to manage multiple tasks and adapt to a changing, fast-paced environment\n• Prior experience of fintech/insurance company is an added advantage\n• Excellent Microsoft excel skills and logical thinking\n• Interpersonal and communication skills with the ability to interact with various management levels",
    "url": "https://www.acko.com/careers/jobs/55490/"
  },
  {
    "title": "SDE 2 Mobile (CEN02027)",
    "location": "Bangalore",
    "company": "Acko",
    "description": "About the Role:\nWe are looking for a passionate SDE2 Mobile Engineer with strong Flutter expertise and a growth mindset to join our team. You will play a key role in building the mobile ecosystem, This is an exciting opportunity to work on a greenfield projects, where you will have significant ownership and impact on the final product.\n\n\nKey Responsibilities:\nDesign, build, and maintain robust, scalable, and high-performance mobile applications using Flutter for both iOS and Android.\nCollaborate with product managers, designers, and backend engineers to deliver a seamless and engaging user experience.\nOptimize the app for performance, ensuring smooth animations and minimal load times.\nWrite clean, maintainable, and well-tested code, while adhering to best practices in mobile architecture and state management.\nTake ownership of features and drive them from development to production, ensuring quality through code reviews and continuous integration.\nContribute to and help shape the product vision, bringing innovative ideas and solutions.\nContinuously learn and implement new tools, frameworks, and best practices to enhance development productivity and product quality.\nRequired Qualifications:\n3+ years of experience in mobile app development with at least 2 years working with Flutter.\nProven experience in building and launching 0-to-1 products in a fast-paced environment.\nStrong understanding of Dart, Flutter Widgets, state management solutions, and mobile UI/UX principles.\nHands-on experience with RESTful APIs, third-party SDK integration, and Firebase services.\nKnowledge of the full mobile development lifecycle, including App Store and Play Store submission processes.\nStrong debugging and problem-solving skills, with the ability to troubleshoot complex issues in a production environment.\nGrowth mindset with a passion for learning and a proactive attitude toward solving new challenges.\nExcellent collaboration skills, able to work well in a team-oriented, agile environment.",
    "url": "https://www.acko.com/careers/jobs/55415/"
  },
  {
    "title": "Training Specialist – Contact Center (TRA01974)",
    "location": "Amritsar",
    "company": "Acko",
    "description": "Job Title: Training Specialist – Contact Center\nLocation: Amritsar\nDepartment: Learning & Development\nReports To: L&D Manager\nEmployment Type: Full-Time\n\n\nJob Summary:\nWe’re looking for a dynamic Training Specialist with a passion for developing people and elevating customer experience in a contact center environment. The ideal candidate will lead training needs analysis (TNA), deliver high-impact onboarding and refresher trainings, collaborate with cross-functional stakeholders, and drive continuous learning initiatives. If you thrive in fast-paced environments and love blending process with people, we want you on our team.\n\n\nKey Responsibilities:\n1. Training Needs Analysis (TNA)\nConduct detailed TNA to identify skill, knowledge, and behavior gaps across customer service teams.\nAlign TNA insights with business priorities to inform training plans.\n2. Training Delivery\nDeliver engaging new hire training programs to ensure seamless onboarding.\nFacilitate timely refresher and upskilling sessions for existing employees across BAU and new process changes.\n3. Stakeholder Collaboration\nPartner with Operations, Quality, and Product teams to co-design role-specific training programs.\nSupport QA-driven monthly initiatives and action plans through targeted coaching interventions.\n4. Content Development & Management\nDesign and continuously update training modules, decks, job aids, SOPs, and quick reference guides.\nDraft high-impact calling scripts and email templates in collaboration with frontline teams.\n5. Communication & Process Updates\nPublish and communicate process updates across the floor in a timely and accessible manner.\nPromote a learning culture by sharing best practices, success stories, and customer appreciations.\n6. Documentation & Reporting\nMaintain comprehensive training records and track learning outcomes.\nPublish monthly training reports, feedback summaries, and improvement metrics.\n7. Learning Innovation\nIntroduce and implement new training tools, formats, and microlearning strategies.\nLeverage AI and automation tools to enhance training impact and engagement.\nQualifications:\nBachelor’s degree in any discipline.\n2–4 years of experience in customer support or training roles, preferably in a contact center environment.\nProficiency in G-Suite and learning tools.\nFamiliarity with AI-driven learning platforms or tools is a bonus.\nKey Competencies:\nAnalytical Thinking: Ability to decode performance data and identify training gaps.\nCommunication: Strong verbal and written skills for delivering clear, concise training.\nEmpathy & Influence: Can connect with diverse audiences and inspire behavior change.\nCreativity: Innovates with content and delivery methods to maintain engagement.\nAttention to Detail: Maintains accurate and organized documentation.\nWhy Join Us?\nWork at the heart of customer excellence, drive real impact, and shape how we deliver world-class service. At ACKO, your ideas and passion for learning will directly influence how thousands of customers experience care and delight.",
    "url": "https://www.acko.com/careers/jobs/55360/"
  },
  {
    "title": "Training Specialist – Contact Center (TRA01973)",
    "location": "Bhopal",
    "company": "Acko",
    "description": "Job Title: Training Specialist – Contact Center\nLocation: Bhopal\nDepartment: Learning & Development\nReports To: L&D Manager\nEmployment Type: Full-Time\n\n\nJob Summary:\nWe’re looking for a dynamic Training Specialist with a passion for developing people and elevating customer experience in a contact center environment. The ideal candidate will lead training needs analysis (TNA), deliver high-impact onboarding and refresher trainings, collaborate with cross-functional stakeholders, and drive continuous learning initiatives. If you thrive in fast-paced environments and love blending process with people, we want you on our team.\n\n\nKey Responsibilities:\n1. Training Needs Analysis (TNA)\nConduct detailed TNA to identify skill, knowledge, and behavior gaps across customer service teams.\nAlign TNA insights with business priorities to inform training plans.\n2. Training Delivery\nDeliver engaging new hire training programs to ensure seamless onboarding.\nFacilitate timely refresher and upskilling sessions for existing employees across BAU and new process changes.\n3. Stakeholder Collaboration\nPartner with Operations, Quality, and Product teams to co-design role-specific training programs.\nSupport QA-driven monthly initiatives and action plans through targeted coaching interventions.\n4. Content Development & Management\nDesign and continuously update training modules, decks, job aids, SOPs, and quick reference guides.\nDraft high-impact calling scripts and email templates in collaboration with frontline teams.\n5. Communication & Process Updates\nPublish and communicate process updates across the floor in a timely and accessible manner.\nPromote a learning culture by sharing best practices, success stories, and customer appreciations.\n6. Documentation & Reporting\nMaintain comprehensive training records and track learning outcomes.\nPublish monthly training reports, feedback summaries, and improvement metrics.\n7. Learning Innovation\nIntroduce and implement new training tools, formats, and microlearning strategies.\nLeverage AI and automation tools to enhance training impact and engagement.\nQualifications:\nBachelor’s degree in any discipline.\n2–4 years of experience in customer support or training roles, preferably in a contact center environment.\nProficiency in G-Suite and learning tools.\nFamiliarity with AI-driven learning platforms or tools is a bonus.\nKey Competencies:\nAnalytical Thinking: Ability to decode performance data and identify training gaps.\nCommunication: Strong verbal and written skills for delivering clear, concise training.\nEmpathy & Influence: Can connect with diverse audiences and inspire behavior change.\nCreativity: Innovates with content and delivery methods to maintain engagement.\nAttention to Detail: Maintains accurate and organized documentation.\nWhy Join Us?\nWork at the heart of customer excellence, drive real impact, and shape how we deliver world-class service. At ACKO, your ideas and passion for learning will directly influence how thousands of customers experience care and delight.",
    "url": "https://www.acko.com/careers/jobs/55359/"
  },
  {
    "title": "Content Editor (CON01955)",
    "location": "Bangalore",
    "company": "Acko",
    "description": "Role Overview:\nAs an SEO Content Writer, you will be responsible for creating original and compelling content that is tailored to both our audience and SEO best practices. We are looking for a professional with at least 5 years of SEO content writing experience, ideally in the travel industry. The successful candidate will be adept at conducting competitor analysis, formulating content strategies, and utilizing SEO tools like Ahrefs, SEMrush, Google Analytics, Google Search Console, and Grammarly. You will also be expected to avoid using AI-generated content and ensure all content is unique and tailored to our brand’s voice and standards.\n\n\nKey Responsibilities:\nContent Creation:\nWrite high-quality, engaging, and SEO-optimized content, including blog posts, articles, landing pages, and other digital content formats. All content should be unique, well-researched, and free from AI-generated content.\nSEO Strategy Development:\nDevelop and execute content strategies based on in-depth competitor analysis. Optimize content to meet SEO goals, improving organic search visibility, rankings, and user engagement.\nOn-Page SEO Optimization:\nImplement SEO best practices, including keyword research, on-page optimization (headings, meta descriptions, alt text), and internal linking to improve search engine performance.\nTool Utilization:\nUse tools like Ahrefs, SEMrush, Google Analytics, Google Search Console, Grammarly, and AI detection tools to track content performance, monitor keyword rankings, and identify optimization opportunities.\nContent Calendar Management:\nPlan and manage a content calendar that aligns with business and SEO objectives, ensuring consistent publishing and timely execution of content campaigns.\nCompetitor Analysis:\nRegularly analyze competitor content and identify opportunities for differentiation and improvement. Adapt content strategies based on data-driven insights to outperform competitors.\nContent Reporting:\nTrack and report on the effectiveness of content strategies through performance metrics, such as organic traffic, user engagement, and rankings. Provide actionable insights for content optimization.\nCollaboration:\nWork closely with the SEO, marketing, and design teams to ensure content aligns with overall strategy and is fully optimized for both search engines and user experience.",
    "url": "https://www.acko.com/careers/jobs/55341/"
  },
  {
    "title": "Fleet Supervisor (OPE01947)",
    "location": "Ahmedabad",
    "company": "Acko",
    "description": "Plan and assign daily tasks to the team based on inflow and criticality of the tasks.\nHandle customer complaints and escalations and drive them to logical closure with help from the TL\nAll assigned tasks need to be performed within the stipulated timelines and Quality standards by the team.\nDrive daily Operational metrics by interacting with the FEs and tracking real time status on the ground.\nCommunicate effectively with Acko management and the FE team regarding real time customer issues and escalations to provide timely resolution/closure of all tasks.\nEnsure appropriate documentation and records are maintained and checked as per the SOP for each task.\nBe responsible for end to end Customer Experience and work towards improving the same through frequent improvement projects and training interventions\nBuild a strong team of FEs by guiding and motivating them to deliver on their KPIs and by providing continuous feedback/training etc.\nLiaise with internal stakeholders as and when required to build better processes and internal controls\nWork towards measuring and improving CSAT/NPS/CES metrics on a regular basis",
    "url": "https://www.acko.com/careers/jobs/55333/"
  },
  {
    "title": "Fleet Supervisor (OPE01945)",
    "location": "Gurgaon",
    "company": "Acko",
    "description": "Plan and assign daily tasks to the team based on inflow and criticality of the tasks.\nHandle customer complaints and escalations and drive them to logical closure with help from the TL\nAll assigned tasks need to be performed within the stipulated timelines and Quality standards by the team.\nDrive daily Operational metrics by interacting with the FEs and tracking real time status on the ground.\nCommunicate effectively with Acko management and the FE team regarding real time customer issues and escalations to provide timely resolution/closure of all tasks.\nEnsure appropriate documentation and records are maintained and checked as per the SOP for each task.\nBe responsible for end to end Customer Experience and work towards improving the same through frequent improvement projects and training interventions\nBuild a strong team of FEs by guiding and motivating them to deliver on their KPIs and by providing continuous feedback/training etc.\nLiaise with internal stakeholders as and when required to build better processes and internal controls\nWork towards measuring and improving CSAT/NPS/CES metrics on a regular basis",
    "url": "https://www.acko.com/careers/jobs/55331/"
  },
  {
    "title": "Fleet Supervisor (OPE01942)",
    "location": "Bangalore",
    "company": "Acko",
    "description": "Plan and assign daily tasks to the team based on inflow and criticality of the tasks.\nHandle customer complaints and escalations and drive them to logical closure with help from the TL\nAll assigned tasks need to be performed within the stipulated timelines and Quality standards by the team.\nDrive daily Operational metrics by interacting with the FEs and tracking real time status on the ground.\nCommunicate effectively with Acko management and the FE team regarding real time customer issues and escalations to provide timely resolution/closure of all tasks.\nEnsure appropriate documentation and records are maintained and checked as per the SOP for each task.\nBe responsible for end to end Customer Experience and work towards improving the same through frequent improvement projects and training interventions\nBuild a strong team of FEs by guiding and motivating them to deliver on their KPIs and by providing continuous feedback/training etc.\nLiaise with internal stakeholders as and when required to build better processes and internal controls\nWork towards measuring and improving CSAT/NPS/CES metrics on a regular basis",
    "url": "https://www.acko.com/careers/jobs/55328/"
  },
  {
    "title": "Fleet Supervisor (OPE01940)",
    "location": "Mumbai",
    "company": "Acko",
    "description": "Plan and assign daily tasks to the team based on inflow and criticality of the tasks.\nHandle customer complaints and escalations and drive them to logical closure with help from the TL\nAll assigned tasks need to be performed within the stipulated timelines and Quality standards by the team.\nDrive daily Operational metrics by interacting with the FEs and tracking real time status on the ground.\nCommunicate effectively with Acko management and the FE team regarding real time customer issues and escalations to provide timely resolution/closure of all tasks.\nEnsure appropriate documentation and records are maintained and checked as per the SOP for each task.\nBe responsible for end to end Customer Experience and work towards improving the same through frequent improvement projects and training interventions\nBuild a strong team of FEs by guiding and motivating them to deliver on their KPIs and by providing continuous feedback/training etc.\nLiaise with internal stakeholders as and when required to build better processes and internal controls\nWork towards measuring and improving CSAT/NPS/CES metrics on a regular basis",
    "url": "https://www.acko.com/careers/jobs/55326/"
  },
  {
    "title": "Fleet Supervisor (OPE01938)",
    "location": "Chennai",
    "company": "Acko",
    "description": "Plan and assign daily tasks to the team based on inflow and criticality of the tasks.\nHandle customer complaints and escalations and drive them to logical closure with help from the TL\nAll assigned tasks need to be performed within the stipulated timelines and Quality standards by the team.\nDrive daily Operational metrics by interacting with the FEs and tracking real time status on the ground.\nCommunicate effectively with Acko management and the FE team regarding real time customer issues and escalations to provide timely resolution/closure of all tasks.\nEnsure appropriate documentation and records are maintained and checked as per the SOP for each task.\nBe responsible for end to end Customer Experience and work towards improving the same through frequent improvement projects and training interventions\nBuild a strong team of FEs by guiding and motivating them to deliver on their KPIs and by providing continuous feedback/training etc.\nLiaise with internal stakeholders as and when required to build better processes and internal controls\nWork towards measuring and improving CSAT/NPS/CES metrics on a regular basis",
    "url": "https://www.acko.com/careers/jobs/55324/"
  },
  {
    "title": "Fleet Supervisor (OPE01937)",
    "location": "Pune",
    "company": "Acko",
    "description": "Plan and assign daily tasks to the team based on inflow and criticality of the tasks.\nHandle customer complaints and escalations and drive them to logical closure with help from the TL\nAll assigned tasks need to be performed within the stipulated timelines and Quality standards by the team.\nDrive daily Operational metrics by interacting with the FEs and tracking real time status on the ground.\nCommunicate effectively with Acko management and the FE team regarding real time customer issues and escalations to provide timely resolution/closure of all tasks.\nEnsure appropriate documentation and records are maintained and checked as per the SOP for each task.\nBe responsible for end to end Customer Experience and work towards improving the same through frequent improvement projects and training interventions\nBuild a strong team of FEs by guiding and motivating them to deliver on their KPIs and by providing continuous feedback/training etc.\nLiaise with internal stakeholders as and when required to build better processes and internal controls\nWork towards measuring and improving CSAT/NPS/CES metrics on a regular basis",
    "url": "https://www.acko.com/careers/jobs/55323/"
  },
  {
    "title": "Director- Health Pricing & Strategy (HEA01928)",
    "location": "Bangalore",
    "company": "Acko",
    "description": "Strategic Actuarial Pricing - Own the pricing function for Retail and Group Health products.\nEnsure pricing is not just technically sound but also competitive and aligned with business strategy.\nProfitability Management - Monitor and improve the profitability levers — pricing, product design, underwriting, claims, fraud, etc. Use portfolio analytics to influence the direction of business decisions.\nProduct Design & Filing\nIdeate and implement innovative product solutions for different market segments.\nLead the entire regulatory filing process and ensure compliance.\nGrowth & Differentiation\nIdentify white spaces or underserved segments where product/pricing innovation can unlock new revenue.\nCross-Functional Leadership\nWork shoulder-to-shoulder with product, sales, underwriting, and analytics teams.\nInfluence the underwriting rule engine, digital journeys, and portfolio steering tools.\nTech & Analytics Integration\nPartner with tech and data science teams to embed pricing and underwriting logic into platforms.\\\nTeam Leadership\nBuild, coach, and mentor a high-performing actuarial team.\nBalance tactical execution with strategic development of junior talent.",
    "url": "https://www.acko.com/careers/jobs/55314/"
  },
  {
    "title": "Assistant Manager - Product Filing (COR01922)",
    "location": "Bangalore",
    "company": "Acko",
    "description": "Key Roles & Responsibilities:\nPreparing Filing documents as per prevailing Regulator's guidelines.\nCoordinate with Stakeholders on gathering requirements with regard to new product filing.\nMaintaining records of documents filed and launched.\nPreparing various reports to be submitted to PMC and IRDAI.\nEnsuring compliance as per product filing guidelines and product approval.\nClosely monitor the competitor products being launched in the market.\nClosely monitor the TAT related to product filing & product launch within stipulated time.\nKey Roles & Responsibilities:\nPreparing Filing documents as per prevailing Regulator's guidelines.\nCoordinate with Stakeholders on gathering requirements with regard to new product filing.\nMaintaining records of documents filed and launched.\nPreparing various reports to be submitted to PMC and IRDAI.\nEnsuring compliance as per product filing guidelines and product approval.\nClosely monitor the competitor products being launched in the market.\nClosely monitor the TAT related to product filing & product launch within stipulated time.",
    "url": "https://www.acko.com/careers/jobs/55308/"
  }
]