[
  {
    "title": "Software Development Manager, Device Software Services",
    "company": "Amazon",
    "location": "IND, KA, Bangalore",
    "description": "DESCRIPTION\n\nThe Device Software Services organization is specialized in building foundational platform solutions that cater to a number of critical customer experiences across Amazon devices.\n\nWe are hiring a Software Development Manager to lead the Devices Multi Tenancy and Infrastructure team that builds core capabilities required for DS2 Services to be multi-tenant and provide custom services for DS2 tenants. This includes framework for Tenant Management and Tenant specific customization handling, federated authentication and fine grained access control and management.\n\nAs a Software Development Manager you enjoy taking on hard, ambiguous problems and breaking them down to their simple parts. You are creative, driven, and highly productive. You are a great team player who will naturally elevate the performance of the people around you. You have a track record of quickly ramping up on complex technical systems, demonstrating strong judgment, and identifying opportunities for our customers. You have the ability to manage multiple competing priorities in a fast-paced environment and deliver results.\n\n\nKey job responsibilities\n• Lead and mentor a team of software engineers, fostering technical excellence and career development while driving engineering best practices\n• Own end-to-end delivery of complex software projects, managing scope, timelines, and resource allocation across multiple workstreams\n• Drive architectural decisions and technical strategy aligned with business objectives and Amazon's leadership principles\n• Collaborate with product managers, other engineering teams, and stakeholders to define technical roadmaps and deliver customer-focused solutions\n• Manage team performance, conduct hiring, provide performance reviews, and make data-driven decisions for team growth and composition\n• Ensure operational excellence through metrics, monitoring, and continuous improvement of systems reliability and scalability\n• Implement and enforce security best practices, compliance requirements, and risk management strategies across team deliverables\n• Drive innovation and technical excellence while maintaining high standards for code quality, testing, and documentation",
    "url": "https://www.amazon.jobs/en/jobs/3026368/software-development-manager-device-software-services"
  },
  {
    "title": "SDE II, Traffic Quality, Supply Quality",
    "company": "Amazon",
    "location": "IND, KA, Bangalore",
    "description": "DESCRIPTION\n\nAdvertising at Amazon is a fast-growing multi-billion dollar business that spans across desktop, mobile and connected devices; encompasses ads on Amazon and a vast network of hundreds of thousands of third party publishers; and extends across US, EU and an increasing number of international geographies. The Supply Quality team in Bangalore has the charter to build data-science focused products and platforms for indexing and modulating the quality of supply in Amazon Advertising. One of our key focus areas is Traffic Quality where we endeavour to identify non-human and invalid traffic within programmatic ad sources, and weed them out to ensure a high quality advertising marketplace. We do this by building machine learning, large language models, and optimization algorithms that operate at scale, and leverage nuanced features about user, context, and creative engagement to determine the validity of traffic. The challenge is to stay one step ahead by investing in deep analytics and developing new algorithms, including advanced LLM-based detection systems, that address emergent attack vectors in a structured and scalable fashion. We are committed to building a long-term traffic quality solution that encompasses all Amazon advertising channels and provides state-of-the-art traffic filtering that preserves advertiser trust and saves them hundreds of millions of dollars of wasted spend.\n\nWe typically process ad-impressions and clicks in the orders of billions per day. To handle data at this scale, we use open source technologies like Hadoop, Spark, Redis and Amazon's cloud services like EC2, S3, EMR, DynamoDB and RedShift. We build and deploy complex machine learning, LLM-powered systems, and advanced optimization algorithms that operate at scale. All of our systems tend to be loosely coupled, communicating using synchronous and asynchronous messaging, leading to a classic distributed processing architecture. We are building real-time platforms to detect robotic clicks by evaluating complex bot patterns on the traffic data, enhanced by LLM-based pattern recognition. We are also building a large-scale data mining platform to automatically detect anomalies in traffic patterns and identify complex feature combinations that explain the anomaly.\n\nThe Traffic Quality team is looking for talented Engineers who enjoy working on creative algorithms, building large-scale systems and who thrive in a fast paced fun environment. As an engineer you would design business critical systems, write high quality code and mentor other engineers. You should have owned, designed and delivered multiple products. You have deep knowledge of Java/C++, Object-oriented Design, Service Oriented Architecture, and experience with LLM integration. You are passionate about building massively scalable solutions and distributed systems.\n\nAmazon.com offers competitive salary, stock grants, health and other benefits.",
    "url": "https://www.amazon.jobs/en/jobs/3026351/sde-ii-traffic-quality-supply-quality"
  },
  {
    "title": "Solutions Engineer, Developer Solutions and Engineering Team",
    "company": "Amazon",
    "location": "IND, KA, Bangalore\nIND, TN, Chennai",
    "description": "DESCRIPTION\n\nAre you passionate about mobile apps? As a Solutions Engineer for Content Apps and Partner Engagement (CAPE) team, you will develop world class technical solutions to enable developers, distribute their apps and games within the Amazon Appstore, and grow their businesses. As a Solutions Engineer, you will work with third party developers to analyze and resolve issues with application development for general Android, Amazon mobile SDKs and APIs, as well as Amazon Fire devices. You will be interacting with both external developers and internal teams via a number of communication channels to drive solutions that meet developer needs. If you have a passion for the app space, a solid understanding of the technologies involved, and a strong ability to communicate clearly and advocate for mobile app developers, this role is for you.\n\nKey job responsibilities\n- Escalation level debugging and troubleshooting for app developers\n- Analyzing, solving, and creating solutions for developers\n- Developing documentation and other materials to support developers\n- Act as a subject matter expert for Amazon mobile APIs and Services, as well as Amazon Devices\n- Driving projects to improve the Amazon developer experience\n- Provide engineering support of our incoming tickets, including extensive troubleshooting and debugging, with responsibilities covering multiple product lines.\n- Work on maintenance of coding projects, primarily in Perl or shell scripts, web technologies, and Java based projects.\n- Read and understand complex application code and make code fixes to resolve support issues\n- Develop tools to aid operations and maintenance.\n- Ownership of one or more Digital products or components.\n- Customer notification and workflow co-ordination and follow-up to maintain service level agreements.\n- Work with engineering team for handing-off or taking over active support issues and to create a team specific knowledge base and skill set.\n\nA day in the life\nThe SE team currently has four key responsibilities: 1) Ongoing Steady State Support across partners, 2) Feature Integration and New App Launch Support, 3) Operational Excellence to improve time-to-resolution and reporting on tactical support and 4) Tier-2 support for un-managed partner apps and drive issues to closure working with internal product teams to assist in resolution as needed.\n\nAbout the team\nCAPE Developer Support & Engineering (DSE) team manages technical support for customer and partner issues and app feature integrations on Managed Video Partner apps (SPARQ based partner segmentation in US/CA & International countries)",
    "url": "https://www.amazon.jobs/en/jobs/2886082/solutions-engineer-developer-solutions-and-engineering-team"
  },
  {
    "title": "Software Development Engineer II, Advertising - Viewability and User Engagement",
    "company": "Amazon",
    "location": "IND, KA, Bangalore",
    "description": "DESCRIPTION\n\nAdvertising at Amazon is a fast-growing business that spans across desktop, mobile, video, and connected devices. Amazon Worldwide Advertising enables advertisers to deliver several billion ad impressions everyday to a network of hundreds of thousands of third party publishers as well as Amazon’s owned and operated properties. Viewability and User Engagement (VUE) owns Amazon’s (1P) viewability measurement and Machine Learning model-based prediction of premium ad inventory.\n\nOur team consists of JavaScript experts, Back-End engineers, Machine Learning engineers, and Data Scientists who are building technologies to capture viewability of ads, track user engagement with ads, detect fraudulent activity using client side pixels, predict probability of view and engagement at when a bid is placed. The team has very high visibility within the advertising organization and is very active in inventing new solutions to solve complex problems for Amazon and the digital advertising industry.\n\n\nKey job responsibilities\nWe are looking for sharp and talented software engineers who are passionate about front-end technologies and/or AWS technologies and building solutions that are highly scalable, low latency, fault tolerant, cross browser compliant. As an SDE with the VUE team, you will\n\n* leverage latest open source technologies and the latest AWS services to process billions of ad impressions,\n* create solutions that enable efficient ML experimentation and training on distributed systems at incredible scale and speed,\n* develop components of our client side metrics libraries that helps to capture essential user metrics while serving an impression, and\n* see your software operate at internet scale, influence the design of key parts of infrastructure, and see how your solutions scale as Amazon’s advertising business continues to grow",
    "url": "https://www.amazon.jobs/en/jobs/2998306/software-development-engineer-ii-advertising-viewability-and-user-engagement"
  },
  {
    "title": "Software Development Engineer, Prime Video & Studios CoreTech",
    "company": "Amazon",
    "location": "IND, KA, Bangalore",
    "description": "DESCRIPTION\n\nThe Amazon Prime Video team is looking for a smart, motivated, and results-oriented Software Development Engineer to join the team. We are a high-energy group changing focussed on the PV experience for Indian users to watch TV and movies.\nWe are looking for candidates who are passionate about delivering world-class digital media experiences to our customers. Successful candidates for this position will be self-starters with excellent problem solving skills who love getting things done. Effective communication skills and a desire to tackle complex problems that emerge from driving a large business at Amazon are also a must.\nOur team is looking for an experienced SDE who will play an instrumental role in defining the system architecture, own and implement specific components, and help shape the overall experience for the Prime Video customers. You’ll collaborate closely with Product team, UX designers, and other SDE team members to help define the scope and roadmap of the product. As an early team member, you will take responsibility for technical problem solving, creatively meeting product objectives, and developing best practices.\nYou will demonstrate cross-functional resource interaction to accomplish your goals. You will play a role in defining processes and methods to improve the productivity of the entire team. You are a person with a commitment to team work, who enjoys working on variety of tech stacks, is customer centric, and thrives on the challenge of building solutions that will operate at world-wide scale.\n\nKey job responsibilities\n3+ years of non-internship professional software development experience\n2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\n3+ years of Video Games Industry (supporting title Development, Release, or Live Ops) experience\nExperience programming with at least one software programming language",
    "url": "https://www.amazon.jobs/en/jobs/3007582/software-development-engineer-prime-video-studios-coretech"
  },
  {
    "title": "Software Dev Engineer - II, RBS Tech",
    "company": "Amazon",
    "location": "IND, KA, Bengaluru",
    "description": "DESCRIPTION\n\nDESCRIPTION\nRetail Business Services (RBS) supports Amazon’s Retail business growth WW through three core tasks. These are (a) Selection, where RBS sources, creates and enrich ASINs to drive GMS growth; (b) Defect Elimination: where RBS resolves inbound supply chain defects and develops root cause fixes to improve free cash flow and (c) supports operational process for WW Retail teams where there is an air gap in the tech stack. The tech team in RBS develops automation that leverages Machine/Deep Learning to scale execution of these high complex tasks that currently require human cognitive skills. Our solutions ensure that information in Amazon's catalog is complete, correct and, comprehensive enough to give Amazon customers a great shopping experience every time. We are building solutions to move towards retail automation and are using latest technology like LLM to solve business problems.\n\nWe believe in “Work Hard. Have Fun. Make History” value by having a strong focus on sharing learning experiences from the front line with the development teams. So, the options for people in the team are vast. If you like mastering a domain and going deep, we need you. If you can juggle three tasks and coordinate with multiple people in the heat of an incident, we need you. If you love the benefits of process and methodical improvement, you will love it here. If you want to keep your head down, headphones on, and bash out code to support the team, we have a spot for you too.\n\nAt Amazon, we hire the best minds in technology to innovate and build on behalf of our customers. The focus we have on our customers is why we are one of the world’s most beloved brands – customer obsession is part of our company DNA.\nWe are seeking a Software Development Engineer who can design and develop systems for its businesses. As an SDE, you would have immense opportunity to explore avenues of how to model things, figure out right abstraction level, take judgement calls around multiple design trade offs at hand that influence a multi billion dollar business.\nWe are looking for highly talented software development engineers who are passionate not only about architecting and developing large scale distributed technology solutions but also innovating new ideas and providing directions to our business. You will get to work on some of the key initiatives planned to support our rapid evolution and growth of our businesses. In this process you will drive best practices, mentor other engineers, drive continuous improvements in engineering and operational excellence. You will use cutting-edge technology to solve complex problems and get to see the impact of their work first-hand. The challenges SDEs solve for at Amazon are big and influence millions of customers, sellers, and products around the world. As a SDE with RBS team, you will work with talented peers of SDEs and Applied scientists to build robust engineering platforms to solve high impact issues. You will constantly stretch the boundaries of innovation to tackle the business challenges.\n\nIf you enjoy designing and building highly distributed systems that can scale and solving challenging problems, come to join us!\n\nWork/Life Balance\nRBS Tech team puts a high value on work-life harmony. It isn’t about how many hours you spend at home or at work; it’s about the flow you establish that brings energy to both parts of your life. We believe striking the right balance between your personal and professional life is critical to life-long happiness and we encourage you to find your own balance between your work and personal lives.\n\nMentorship & Career Growth\nOur team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we’re building an environment that celebrates knowledge sharing and mentorship. Our senior members enjoy one-on-one mentoring, detailed and constructive code reviews. We have casual coffee chats with Principal & Senior Engineers from RBS tech. You get an opportunity to network and have technical conversations around your work, technical challenges, suggestions, ideas and proposals. You can also seek advice and discuss about things outside work, like, life in general, your family, hobbies etc. We provide trainings to the employees through online learning platforms such as O'reilly and also encourage them to take up AWS/ML certifications.\n\n\nKey job responsibilities\nWe are looking for a sharp, experienced Software developer with a diverse skillset and background. As a SDE-2, your work is consistently of high quality. You solve difficult problems, applying appropriate technologies and best practices. You work with your team to invent, design and build software that is stable and performant. You are proficient in a broad range of design approaches and know when it is appropriate to use them (and when it is not). You limit the use of short-term workarounds. You create flexible software without over-engineering. You make appropriate trade-offs, re-use where possible, and are judicious about introducing dependencies. You are efficient with resource usage (e.g., system hardware, database, memory/CPU, etc.). You work on project ideas with customers, stakeholders, and peers. You help your team evolve by actively participating in the code review process, design discussions, team planning, and ticket/metric reviews. You focus on operational excellence, constructively identifying problems and proposing solutions. You take on projects and make software enhancements that improve team software and processes. You are able to train new team-mates on how your team’s software is constructed, how it operates, how secure it is, and how it fits into the bigger picture. You foster a constructive dialogue and seek resolutions in a professional way. You help recruit and interview for your team. You mentor and help to develop others.",
    "url": "https://www.amazon.jobs/en/jobs/3026242/software-dev-engineer-ii-rbs-tech"
  },
  {
    "title": "Software Development Engineer I",
    "company": "Amazon",
    "location": "IND, KA, Bangalore",
    "description": "DESCRIPTION\n\nYou use technology to validate and verify software, seeking input from team members on the best software test techniques to utilize. Your scope of work is to extend and effectively apply existing automation frameworks for small to mid-size components and/or product features. You may create or have responsibility to improve existing test tools. You are able to take a defined design and turn it into code and deliver it on schedule, applying appropriate technologies and current software engineering best practices. You write secure, stable, testable, maintainable code with minimal defects. You are proficient in a broad range of data structures and algorithms, knowing when it is appropriate to use them (and when it is not). You make appropriate implementation trade-off decisions (e.g., array or hash table?). You do not put the company at risk (e.g. pulling in unlicensed code, working on code in unsafe ways, test payment transactions in prod, etc.). You participate in team design, scoping and prioritization discussions. Your input to test plans and test cases are of high quality and high value. You seek to learn the business context and technologies behind your team’s software. You invent, refine and develop your solutions to ensure they are meeting team needs and project goals. You are a passionate advocate for your customer. You assume responsibility for the state of the code you inherit, produce, and test. You get your designs, code, and test plans reviewed. You test code thoroughly. You classify, store, and handle data in accordance with Amazon policies. You track risks and mitigate and/or escalate them in a timely manner. You take the time to understand the maintenance characteristics, runtime properties, and dependencies of your team’s software, including hardware platform, operating system and build dependencies. You prevent bugs from causing customer pain. You clearly document your software to ensure that future generations of developers understand the intention behind the test solutions you build. You troubleshoot, research the root cause of problems, and thoroughly resolve defects. You take ownership of problems (even when outside your own domain), propose solutions, and either take ownership for their resolution or ensure a clear hand-off to the right owner.",
    "url": "https://www.amazon.jobs/en/jobs/2959826/software-development-engineer-i"
  },
  {
    "title": "Software Development Manager",
    "company": "Amazon",
    "location": "IND, KA, Bengaluru",
    "description": "DESCRIPTION\n\nREADY TO DO SOMETHING BIG?\n\nHow would you build the next generation of mission critical systems and services that power the ability to send, store and manage billions of products across the globe on behalf of our selling partners?\n\nFulfillment by Amazon (FBA) is the Amazon service for world-wide sellers that offers access to Amazon’s vast distribution network as a service. Similar to how AWS provides infrastructure as a service, FBA allows sellers to only pay for what they use, creating a seamless experience to leverage our world-class infrastructure. Sellers, from Fortune 50 companies to hundreds of thousands of small businesses and entrepreneurs, in 135 countries worldwide, rely upon our world-leading technology to grow and thrive on Amazon’s Marketplaces.\n\nAs a leader within FBA, you will provide both strategic and tactical oversight to build the features and functionality required to have the best in class offering for sellers. This leader will create mechanisms to drive optimal seller behavior for FBA inventory management, reducing total supply chain costs and making it easier for sellers to get their inventory close to customers, delivering more items with a Prime delivery promise. This leader will invent new ways to deliver value for sellers and their products, while leveraging the scale and innovation of technology from across the Amazon family, including AWS.\n\nWe operate as a startup within Amazon, providing our team great flexibility in product and technology direction. Come, join us and build the future!\n\nKey job responsibilities\nThis Software Development Manager role is pivotal to delivering an exceptional experience for FBA customers and sellers worldwide. This leader will manage a team that develops and maintains highly scalable, highly available web services and systems at the heart of FBA technology offerings. These services support the FBA business globally, through rapidly evolving and complex demands in a high-9’s availability environment.\n\nA day in the life\nThis leader will:\n* Work with senior leaders in FBA to define product strategy and roadmap\n* Lead high-quality execution of software products against project plans and delivery commitments; architect and develop the best technical designs for extensibility, reliability, and scalability\n* Build and develop a high performance software development organization by hiring, mentoring and growing a best-in-class team\n* Own all operational metrics and support\n* Work directly with development teams in Bellevue, Toronto, Bangalore, and across the globe on shared projects and dependent deliverables",
    "url": "https://www.amazon.jobs/en/jobs/3017815/software-development-manager"
  },
  {
    "title": "Business Intelligence Manager, Amazon Warehousing and Distribution",
    "company": "Amazon",
    "location": "IND, KA, Bangalore",
    "description": "DESCRIPTION\n\nAmazon Warehousing and Distribution (AWD) is seeking an exceptional Business Intelligence Manager to drive data-driven growth initiatives and shape the future of our global supply chain solutions.\n\nAbout AWD:\nWe're revolutionizing supply chain optimization by extending Amazon's world-class logistics capabilities to global sellers, enabling them to optimize their on and off-Amazon sales channels worldwide. As a core component of Supply Chain by Amazon, we're building a multi-tenant, bulk storage and distribution service that empowers businesses with cost-effective, flexible, and reliable end-to-end supply chain solutions.\n\nThe Role:\nAs Business Intelligence Manager, you will:\n• Lead a dynamic team developing critical data insights and analytics infrastructure\n• Partner with global executive management to inform strategic decision-making\n• Design and implement measurement and reporting frameworks\n• Drive data-driven solutions for our rapidly scaling business\n• Collaborate with teams across US, Europe, Japan, and other regions",
    "url": "https://www.amazon.jobs/en/jobs/2972966/business-intelligence-manager-amazon-warehousing-and-distribution"
  },
  {
    "title": "Software Dev Engineer - II, RBS Tech",
    "company": "Amazon",
    "location": "IND, KA, Bengaluru",
    "description": "DESCRIPTION\n\nDESCRIPTION\nRetail Business Services (RBS) supports Amazon’s Retail business growth WW through three core tasks. These are (a) Selection, where RBS sources, creates and enrich ASINs to drive GMS growth; (b) Defect Elimination: where RBS resolves inbound supply chain defects and develops root cause fixes to improve free cash flow and (c) supports operational process for WW Retail teams where there is an air gap in the tech stack. The tech team in RBS develops automation that leverages Machine/Deep Learning to scale execution of these high complex tasks that currently require human cognitive skills. Our solutions ensure that information in Amazon's catalog is complete, correct and, comprehensive enough to give Amazon customers a great shopping experience every time. We are building solutions to move towards retail automation and are using latest technology like LLM to solve business problems.\n\nWe believe in “Work Hard. Have Fun. Make History” value by having a strong focus on sharing learning experiences from the front line with the development teams. So, the options for people in the team are vast. If you like mastering a domain and going deep, we need you. If you can juggle three tasks and coordinate with multiple people in the heat of an incident, we need you. If you love the benefits of process and methodical improvement, you will love it here. If you want to keep your head down, headphones on, and bash out code to support the team, we have a spot for you too.\n\nAt Amazon, we hire the best minds in technology to innovate and build on behalf of our customers. The focus we have on our customers is why we are one of the world’s most beloved brands – customer obsession is part of our company DNA.\nWe are seeking a Software Development Engineer who can design and develop systems for its businesses. As an SDE, you would have immense opportunity to explore avenues of how to model things, figure out right abstraction level, take judgement calls around multiple design trade offs at hand that influence a multi billion dollar business.\nWe are looking for highly talented software development engineers who are passionate not only about architecting and developing large scale distributed technology solutions but also innovating new ideas and providing directions to our business. You will get to work on some of the key initiatives planned to support our rapid evolution and growth of our businesses. In this process you will drive best practices, mentor other engineers, drive continuous improvements in engineering and operational excellence. You will use cutting-edge technology to solve complex problems and get to see the impact of their work first-hand. The challenges SDEs solve for at Amazon are big and influence millions of customers, sellers, and products around the world. As a SDE with RBS team, you will work with talented peers of SDEs and Applied scientists to build robust engineering platforms to solve high impact issues. You will constantly stretch the boundaries of innovation to tackle the business challenges.\n\nIf you enjoy designing and building highly distributed systems that can scale and solving challenging problems, come to join us!\n\nWork/Life Balance\nRBS Tech team puts a high value on work-life harmony. It isn’t about how many hours you spend at home or at work; it’s about the flow you establish that brings energy to both parts of your life. We believe striking the right balance between your personal and professional life is critical to life-long happiness and we encourage you to find your own balance between your work and personal lives.\n\nMentorship & Career Growth\nOur team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we’re building an environment that celebrates knowledge sharing and mentorship. Our senior members enjoy one-on-one mentoring, detailed and constructive code reviews. We have casual coffee chats with Principal & Senior Engineers from RBS tech. You get an opportunity to network and have technical conversations around your work, technical challenges, suggestions, ideas and proposals. You can also seek advice and discuss about things outside work, like, life in general, your family, hobbies etc. We provide trainings to the employees through online learning platforms such as O'reilly and also encourage them to take up AWS/ML certifications.\n\n\nKey job responsibilities\nWe are looking for a sharp, experienced Software developer with a diverse skillset and background. As a SDE-2, your work is consistently of high quality. You solve difficult problems, applying appropriate technologies and best practices. You work with your team to invent, design and build software that is stable and performant. You are proficient in a broad range of design approaches and know when it is appropriate to use them (and when it is not). You limit the use of short-term workarounds. You create flexible software without over-engineering. You make appropriate trade-offs, re-use where possible, and are judicious about introducing dependencies. You are efficient with resource usage (e.g., system hardware, database, memory/CPU, etc.). You work on project ideas with customers, stakeholders, and peers. You help your team evolve by actively participating in the code review process, design discussions, team planning, and ticket/metric reviews. You focus on operational excellence, constructively identifying problems and proposing solutions. You take on projects and make software enhancements that improve team software and processes. You are able to train new team-mates on how your team’s software is constructed, how it operates, how secure it is, and how it fits into the bigger picture. You foster a constructive dialogue and seek resolutions in a professional way. You help recruit and interview for your team. You mentor and help to develop others.",
    "url": "https://www.amazon.jobs/en/jobs/3026231/software-dev-engineer-ii-rbs-tech"
  },
  {
    "title": "Software Development Manager, AWD",
    "company": "Amazon",
    "location": "IND, KA, Bengaluru",
    "description": "DESCRIPTION\n\nWe are a startup team working to enable organizations across the world with reliable, cost effective and flexible end-to-end supply chain solutions, to help them scale, succeed and offer best in class experience to their customers. Amazon has spent years building one of the world’s most efficient and optimized supply chains. Amazon warehousing and distribution (AWD) is building on that foundation and continuing to innovate end-to-end supply chain capabilities.\n\nWe are looking for Software Development Managers who are seeking opportunities to apply their past experience supporting Amazon’s supply chain offerings. We aim to create a highly technical and entrepreneurial culture and you will help us foster that.\n\nKey job responsibilities\nKey job responsibilities\nOwn the roadmap of the charter that enables sellers and enterprises to leverage AWD for their on and off Amazon supply chain use-cases\nDocument and present strategies to senior management.\nManagement and execution against project plans and delivery commitments.\nManagement of resources, hiring, mentoring, enhancing and maintaining a best-of-class product development team.\nWork closely with the engineers and product managers to architect and develop the best technical design and approach.\nReport on status of development, quality, operations and system performance to leadership.\n\nThe ideal candidate will be a leader, quick learner and be able to work independently. He/she should be able to operate in a fast paced environment where time to hit market is super critical. The candidate will need to balance technical leadership and savvy with strong business judgment to make the right decisions.",
    "url": "https://www.amazon.jobs/en/jobs/2974509/software-development-manager-awd"
  },
  {
    "title": "Software Development Manager",
    "company": "Amazon",
    "location": "IND, KA, Bengaluru",
    "description": "DESCRIPTION\n\nAmazon has spent years building one of the world’s most efficient and optimized supply chains. Amazon warehousing and distribution (AWD) is building on that foundation and continuing to innovate end-to-end supply chain capabilities.\n\nWe are looking for Software Development Managers who are seeking opportunities to apply their past experience supporting Amazon’s supply chain offerings. We aim to create a highly technical and entrepreneurial culture and you will help us foster that.\n\n\n\n\n\n\n\n\nKey job responsibilities\nOwn the roadmap of the charter that enables sellers and enterprises to leverage AWD for their on and off Amazon supply chain use-cases\nDocument and present strategies to senior management.\nManagement and execution against project plans and delivery commitments.\nManagement of resources, hiring, mentoring, enhancing and maintaining a best-of-class product development team.\nWork closely with the engineers and product managers to architect and develop the best technical design and approach.\nReport on status of development, quality, operations and system performance to leadership.\n\nThe ideal candidate will be a leader, quick learner and be able to work independently. He/she should be able to operate in a fast paced environment where time to hit market is super critical. The candidate will need to balance technical leadership and savvy with strong business judgment to make the right decisions.",
    "url": "https://www.amazon.jobs/en/jobs/2985254/software-development-manager"
  },
  {
    "title": "Software Development Engineer , Amazon Photos",
    "company": "Amazon",
    "location": "IND, KA, Bengaluru",
    "description": "DESCRIPTION\n\nAmazon Photos empowers customers to preserve, share, and relieve their memories using innovative AI-powered experiences on mobile applications, web, desktop, Amazon devices, and as part of Alexa+. We strive to provide customers with the best memories companion for them and their families.\n\nAs a full stack Software Development Engineer, you’ll architect the next generation of our computer vision and artificial intelligence infrastructure. In this role, you'll drive technical strategy and innovation across our platform, leading the development of foundational services that process billions of photos while enabling revolutionary AI features. You'll shape the technical direction of Amazon Photos' machine learning capabilities and influence how millions of customers interact with their memories.\n\nKey job responsibilities\n* Define and execute technical strategy for Amazon Photos' core AI and computer vision infrastructure, aligning with business goals and customer needs\n* Architect and lead development of large-scale distributed systems handling petabyte-scale photo processing and ML model serving\n* Drive technical decisions across multiple teams, establishing patterns and best practices for system-wide integration and operational excellence\n* Build and lead high-performing engineering teams, mentoring senior engineers and developing technical talent across the organization\n* Partner with ML scientists and research teams to productionize computer vision and AI technologies at scale\n* Design and implement foundational services and frameworks that enable rapid innovation and improve team velocity\n* Lead architecture reviews and technical deep dives, ensuring solutions meet requirements for scalability, reliability, and performance\n* Collaborate with senior leadership and product teams to define roadmaps and drive strategic technical initiatives\n* Establish and maintain operational standards, metrics, and practices for critical services running at global scale\n\nAbout the team\nWe operate at massive scale, processing billions of photos while maintaining high availability and low latency. Our team leverages technologies in distributed systems, computer vision, and machine learning to create innovative solutions that delight customers. We're building the future of how people interact with their memories, using AI to create more personalized and meaningful experiences.",
    "url": "https://www.amazon.jobs/en/jobs/2949311/software-development-engineer-amazon-photos"
  },
  {
    "title": "Software Development Manager",
    "company": "Amazon",
    "location": "IND, KA, Bengaluru",
    "description": "DESCRIPTION\n\nHow would you build the next generation of mission critical systems and services that power the ability to send, store and manage billions of products across the globe on behalf of our selling partners?\n\nFulfillment by Amazon (FBA) is the Amazon service for world-wide sellers that offers access to Amazon’s vast distribution network as a service. Similar to how AWS provides infrastructure as a service, FBA allows sellers to only pay for what they use, creating a seamless experience to leverage our world-class infrastructure. Sellers, from Fortune 50 companies to hundreds of thousands of small businesses and entrepreneurs, in 135 countries worldwide, rely upon our world-leading technology to grow and thrive on Amazon’s Marketplaces.\n\nAs a leader within FBA, you will provide both strategic and tactical oversight to build the features and functionality required to have the best in class offering for sellers. This leader will create mechanisms to drive optimal seller behavior for FBA inventory management, reducing total supply chain costs and making it easier for sellers to get their inventory close to customers, delivering more items with a Prime delivery promise. This leader will invent new ways to deliver value for sellers and their products, while leveraging the scale and innovation of technology from across the Amazon family, including AWS.\n\nWe operate as a startup within Amazon, providing our team great flexibility in product and technology direction. Come, join us and build the future!\n\nKey job responsibilities\nThis Software Development Manager role is pivotal to delivering an exceptional experience for FBA customers and sellers worldwide. This leader will manage a team that develops and maintains highly scalable, highly available web services and systems at the heart of FBA technology offerings. These services support the FBA business globally, through rapidly evolving and complex demands in a high-9’s availability environment.\n\nAbout the team\nFBA Inventory Management charter is to help Amazon's selling partners and enterprises to optimally plan and manage their inventory in Amazon's fulfillment and warehousing network to meet their on- and off-Amazon demand while minimizing risk of understock and overstock. We do this by providing sellers detailed visibility of their inventory in our network, performance metrics, planning & automation tools and recommendations to manage their inventory.",
    "url": "https://www.amazon.jobs/en/jobs/2999403/software-development-manager"
  },
  {
    "title": "Software Development Manager",
    "company": "Amazon",
    "location": "IND, KA, Bengaluru",
    "description": "DESCRIPTION\n\nWe are seeking a hands-on Software Development Manager to help build and lead an engineering team focused on AI-powered Seller Support transformation in Bangalore. Reporting to the Senior Software Development Manager, you will play a crucial role in establishing our technical foundation and growing our engineering organization from the ground up.\n\nYou will drive the technical implementation of our LLM-powered Associate Experience solutions while simultaneously building and mentoring high-performing engineering teams. This is a unique opportunity to shape both the technical architecture and the team culture as we establish our Bangalore technology hub.\n\nKey job responsibilities\n• Build and lead an engineering team (8-12 engineers) focused on developing our AI-powered support experience\n• Drive the technical design and implementation of LLM-based features within our case management system\n• Establish engineering best practices, coding standards, and development processes for the new organization\n• Lead the hiring and onboarding of software engineers, setting high standards for technical excellence\n• Partner with global teams to ensure seamless integration of locally developed solutions with existing systems\n• Own the technical implementation of automated case routing and response generation systems\n• Guide the development of APIs and services that will consolidate our fragmented toolset",
    "url": "https://www.amazon.jobs/en/jobs/3010698/software-development-manager"
  },
  {
    "title": "Software Dev Engineer",
    "company": "Amazon",
    "location": "IND, KA, Bangalore",
    "description": "DESCRIPTION\n\nAt Amazon, we hire the best minds in technology to innovate and build on behalf of our customers. The focus we have on our customers is why we are one of the world’s most beloved brands – customer obsession is part of our company DNA. Our Software Development Engineers (SDEs) use cutting-edge technology to solve complex problems and get to see the impact of their work first-hand. The challenges SDEs solve for at Amazon are big and influence millions of customers, sellers, and products around the world. We are looking for individuals who are passionate about creating new products, features, and services from scratch while managing ambiguity and the pace of a company where development cycles are measured in weeks, not years. If this sounds interesting to you, apply and come chart your own path at Amazon.\nApplications are reviewed on a rolling basis. For an update on your status, or to confirm your application was submitted successfully, please login to your candidate portal. NOTE: Amazon works with a high volume of applicants, so we appreciate your patience as we review applications\n\nKey job responsibilities\n• Collaborate with experienced cross-disciplinary Amazonians to conceive, design, and bring innovative products and services to market.\n• Design and build innovative technologies in a large distributed computing environment and help lead fundamental changes in the industry.\n• Create solutions to run predictions on distributed systems with exposure to innovative technologies at incredible scale and speed.\n• Build distributed storage, index, and query systems that are scalable, fault-tolerant, low cost, and easy to manage/use.\n• Design and code the right solutions starting with broadly defined problems.\n• Work in an agile environment to deliver high-quality software.\n\nInternal job description\nLoop competencies",
    "url": "https://www.amazon.jobs/en/jobs/3016657/software-dev-engineer"
  },
  {
    "title": "Software Development Manager",
    "company": "Amazon",
    "location": "IND, KA, Bengaluru",
    "description": "DESCRIPTION\n\nWe are a startup team working to enable organizations across the world with reliable, cost effective and flexible end-to-end supply chain solutions, to help them scale, succeed and offer best in class experience to their customers. Amazon has spent years building one of the world’s most efficient and optimized supply chains. Amazon warehousing and distribution (AWD) is building on that foundation and continuing to innovate end-to-end supply chain capabilities.\n\nWe are looking for Software Development Managers who are seeking opportunities to apply their past experience supporting Amazon’s supply chain offerings. We aim to create a highly technical and entrepreneurial culture and you will help us foster that.\n\nKey job responsibilities\nKey job responsibilities\nOwn the roadmap of the charter that enables sellers and enterprises to leverage AWD for their on and off Amazon supply chain use-cases\nDocument and present strategies to senior management.\nManagement and execution against project plans and delivery commitments.\nManagement of resources, hiring, mentoring, enhancing and maintaining a best-of-class product development team.\nWork closely with the engineers and product managers to architect and develop the best technical design and approach.\nReport on status of development, quality, operations and system performance to leadership.\n\nThe ideal candidate will be a leader, quick learner and be able to work independently. He/she should be able to operate in a fast paced environment where time to hit market is super critical. The candidate will need to balance technical leadership and savvy with strong business judgment to make the right decisions.",
    "url": "https://www.amazon.jobs/en/jobs/2974495/software-development-manager"
  },
  {
    "title": "Support Engineer III, SPFT",
    "company": "Amazon",
    "location": "IND, KA, Bangalore",
    "description": "DESCRIPTION\n\nAre you interested in building high-performance, globally scalable systems that support Amazon's current and future growth? Are you seeking an environment where you can drive innovation? Does the prospect of working with top engineering talent get you charged up? If so, Amazon Selling Partner Finance Technology (SPFT) is for you!\n\nSPFT is looking for a highly motivated Support Engineer III to help build Amazon's business-critical financial systems and build system solutions to operate at scale. You will work on critical finance business functions for our customers around the world while meeting system availability goals and ensuring system performance with growing business needs. You will discover innovative ways to automate and scale our infrastructure as we expand globally. You will work together with multiple teams and departments, with plenty of opportunities to learn and grow.\n\nThe ideal candidate has a passion for understanding computing systems and for applying that understanding with an obsession for delighting customers. In this role, you will apply your skills of system design, networking, coding/scripting languages, as well as technical communication and project organization to make your impact on improving our business processes. The candidate is expected to contribute work-critical initiatives, build products, lead engineers to troubleshoot, debug, evaluate, and resolve computer-identified alarms, make feature enhancements, manage systems, perform software deployments and migrations, manage hosts, and automate operational tasks.\nThey would also be responsible for developing tools and end-to-end automation to achieve human-free operations.\n\nAs an engineer in the team, you will take part in the architecture, design, implementation, and deployment of large-scale and complex software systems. You will get to leverage your experience and expertise to deliver innovative solutions to challenging problems. You will communicate your ideas effectively to achieve the right outcome for your team and customer. You enjoy collaborating with others to increase the effectiveness of the overall team. Your code, design, and implementation decisions should set a great example for other engineers. You will also have the opportunity to impact the technical decisions in the broader organization as well as mentor other engineers in the team.",
    "url": "https://www.amazon.jobs/en/jobs/2947153/support-engineer-iii-spft"
  },
  {
    "title": "Software Development Engineer II",
    "company": "Amazon",
    "location": "IND, KA, Bengaluru",
    "description": "DESCRIPTION\n\nAre you looking for an opportunity to create a new supply chain product? We are a startup team working working to enable organizations across the world with reliable, cost effective and flexible end-to-end supply chain solutions, to help them scale, succeed and offer best in class experience to their customers.\n\nAmazon has spent years building one of the world’s most efficient and optimized supply chains. Amazon Warehousing and Distribution (AWD) org will build on that foundation and continue to innovate to offer a multi-tenant, bulk storage and distribution service.\n\nAs a developer on the team you’ll drive improvements to our technology, collaborating with sharp engineers and highly-engaged users to ship code continuously. We have many domains ranging from highly-scalable transactional backend systems, to complex optimization problems, to customer facing applications/APIs, so if you love building world-class software of any type, most likely we have a place for you.\n\nWe’re looking for software development engineer who share our passion for continuously improving the customer experience, who are motivated by challenging problems in distributed systems, algorithms, and HCI and who love writing great code. If you have an entrepreneurial spirit, know how to deliver, are deeply technical, highly innovative and long for the opportunity to build pioneering solutions to challenging problems, we want to talk to you.\n\nKey job responsibilities\n• Participate in the full development life cycle, working within broadly defined parameters, including test plan execution and software quality needs.\n• Own the delivery of a piece of a system or application\n• System Design (front-end / back-end, performance, security, etc)\n• Execution against project plans and delivery commitments.\n• Build software solutions where the problem is defined to a point.\n• Create and execute appropriate project plans, test strategies and processes for development activities in concert with business and project management efforts.\n• Drive improvements in processes and operational excellence\n• Help to mentor junior team members\n\nA day in the life\nThe ideal candidate will be a leader, quick learner and be able to work independently. He/she should be able to operate in a very fast paced environment where time to hit market is super critical.\n• The candidate will need to balance technical leadership and savvy with strong business judgment to make the right decisions about technology choices.\n• 4+ years of agile software development methodology experience",
    "url": "https://www.amazon.jobs/en/jobs/2986755/software-development-engineer-ii"
  },
  {
    "title": "Software Development Engineer - II",
    "company": "Amazon",
    "location": "IND, TS, Hyderabad\nIND, KA, Bangalore",
    "description": "DESCRIPTION\n\nSelling Partner Identity Verification (SPIV) team ensures that Amazon is a safe and trustworthy place to shop and an amazing place to build a successful business selling products. We support this mission through providing a secure and accurate Identity verification platform. Identity verification is becoming a critical component to protect our customers from bad actors and provide fast and secure registration and account management capabilities. We provide an end to end solution for identity verification and account lifecycle management for various Amazon businesses across globe (North America, Europe, Japan, China and more). Our customers include Mechanical Turk, Selling on Amazon, Amazon Pay, Amazon Flex etc. We continuously strive to scale our systems to serve millions of Amazon customers with high accuracy, least friction, in a highly secure manner to enable a safe and secure shopping experience for customers.\n\nKey job responsibilities\nEngineers in the team need a strong understanding of Computer fundamentals and practical experience in working with large scale distributed systems. Experience with web services-based applications, especially at massive scale, is helpful.",
    "url": "https://www.amazon.jobs/en/jobs/3001324/software-development-engineer-ii"
  },
  {
    "title": "SDE II, COMS Tech",
    "company": "Amazon",
    "location": "IND, KA, Bengaluru",
    "description": "DESCRIPTION\n\nAt Amazon, we hire the best minds in technology to innovate and build on behalf of our customers. The focus we have on our customers is why we are one of the world’s most beloved brands – customer obsession is part of our company DNA. Our Software Development Engineers (SDEs) use technology to solve complex problems and get to see the impact of their work first-hand. The challenges SDEs solve for at Amazon are big and influence millions of customers, sellers, and products around the world. We are looking for individuals who are passionate about creating new products, features, and services from scratch while managing ambiguity and the pace of a company where development cycles are measured in weeks, not years. If this sounds interesting to you, apply and come chart your own path at Amazon.\nApplications are reviewed on a rolling basis. For an update on your status, or to confirm your application was submitted successfully, please login to your candidate portal. NOTE: Amazon works with a high volume of applicants, so we appreciate your patience as we review applications\n\nKey job responsibilities\nCollaborate with experienced cross-disciplinary Amazonians to conceive, design, and bring innovative products and services to market.\n• Design and build innovative technologies in a large distributed computing environment and help lead fundamental changes in the industry.\n• Create solutions to run predictions on distributed systems with exposure to innovative technologies at incredible scale and speed.\n• Build distributed storage, index, and query systems that are scalable, fault-tolerant, low cost, and easy to manage/use.\n• Design and code the right solutions starting with broadly defined problems.\n• Work in an agile environment to deliver high-quality software\n\nAbout the team\nTrustworthy Shopping Experience (TSE) org is part of SPS and strives to guarantee customers a trustworthy shopping and ordering experience so they can shop with confidence on Amazon. TSE Ops org caters to the operational needs of TSE. COMS Tech team is part of the TSE Ops. Within TSE Ops it focuses on the needs of the Regulatory Intelligence, Safety and Compliance (RISC) programs. COMS Team owns Medux, Human In The Loop (HITL) system that facilitates Operations teams with automated work allocation, skill management and dynamic work execution interfaces to facilitate manual action catering to multiple compliance requirements.",
    "url": "https://www.amazon.jobs/en/jobs/2932707/sde-ii-coms-tech"
  },
  {
    "title": "Software Development Engineer- SDE II",
    "company": "Amazon",
    "location": "IND, KA, Bengaluru",
    "description": "DESCRIPTION\n\nWant to be part of a dynamic start-up environment within Amazon and be at the forefront of enabling \"Amazon Pay\" outside of Amazon?\nOur team is looking for passionate, experienced software developers who can deliver high quality platform solutions that support variety of customer and merchant use cases for enabling \"Amazon Pay\" for third party merchants.\n\nAs an engineer in Amazon Pay, you will help third party merchants to enable customers to pay with \"Amazon Pay\" on their website or stores. You will responsible for building a best in class and frictionless payments solution and merchant experience which will help us exponentially scale while retaining our customers/merchants trust.\n\nDevelopers in the team need a strong understanding of Computer fundamentals and practical experience in building large scale distributed systems. Experience with web-based applications and/or web services-based applications is also helpful.\n\n\nExpertise in object-oriented design and coding skills (Java and/or C/C++ preferably on a UNIX or Linux platform)\nExperience developing distributed/scalable systems and high-volume transaction applications in a 24/7 environment.\nWeb services and web application/services development experience.\n2+ years of experience contributing to the architecture and design (architecture, design patterns, reliability and scaling) of new and current systems.\n\nThis is an excellent opportunity to join Amazon’s world-class technical teams, working with some of the best and brightest engineers while also developing your skills and furthering your career within one of the most dynamic, innovative and progressive technology companies anywhere. In addition to a stimulating working environment, Amazon offers mentoring programs, regular tech talks with principal engineers, and a variety of career paths to pursue.\n\nCome join us we work hard, have Fun and make History!\n\n\nAbout the team\nAmazonPay, one of the fastest growing businesses of Amazon, enables e-commerce websites to accept, and customers to utilise the payment information stored in their Amazon.com accounts to pay for goods and services at sites off-Amazon. AmazonPay also enables customers to manage their account preferences and see their off-Amazon transactions. Hundreds of thousands of Users make millions of transactions worldwide on AmazonPay. We develop software at every level of the stack from front-end user interfaces to backend server software and everything in between.",
    "url": "https://www.amazon.jobs/en/jobs/2877922/software-development-engineer-sde-ii"
  },
  {
    "title": "Software Dev Engineer II",
    "company": "Amazon",
    "location": "IND, KA, Bangalore",
    "description": "DESCRIPTION\n\nThe Amazon Prime Video team is looking for a smart, motivated, and results-oriented software development engineer to join the team. We are a high-energy and innovative group changing the way customers watch TV and movies.\n\nWe are looking for candidates who are passionate about delivering world-class digital media experiences to our customers. Successful candidates for this position will be self-starters with strong problem solving skills who love getting things done. Strong communication skills and a desire to tackle complex problems that emerge from driving a large business at Amazon are also a must.\n\nAs a norm, Amazon SDE’s have industry-leading technical abilities. They recognize and adopt best practices in software engineering: design, testing, version control, documentation, build, deployment, and operations. They write high quality, maintainable, and robust code, often in Java or C++. They solve problems at their root, stepping back to understand the broader context. They build flexible systems without over-engineering and choose simple, straightforward solutions over more complex ones. They understand a broad range of data structures and algorithms and know how, when and when not to use them; recognize and use design patterns to solve business problems. They understand how operating systems work, perform and scale.",
    "url": "https://www.amazon.jobs/en/jobs/3026197/software-dev-engineer-ii"
  },
  {
    "title": "Software Development Engineer II, Fulfillment by Amazon (FBA)",
    "company": "Amazon",
    "location": "IND, KA, Bengaluru",
    "description": "DESCRIPTION\n\nREADY TO DO SOMETHING BIG?\n\nHow would you build the next generation of mission critical systems and services that power the ability to send, store and manage billions of products across the globe on behalf of our selling partners?\n\nFulfillment by Amazon (FBA) is the Amazon service for world-wide sellers that offers access to Amazon’s vast distribution network as a service. Similar to how AWS provides infrastructure as a service, FBA allows sellers to only pay for what they use, creating a seamless experience to leverage our world-class infrastructure. Sellers, from Fortune 50 companies to hundreds of thousands of small businesses and entrepreneurs, in 135 countries worldwide, rely upon our world-leading technology to grow and thrive on Amazon’s Marketplaces.\n\nAs a leader within FBA, you will provide both strategic and tactical oversight to build the features and functionality required to have the best in class offering for sellers. This leader will create mechanisms to drive optimal seller behavior for FBA inventory management, reducing total supply chain costs and making it easier for sellers to get their inventory close to customers, delivering more items with a Prime delivery promise. This leader will invent new ways to deliver value for sellers and their products, while leveraging the scale and innovation of technology from across the Amazon family, including AWS.\n\nWe operate as a startup within Amazon, providing our team great flexibility in product and technology direction. Come, join us and build the future!\n\nKey job responsibilities\n• You will solve ambiguous business problems and map them to elegant technical solutions\n• You will use object-oriented concepts, algorithms and data structures to build systems at Amazon scale\n• You will design, launch, and re-architect multi-tier systems with large amounts of data\n• You will quickly adapt to fast-paced development environment with bias towards simple and extensible code",
    "url": "https://www.amazon.jobs/en/jobs/2948570/software-development-engineer-ii-fulfillment-by-amazon-fba"
  },
  {
    "title": "Software Development Manager, Amazon",
    "company": "Amazon",
    "location": "IND, KA, Bangalore",
    "description": "DESCRIPTION\n\nAs a global leader in e-commerce risk management, we are revolutionizing how digital commerce remains secure and trusted worldwide. Our innovative approach combines technology with commitment to customer safety, setting new industry standards in fraud prevention.\n\nThe Core Services team stands at the forefront of this mission, leveraging advanced machine learning and real-time analytics to protect millions of transactions daily. Our sophisticated platform processes billions of evaluations annually, employing innovative statistical modeling and cloud computing technologies to stay ahead of emerging security challenges.\n\nWorking here means joining an elite team of engineers and scientists who are redefining what's possible in risk prevention. You will collaborate with world-class machine learning experts to develop and deploy innovative solutions that operate at unprecedented scale.\n\nWe are seeking exceptional talent who share our passion for innovation and customer trust. This role offers the unique opportunity to tackle complex challenges at global scale while working with advanced technologies that protect millions of customers worldwide. Your work will directly impact the future of digital commerce, as you help build and enhance systems that set industry benchmarks for trust and safety.\n\nAs the Software Development Manager, you will have technical ownership of mission critical systems that drive the program. You'll lead a talented and nimble team of managers and engineers and will define the vision for the program. You will build the team to deliver the vision.\n\nResponsibilities include direct management of a team of 8-10 engineers, process and quality of service improvements, strategic planning, project management for software within the team, and management of resources across teams. Successful candidates will be strong leaders who can prioritize well, communicate clearly, and have a consistent track record of delivery.",
    "url": "https://www.amazon.jobs/en/jobs/3019033/software-development-manager-amazon"
  },
  {
    "title": "Software Development Manager",
    "company": "Amazon",
    "location": "IND, KA, Bangalore",
    "description": "DESCRIPTION\n\nAmazon Selling Partner Services team drives the Selling On Amazon business and develops solutions that enable millions of sellers around the world to sell on Amazon's Marketplaces. More than half of shipments for Amazon customers are generated from this business. The team is focused on building a technology platform that will support the explosive business growth in existing markets, streamline the business for Amazon and the Selling partners and launch business in new markets and establish a fair marketplace.\n\nOur team is seeking a Software Development Manager with broad technical and people management skills to help us build and manage a team which synthesize massive amounts of data and complex business rules into mission critical financial information. Along the way you'll gain and leverage a unique understanding of how Amazon.com works; from the numerous software systems that comprise the website's back-end, to the details of our business model, and the relationships we're establishing with an ever-growing network of selling partners who depend on Amazon.com to run their businesses.\n\nThe ideal candidate will draw upon exemplary analytical, critical thinking, team management and problem solving skills, and a passion for managing a high performance team. Successful members of this team collaborate effectively with internal end-users, cross-functional software development teams, and technical support/sustaining engineering teams to solve problems and deliver successfully against high operational standards of system availability and reliability. We look for managers who are excellent communicators, self-motivated, flexible, hardworking, and who like to have fun!",
    "url": "https://www.amazon.jobs/en/jobs/2973403/software-development-manager"
  },
  {
    "title": "Software Development Engineer, Amazon",
    "company": "Amazon",
    "location": "IND, TS, Hyderabad",
    "description": "DESCRIPTION\n\nAre you an innovative and accomplished professional seeking for a role with a significant impact and growth? Amazon is looking for a dynamic Software Development Engineer to join our Core Services team under Worldwide Customer purchase Journey.\n\nThe Shipping and Region Authority (SARA) organization innovates on foundational products that shape the customer shopping journey, beginning from the gateway page of their visit through search and discovery experiences. SARA’s products also help drive checkout and fulfillment customer experiences. Through a complex orchestration of its four domains (Shipping, Regions, Locations, Restrictions), SARA influences and frames the shopping CX. Our systems are architected for scale and consistency, offering configurable, flexible, and global solutions (standardized globally but customized for local regulations). We integrate with multiple cross technology and functional services to identify customer locations , identify the shipping options and apply sales and shipping restrictions.\n\nIn this role, you will scope complex projects and deliver simple, elegant solutions by collecting product and business requirements, driving the development schedule from design to release, making appropriate trade-offs to optimize time-to-market, and clearly communicating goals, roles, responsibilities, and desired outcomes to internal cross-functional teams. You will interact with a broad cross-section of the Amazon organization, clarify ambiguous issues, and negotiate effective technical solutions between development and business teams. You will anticipate bottlenecks and escalate issues when required to ensure on-time delivery. This role requires a seasoned individual with excellent experience as a Software Development Engineer for distributed SOA software systems and the ability to guide high-level technical design while considering potential future areas of fraud our platform might encounter.\n\nKey job responsibilities\n• Collaborate with experienced cross-disciplinary Amazonian to conceive, design, and bring innovative products and services to market.\n• Design and build innovative technologies in a large distributed computing environment and help lead fundamental changes in the industry.\n• Create solutions to run predictions on distributed systems with exposure to innovative technologies at incredible scale and speed.\n• Build distributed storage, index, and query systems that are scalable, fault-tolerant, low cost, and easy to manage/use.\n• Design and code the right solutions starting with broadly defined problems.\n• Work in an agile environment to deliver high-quality software.\n\n\nKey job responsibilities\n• Collaborate with experienced cross-disciplinary Amazonian to conceive, design, and bring innovative products and services to market.\n• Design and build innovative technologies in a large distributed computing environment and help lead fundamental changes in the industry.\n• Create solutions to run predictions on distributed systems with exposure to innovative technologies at incredible scale and speed.\n• Build distributed storage, index, and query systems that are scalable, fault-tolerant, low cost, and easy to manage/use.\n• Design and code the right solutions starting with broadly defined problems.\n• Work in an agile environment to deliver high-quality software.",
    "url": "https://www.amazon.jobs/en/jobs/3021041/software-development-engineer-amazon"
  },
  {
    "title": "Software Development Manager, Brutus Tech",
    "company": "Amazon",
    "location": "IND, TS, Hyderabad",
    "description": "DESCRIPTION\n\nAre you looking for the opportunity to have a major impact on cutting edge technology used by millions of people every day?\n\nThe Amazon Business Buying Journeys teams helps business buyers creating frictionless purchase experiences on AB Website so they can fullfill their purchase missions efficiently while also contributing to meet their companies specific procurement goals. We also largely contribute to the wider Amazon Business mission to become the supplier of choice for organizations of all sizes across the world by simplifying and enabling responsible procurement\n\nWe are looking for a Software Development Manager with a strong sense of ownership and a passion for delivering innovative solutions for complex problems with high scale. As part of leading a team of engineers, you will have the opportunity to create significant impact on our systems, our business and most importantly, our customers as we take on challenges that can reshape the b2b marketplace.\n\nWe are seeking someone who has strong technical, project and people skills with a can-do-drive attitude and a focus on delivering high quality software with their team.\n\nGreat candidates for this position possess a sound understanding of computer science, passion to help outstanding engineers grow and determination to make a profound impact for our business customers. You will have the opportunity to apply this passion by leveraging your software development management skills leading medium to large projects involving distributed systems, web development and front-end/back-end design. You will also have the opportunity to collaborate with diverse business and technical partners to shape our technology. You will be the voice of our customers, driving technological innovation to create an unparalleled business procurement integration experience.\n\nKey job responsibilities\n* Have a track-record of delivering with a software development team and growing their team members.\n* Must be technically strong, able to both act as a technical representative for their team to leadership and hold the bar with the team on the right architecture.\n* Must be passionate about diving deep into problems and deliver iteratively using Agile best practices\n* Experienced working with multiple teams and leading engineers on building solutions\n* Consistent focus on operational excellence and security of systems.\n\nAbout the team\nThe External Systems Integration (ESI) team at Amazon Business plays a vital role in enabling seamless integration between third-party procurement applications and Amazon Business (AB). Our dedicated teams develop cutting-edge products, features, and APIs, facilitating smooth procurement processes for our diverse clientele. From Integration Search, Punchout, Quoting, Catalog to end-2-end shopping experience and beyond, we empower businesses to tailor AB to their exact needs, ensuring efficiency and flexibility in their procurement journey. Join us in revolutionizing procurement integration at Amazon Business.",
    "url": "https://www.amazon.jobs/en/jobs/2962890/software-development-manager-brutus-tech"
  },
  {
    "title": "Software Development Manager",
    "company": "Amazon",
    "location": "IND, KA, Bangalore",
    "description": "DESCRIPTION\n\nWW Customer Trust & Partner Support (CTPS) ensures that Amazon is a safe and trustworthy place to shop and an amazing place to build a successful business selling products. Our mission is to build trust with our Customers and Selling Partners as we scale through technology, analytics, and science. We’re committed to service as a center of excellence for Amazon.\nAs part of CTPS, Seller Registration owns variety of products which enables us to collect data from WW Sellers in order to let them sell on Amazon marketplace. Our mission is to: (a) make it simple and fast for Sellers to register globally, (b) verify the identity of every person and business selling on Amazon through the Seller lifecycle, and (c) use automation to achieve accuracy, speed, and scale. When we are successful, we enable Marketplace growth and build trust with our Customers. Registration Systems receive ~1.5M hits per week and strive towards providing a seamless experience that cannot be exploited by bad actors. As of today, sellers who intend to go global on Amazon need to register in each region and thus, go through the tedious registration process multiple times, which leads to friction for potential global sellers.\nWe are looking for a Software Development Manager with a strong sense of ownership and a passion for delivering creative solutions for complex problems on an unprecedented scale. As part of leading a team of engineers, you will have the opportunity to create significant impact on our systems, our business and most importantly, our customers as we take on challenges that can reshape the e-commerce industry.\nWe are seeking someone who has strong technical, project and people skills with a can-do attitude and a focus on delivering high quality software. We move at a fast pace and deliver software iteratively using AGILE best practices and the latest technologies.\nThe Ideal Candidate:\n\n\nMust be technically credible to lead teams of world-class software engineers and technical program managers. Must be able to make the right design decisions related to product features and technology choices.\n\nDeep understanding of overall systems development life cycle including various methodologies (agile, waterfall, iterative)\n\nExperienced in developing the long-term strategy for the settlement platforms and translate that into an achievable roadmap\n\nExperienced in building and managing teams that design and deliver scalable and extensible distributed systems to address complex business challenges.\n\nUnderstands how to scope and justify resources and budget needs to senior leaders and finance partners\n\nConsistent focus on operational excellence and security of systems.\n\nExperience with open source technologies, object-oriented design, and agile development methodologies",
    "url": "https://www.amazon.jobs/en/jobs/3010453/software-development-manager"
  },
  {
    "title": "Support Engineer III",
    "company": "Amazon",
    "location": "IND, KA, Bangalore",
    "description": "DESCRIPTION\n\nTransportation Financial Systems (TFS) owns the technology components that perform the financial activities for transportation business. These systems are used across all transportation programs and retail expansion to new geographies. TFS systems provide financial document creation & management, expense auditing, accounting, payments and cost allocation functions. Our new generation products are highly scalable and operate at finer level granularity to reconcile every dollar in transportation financial accounts with zero manual entries or corrections. The goal is to develop global product suite for all freight modes touching every single package movement across Amazon. Our mission is to abstract logistics complexities from financial world and financial complexities from logistics world. There are ample opportunities in the team to build domain expertise in financial system as well as transportation.\n\nPrimary responsibilities include troubleshooting, diagnosing and fixing production software issues, developing monitoring solutions, performing software maintenance and configuration, implementing the fix for internally developed code (Perl, Ruby, Java), performing SQL queries, updating, tracking and resolving technical challenges. Responsibilities also include working alongside development on Amazon Corporate and Divisional Software projects, updating/enhancing our current software, automation of support processes and documentation of our systems.\n\nThe ideal candidate must be detail oriented, have superior verbal and written communication skills, strong organizational skills, able to juggle multiple tasks at once, able to work independently and can maintain professionalism under pressure. You must be able to identify problems before they happen and implement solutions that detect and prevent outages. You must be able to accurately prioritize projects, make sound judgments, work to improve the customer experience, and get the right things done.",
    "url": "https://www.amazon.jobs/en/jobs/3026191/support-engineer-iii"
  },
  {
    "title": "Software Development Engineer",
    "company": "Amazon",
    "location": "IND, KA, Bangalore",
    "description": "DESCRIPTION\n\nWe are the guardians of the Amazon galaxy. The Account Compliance team strives to ensure that Amazon remains compliant and the cost of being compliant is never the reason where the business or our sellers cannot scale. Our diverse team innovates on behalf of their customers to build a trusted marketplace through best-in-class compliance products. With hundreds of millions of customers around the world depending on our products & services, our systems form the tip of the spear against bad actors. These actors might abuse Amazon products and undermine customer faith, so our success comes from identifying & removing them while delivering best-in-class customer experiences for the good actors and strategic customers. We’re creating the most trusted store on earth, enabling Amazon to innovate at scale, and supporting our customers to launch & grow their business faster than anywhere else in the world.\nAs a Software Development Engineer in the account compliance team, you will design and build software that 1) is extensible to different use cases, products, and geographies with almost zero incremental tech effort, 2) can trigger verifications that are necessary under applicable policies, 3) can store verification decisions for re-use to reduce duplicative checks; and (5) is vendible to any authorized user via API. The software is smarter than the smartest bad actors in the world to protect the store from illegal activities at scale. Amazon's scale means that you'll be designing and developing custom distributed systems more advanced than those used in standard industry practices. These data-centric systems need to detect patterns across Amazon's huge customer population as they happen and be adaptive so that they can detect new modus operandi as they develop. Lastly, they need to be highly available, low latency, high quality systems. If this sounds interesting to you, then apply and find out more!",
    "url": "https://www.amazon.jobs/en/jobs/3001953/software-development-engineer"
  },
  {
    "title": "Software Development Manager",
    "company": "Amazon",
    "location": "IND, KA, Bangalore",
    "description": "DESCRIPTION\n\nWe are the guardians of the Amazon galaxy. Our diverse team innovates on behalf of their customers to build a trusted marketplace through best-in-class registration, verification, and compliance products. With hundreds of millions of customers and sellers around the world depending on our products & services, our systems form the tip of the spear against bad actors. These actors might abuse Amazon products and undermine customer faith, so our success comes from identifying & removing them while delivering best-in-class compliance programs and customer experiences. We’re creating the most trusted store on earth, enabling Amazon to innovate at scale, and supporting selling partners to launch & grow their business faster than anywhere else in the world. With over $475B in annual gross merchandise sold, 3.8B available products, and 2M sellers, our platform requires uniquely massive thinking.\n\nAs a Software Development Manager on the Account Compliance team, you will be responsible for building and managing high-performing engineering teams that develop innovative solutions to enhance our selling partners' experience and ensure policy compliance through technology. You work closely with product management and other business partners to define strategy and requirements, and lead development teams from concept through delivery and subsequent operation. You have regular communication with senior management on status, risks and product strategy. You have excellent listening, writing skills and very strong technical competency. You're a thought leader, but you don't just know how to solve the problem, you prove it by leading team to build the solution. Last but not the least; you have a high bar for code quality and passion for design and architecture. Your software never rests: it continuously monitors sellers & automates activity investigations with high availability, low latency, and impeccable quality. Your leadership will directly influence how millions of selling partners interact with Amazon's marketplace, ensuring trust and compliance while enabling business growth. You'll also play a vital role in developing the next generation of technical leaders at Amazon.\n\nKey job responsibilities\n• Build and lead teams of software engineers, fostering a culture of technical excellence and innovation\n• Drive architectural decisions and technical strategy for large-scale distributed systems\n• Oversee the development of scalable, maintainable solutions for policy adherence and remediation platforms\n• Partner with Product, Program Management, and other cross-functional teams to deliver customer-focused solutions\n• Lead strategic planning, resource allocation, and roadmap development\n• Drive stakeholder management and communication across multiple organizational levels\n• Mentor, coach, and develop engineering talent through structured career development plans\n• Create opportunities for team growth through technical challenges and leadership opportunities\n• Drive operational excellence through metrics, monitoring, and continuous improvement\n• Balance technical debt with feature delivery to maintain sustainable development velocity",
    "url": "https://www.amazon.jobs/en/jobs/3002743/software-development-manager"
  },
  {
    "title": "Software Development Engineer, Account Compliance",
    "company": "Amazon",
    "location": "IND, KA, Bangalore",
    "description": "DESCRIPTION\n\nWe are the guardians of the Amazon galaxy. The Account Compliance team strives to ensure that Amazon remains compliant and the cost of being compliant is never the reason where the business or our sellers cannot scale. Our diverse team innovates on behalf of their customers to build a trusted marketplace through best-in-class compliance products. With hundreds of millions of customers around the world depending on our products & services, our systems form the tip of the spear against bad actors. These actors might abuse Amazon products and undermine customer faith, so our success comes from identifying & removing them while delivering best-in-class customer experiences for the good actors and strategic customers. We’re creating the most trusted store on earth, enabling Amazon to innovate at scale, and supporting our customers to launch & grow their business faster than anywhere else in the world.\nAs a Software Development Engineer in the account compliance team, you will design and build software that 1) is extensible to different use cases, products, and geographies with almost zero incremental tech effort, 2) can trigger verifications that are necessary under applicable policies, 3) can store verification decisions for re-use to reduce duplicative checks; and (5) is vendible to any authorized user via API. The software is smarter than the smartest bad actors in the world to protect the store from illegal activities at scale. Amazon's scale means that you'll be designing and developing custom distributed systems more advanced than those used in standard industry practices. These data-centric systems need to detect patterns across Amazon's huge customer population as they happen and be adaptive so that they can detect new modus operandi as they develop. Lastly, they need to be highly available, low latency, high quality systems. If this sounds interesting to you, then apply and find out more!",
    "url": "https://www.amazon.jobs/en/jobs/3001960/software-development-engineer-account-compliance"
  },
  {
    "title": "Software Development Manager, WW Returns and ReCommerce",
    "company": "Amazon",
    "location": "IND, TS, Hyderabad",
    "description": "DESCRIPTION\n\nNot many teams aspire to zero. Welcome to the Worldwide Returns and ReCommerce team (WWR&R) at Amazon.com.\n\nWW R&R is an agile, innovative organization dedicated to ‘making zero happen’ to benefit our customers, our company, and the environment. The mission of WWR&R is to eliminate defects that cause returns (Zero defects), deliver Zero cost of returns for Amazon and send Zero product waste to landfill “the 3 Zeros”. We do this by developing products and driving unparalleled operational excellence to help customers keep what they buy, recover returned & damaged product value, and create the best customer returns experience in the world.\nAmazon WW R&R is comprised of business, product, operational, program, software engineering and data teams that manage the life of a returned or damaged product from a customer to the warehouse and on to its next best use. Our work is broad and deep: we train machine learning models to automate routing and find signals to optimize re-use; we invent new channels to give products a second life; we develop world-class product support to help customers love what they buy; we pilot smarter product evaluations; we work from the customer backward to find ways to make the return experience remarkably delightful and easy; and we do it all while scrutinizing our business with laser focus.\nAs a leader on the team, you will be expected to operate at all levels, diving deep into the details while providing strategic inputs for the product. You will be a key player in driving strategic planning, project execution, hiring and development of engineering talent, driving operational excellence, and shaping up the solutions to achieve our vision. This is your opportunity to make a big impact and make history in the world of global logistics!\nWe are a group that has fun at work while driving incredible customer, business, and environmental impact. We are backed by a strong leadership group dedicated to operational excellence that empowers a reasonable work-life balance. As an established, experienced team, we offer the scope and support needed for substantial career growth.\n\nAmazon is earth’s most customer-centric company and through WW R&R, the earth is our customer too. Come join us and innovate with the Amazon Worldwide Returns & ReCommerce team!",
    "url": "https://www.amazon.jobs/en/jobs/2873984/software-development-manager-ww-returns-and-recommerce"
  },
  {
    "title": "Software Development Engineer",
    "company": "Amazon",
    "location": "IND, TS, Hyderabad",
    "description": "DESCRIPTION\n\nSoftware Engineer - Amazon International Seller Services\n\nAmazon International Seller Services mission is to set our worldwide sellers up for success across our global marketplaces. We deliver needle-moving initiatives which provide a seamless experience to Amazon sellers at each step of the seller journey.\n\nIs your next project defining a world class Internet service?\nWith us, you will be building cutting-edge applications and services in an environment of highly distributed systems used by millions of sellers and even more millions of retail customers. Your innovation could provide new functionality for sellers, expand mobile device usage for retail customers, deploy new web standards, or expand Amazon's web services with the goal of making it as easy for anyone to sell on Amazon as it is to buy from Amazon.\n\n\nCan you work at the scale of the biggest Internet companies?\nThe solutions that you will deploy must scale to accommodate rapid processing and integration with large enterprise customers. However, to add to the challenge, the solutions must also support intuitive world class UI for your neighbor to sell extra books, video games, photography equipment, and the largest selection of possible products that can be found anywhere.\n\n\nJoin our development team to work hard, have fun and make history. You will join a highly technical and entrepreneurial culture defining and building a selling experience to complement Amazon's world-class websites.",
    "url": "https://www.amazon.jobs/en/jobs/2905822/software-development-engineer"
  },
  {
    "title": "Software Development Engineer",
    "company": "Amazon",
    "location": "IND, TS, Hyderabad",
    "description": "DESCRIPTION\n\nSoftware Engineer - Amazon International Seller Services\n\nAmazon International Seller Services mission is to set our worldwide sellers up for success across our global marketplaces. We deliver needle-moving initiatives which provide a seamless experience to Amazon sellers at each step of the seller journey.\n\nIs your next project defining a world class Internet service?\nWith us, you will be building applications and services in an environment of highly distributed systems used by millions of sellers and even more millions of retail customers. Your innovation could provide new functionality for sellers, expand mobile device usage for retail customers, deploy new web standards, or expand Amazon's web services with the goal of making it as easy for anyone to sell on Amazon as it is to buy from Amazon.\n\nCan you work at the scale of the biggest Internet companies?\nThe solutions that you will deploy must scale to accommodate rapid processing and integration with large enterprise customers. However, to add to the challenge, the solutions must also support intuitive world class UI for your neighbor to sell extra books, video games, photography equipment, and the largest selection of possible products that can be found anywhere.\n\nJoin our development team to work hard, have fun and make history. You will join a highly technical and entrepreneurial culture defining and building a selling experience to complement Amazon's world-class websites.",
    "url": "https://www.amazon.jobs/en/jobs/2992023/software-development-engineer"
  },
  {
    "title": "Sofware Development Engineer II, FireTV",
    "company": "Amazon",
    "location": "IND, KA, Bangalore",
    "description": "DESCRIPTION\n\nThe Amazon Fire TV team designs and engineers the best-selling and groundbreaking devices for Fire TV product Line.\n\nYou will be part of a fast-paced, agile and innovative team who is bringing new multi-modal, integrated voice with GUI, experiences to FireTV in a startup like environment\n\nKey job responsibilities\nWe are looking for passionate, hard-working, and talented software engineers who have experience building innovative, mission critical, high volume applications that customers love. This is a high visibility team where you will get a chance to make a positive impact on customer experience.\n\nAmazon FireTV products are revolutionary consumer devices that have become the #1 best-selling Amazon products. They are among the most innovative and fastest growing businesses at both Amazon and the entire consumer electronics industry. We are looking for talented software engineers to join our team in building application software. This is an enormous opportunity to lead the design, architecture, and implementation of products used every day by people you know.\n\nAbout the team\nAmazon FireTV products are revolutionary consumer devices that have become the #1 best-selling Amazon products. They are among the most innovative and fastest growing businesses at both Amazon and the entire consumer electronics industry. We are looking for talented software engineers to join our team in building application software. This is an enormous opportunity to lead the design, architecture, and implementation of products used every day by people you know.",
    "url": "https://www.amazon.jobs/en/jobs/3025490/sofware-development-engineer-ii-firetv"
  },
  {
    "title": "Support Engineer",
    "company": "Amazon",
    "location": "IND, TS, Hyderabad",
    "description": "DESCRIPTION\n\nAt Amazon Business, we set out every day to innovate and disrupt the status quo. We stand at the intersection of tech and retail in the B2B space developing innovative purchasing and procurement solutions to help businesses and organizations re imagine buying. Bring your insight, imagination and a healthy disregard for the impossible. Join us in building and celebrating the value of Amazon Business to buyers and sellers of all sizes, unlocking our potential worldwide.\n\nAmazon Business launched in 2015 with a vision to give businesses a simple, personalized and transparent online B2B experience. An extension of this vision was to simplify the integration for businesses connecting their e-procurement systems to Amazon Business, while giving them access to a broader selection of products and sellers.\n\nAmazon Business is looking for a full-time team member to join our Integration Support Operations team. We count on Integration Support Engineers to provide technical support to our managed partners and enterprise-scale customers who use the Amazon Business Integration technologies. You are excited by the prospect of being the first in a new support organization. You combine passion for customer service with a product mindset to ensure that key insights are communicated to our product teams. We are looking for people who have the expertise of managing technical integrations, fostering developer/business relationships, and who have a desire to improve the support experience of our customers.\n\nAmazon Business is looking for an Integration Support Engineer to partner with customers, partners and Amazon business teams in EU and APAC to identify new offerings and continuously improve the B2B integration process, current offerings and data quality. Additional tasks include maintenance of the Amazon B2B specifications, mapping and supplier configurations. To be successful, this candidate requires mastery of a variety of proven analytical, communication and leadership skills. Our Integration Support Engineers are experienced technologists with technical breadth and depth coupled with strong interpersonal and customer facing skills. Amazon Business Integration Support Engineers have technical expertise in Enterprise Resource Planning (ERP), eProcurement integrations, Single Sign-On systems, and REST API based integrations.\n\n\nKey job responsibilities\n- Assist our customers in managing complex enterprise systems, and high-quality tools that enable their business.\n- Manage high severity incidents independently till resolution.\n- Understands platform architecture (at a high-level), API documentation, and troubleshooting techniques.\n- Become an expert on Amazon Business Integration Technologies and APIs and how to best deploy them and troubleshoot them.\n- Work closely with product managers, product designers, and engineering to lead or contribute to large-scale projects\n- Business case development to support new and improved processes for customers that leverage our integrations and APIs.\n- Influence and advocate for our Business Partners on how best to use our APIs.\n- Act as a trusted advisor to partners in developing and prioritizing comprehensive, data-driven tool improvement requests and raise core problems to our Engineering and cross functional partners.\n- Act as a portal for technical communication between outside developers and our product teams.\n- Independently frames issues and translates them into actionable insights, with minimal guidance or input from manager.\n- Proactively and independently leads the strategic direction of area of ownership or project. Effectively completes several concurrent complex activities and executes on projects with minimal direction.\n- Makes decisions while understanding the trade-off between risk and speed/impact.\n- Proposes new ideas based on thoughtful understanding of the business. Ideas/plans are backed by data, methodical analysis, and clear operational plan\n- Effective and proactive communicator across markets and cross-functional central and regional teams.\n- Articulates data-driven insights in a clear way that drives thoughtful business actions.\n- Fosters strong relationships in cross-functional and global teams and able to persuade outcomes",
    "url": "https://www.amazon.jobs/en/jobs/2962227/support-engineer"
  },
  {
    "title": "Support Engineer, International Integrations",
    "company": "Amazon",
    "location": "IND, TS, Hyderabad",
    "description": "DESCRIPTION\n\nCome be a part of a rapidly expanding $25 billion dollar global business. At Amazon Business, we set out every day to innovate and disrupt the status quo. We stand at the intersection of tech and retail in the B2B space developing innovative purchasing and procurement solutions to help businesses and organizations reimagine buying. Bring your insight, imagination and a healthy disregard for the impossible. Join us in building and celebrating the value of Amazon Business to buyers and sellers of all sizes, unlocking our potential worldwide.\n\nAmazon Business launched in 2015 with a vision to give businesses a simple, personalized and transparent online B2B experience. An extension of this vision was to simplify the integration for businesses connecting their e-procurement systems to Amazon Business, while giving them access to a broader selection of products and sellers.\n\nAmazon Business is looking for a full-time team member to join our Integration Support Operations team. We count on Integration Support Engineers to provide technical support to our managed partners and enterprise-scale customers who use the Amazon Business Integration technologies. You are excited by the prospect of being the first in a new support organization. You combine passion for customer service with a product mindset to ensure that key insights are communicated to our product teams. We are looking for people who have the expertise of managing technical integrations, fostering developer/business relationships, and who have a desire to improve the support experience of our customers.\n\nAmazon Business is looking for an Integration Support Engineer to partner with customers, partners and Amazon business teams in EU and APAC to identify new offerings and continuously improve the B2B integration process, current offerings and data quality. Additional tasks include maintenance of the Amazon B2B specifications, mapping and supplier configurations. To be successful, this candidate requires mastery of a variety of proven analytical, communication and leadership skills. Our Integration Support Engineers are experienced technologists with technical breadth and depth coupled with strong interpersonal and customer facing skills. Amazon Business Integration Support Engineers have technical expertise in Enterprise Resource Planning (ERP), eProcurement integrations, Single Sign-On systems, and REST API based integrations.\n\n\nKey job responsibilities\n- Assist our customers in managing complex enterprise systems, and high-quality tools that enable their business.\n- Manage high severity incidents independently till resolution.\n- Understands platform architecture (at a high-level), API documentation, and troubleshooting techniques.\n- Become an expert on Amazon Business Integration Technologies and APIs and how to best deploy them and troubleshoot them.\n- Work closely with product managers, product designers, and engineering to lead or contribute to large-scale projects\n- Business case development to support new and improved processes for customers that leverage our integrations and APIs.\n- Influence and advocate for our Business Partners on how best to use our APIs.\n- Act as a trusted advisor to partners in developing and prioritizing comprehensive, data-driven tool improvement requests and raise core problems to our Engineering and cross functional partners.\n- Act as a portal for technical communication between outside developers and our product teams.\n- Independently frames issues and translates them into actionable insights, with minimal guidance or input from manager.\n- Proactively and independently leads the strategic direction of area of ownership or project. Effectively completes several concurrent complex activities and executes on projects with minimal direction.\n- Makes decisions while understanding the trade-off between risk and speed/impact.\n- Proposes new ideas based on thoughtful understanding of the business. Ideas/plans are backed by data, methodical analysis, and clear operational plan\n- Effective and proactive communicator across markets and cross-functional central and regional teams.\n- Articulates data-driven insights in a clear way that drives thoughtful business actions.\n- Fosters strong relationships in cross-functional and global teams and able to persuade outcomes",
    "url": "https://www.amazon.jobs/en/jobs/2962896/support-engineer-international-integrations"
  },
  {
    "title": "Integration Support Engineer, International Integrations",
    "company": "Amazon",
    "location": "IND, TS, Hyderabad",
    "description": "DESCRIPTION\n\nCome be a part of a rapidly expanding $25 billion dollar global business. At Amazon Business, we set out every day to innovate and disrupt the status quo. We stand at the intersection of tech and retail in the B2B space developing innovative purchasing and procurement solutions to help businesses and organizations reimagine buying. Bring your insight, imagination and a healthy disregard for the impossible. Join us in building and celebrating the value of Amazon Business to buyers and sellers of all sizes, unlocking our potential worldwide.\n\nAmazon Business launched in 2015 with a vision to give businesses a simple, personalized and transparent online B2B experience. An extension of this vision was to simplify the integration for businesses connecting their e-procurement systems to Amazon Business, while giving them access to a broader selection of products and sellers.\n\nAmazon Business is looking for a full-time team member to join our Integration Support Operations team. We count on Integration Support Engineers to provide technical support to our managed partners and enterprise-scale customers who use the Amazon Business Integration technologies. You are excited by the prospect of being the first in a new support organization. You combine passion for outstanding customer service with a product mindset to ensure that key insights are communicated to our product teams. We are looking for people who have the expertise of managing technical integrations, fostering developer/business relationships, and who have a desire to improve the support experience of our customers.\n\nAmazon Business is looking for an Integration Support Engineer to partner with customers, partners and Amazon business teams in EU and APAC to identify new offerings and continuously improve the B2B integration process, current offerings and data quality. Additional tasks include maintenance of the Amazon B2B specifications, mapping and supplier configurations. To be successful, this candidate requires mastery of a variety of proven analytical, communication and leadership skills. Our Integration Support Engineers are experienced technologists with technical breadth and depth coupled with strong interpersonal and customer facing skills. Amazon Business Integration Support Engineers have technical expertise in Enterprise Resource Planning (ERP), eProcurement integrations, Single Sign-On systems, and REST API based integrations.\n\n\nKey job responsibilities\n- Assist our customers in managing complex enterprise systems, and high-quality tools that enable their business.\n- Manage high severity incidents independently till resolution.\n- Understands platform architecture (at a high-level), API documentation, and troubleshooting techniques.\n- Become an expert on Amazon Business Integration Technologies and APIs and how to best deploy them and troubleshoot them.\n- Work closely with product managers, product designers, and engineering to lead or contribute to large-scale projects\n- Business case development to support new and improved processes for customers that leverage our integrations and APIs.\n- Influence and advocate for our Business Partners on how best to use our APIs.\n- Act as a trusted advisor to partners in developing and prioritizing comprehensive, data-driven tool improvement requests and raise core problems to our Engineering and cross functional partners.\n- Act as a portal for technical communication between outside developers and our product teams.\n- Independently frames issues and translates them into actionable insights, with minimal guidance or input from manager.\n- Proactively and independently leads the strategic direction of area of ownership or project. Effectively completes several concurrent complex activities and executes on projects with minimal direction.\n- Makes decisions while understanding the trade-off between risk and speed/impact.\n- Proposes new ideas based on thoughtful understanding of the business. Ideas/plans are backed by data, methodical analysis, and clear operational plan\n- Effective and proactive communicator across markets and cross-functional central and regional teams.\n- Articulates data-driven insights in a clear way that drives thoughtful business actions.\n- Fosters strong relationships in cross-functional and global teams and able to persuade outcomes",
    "url": "https://www.amazon.jobs/en/jobs/2937476/integration-support-engineer-international-integrations"
  },
  {
    "title": "Software Development Engineer II",
    "company": "Amazon",
    "location": "IND, KA, Bengaluru",
    "description": "DESCRIPTION\n\nAre you looking for an opportunity to create a new supply chain product? We are a startup team working working to enable organizations across the world with reliable, cost effective and flexible end-to-end supply chain solutions, to help them scale, succeed and offer best in class experience to their customers.\n\nAmazon has spent years building one of the world’s most efficient and optimized supply chains. Amazon Warehousing and Distribution (AWD) org will build on that foundation and continue to innovate to offer a multi-tenant, bulk storage and distribution service.\n\nAs a developer on the team you’ll drive improvements to our technology, collaborating with sharp engineers and highly-engaged users to ship code continuously. We have many domains ranging from highly-scalable transactional backend systems, to complex optimization problems, to customer facing applications/APIs, so if you love building world-class software of any type, most likely we have a place for you.\n\nWe’re looking for software development engineer who share our passion for continuously improving the customer experience, who are motivated by challenging problems in distributed systems, algorithms, and HCI and who love writing great code. If you have an entrepreneurial spirit, know how to deliver, are deeply technical, highly innovative and long for the opportunity to build pioneering solutions to challenging problems, we want to talk to you.\n\nKey job responsibilities\n- Work closely with senior engineers to architect and deliver high quality technology solutions\n- Own development in multiple layers of the stack including distributed workflows hosted in AWS architecture\n- Take the ownership of the development stack\n- Measure success metrics and influence evolution of the tech product",
    "url": "https://www.amazon.jobs/en/jobs/2995045/software-development-engineer-ii"
  },
  {
    "title": "Software Development Engineer",
    "company": "Amazon",
    "location": "IND, KA, Bangalore",
    "description": "DESCRIPTION\n\nWe are the guardians of the Amazon galaxy. The Account Compliance team strives to ensure that Amazon remains compliant and the cost of being compliant is never the reason where the business or our sellers cannot scale. Our diverse team innovates on behalf of their customers to build a trusted marketplace through best-in-class compliance products. With hundreds of millions of customers around the world depending on our products & services, our systems form the tip of the spear against bad actors. These actors might abuse Amazon products and undermine customer faith, so our success comes from identifying & removing them while delivering best-in-class customer experiences for the good actors and strategic customers. We’re creating the most trusted store on earth, enabling Amazon to innovate at scale, and supporting our customers to launch & grow their business faster than anywhere else in the world.\nAs a Software Development Engineer in the account compliance team, you will design and build software that 1) is extensible to different use cases, products, and geographies with almost zero incremental tech effort, 2) can trigger verifications that are necessary under applicable policies, 3) can store verification decisions for re-use to reduce duplicative checks; and (5) is vendible to any authorized user via API. The software is smarter than the smartest bad actors in the world to protect the store from illegal activities at scale. Amazon's scale means that you'll be designing and developing custom distributed systems more advanced than those used in standard industry practices. These data-centric systems need to detect patterns across Amazon's huge customer population as they happen and be adaptive so that they can detect new modus operandi as they develop. Lastly, they need to be highly available, low latency, high quality systems. If this sounds interesting to you, then apply and find out more!",
    "url": "https://www.amazon.jobs/en/jobs/2955176/software-development-engineer"
  },
  {
    "title": "Software Engineer II",
    "company": "Amazon",
    "location": "IND, KA, Bangalore",
    "description": "DESCRIPTION\n\nWould you like to work on one of the world's largest transactional distributed systems? How about working with customers and peers from the entire range of Amazon's business on cool new features? Whether you're passionate about building highly scalable and reliable systems or a software developer who likes to solve business problems, Selling Partner Services (SPS) is the place for you. Our team is responsible for Case Management System.\n\nWe are looking for software engineers who thrive on complex problems and solve for operating complex and mission critical systems under high loads. Our systems manage case resolution systems with hundreds of millions of requests, and respond to millions of service requests. We have both frontend and backend code stack and opportunities. We are aimed to provide customizable and LLM based solution to our clients. Do you think you are up for this challenge? Or would you like to learn more and stretch your skills and career?\nThe successful candidate is expected to contribute to all parts of the software development and deployment lifecycle, including design, development, documentation, testing and maintenance. They must possess good verbal and written communication skills, be self-driven and deliver high quality results in a fast paced environment.\nYou will thrive in our collaborative environment, working alongside accomplished engineers who value teamwork and technical excellence. We're looking for experienced technical leaders.\n\nKey job responsibilities\nAs a Software Development Engineer on the team you will take ownership over the software design, documentation, development, engineering approach, delivery and support of systems built natively in AWS. In this role you will collaborate with leaders, work backwards from customers, identify problems, propose innovative solutions, relentlessly raise standards, and have a positive impact on hundreds of millions of customers.",
    "url": "https://www.amazon.jobs/en/jobs/3007108/software-engineer-ii"
  },
  {
    "title": "Software Development Engineer II , Fire TV",
    "company": "Amazon",
    "location": "IND, KA, Bangalore",
    "description": "DESCRIPTION\n\nAre you interested in jumping into the driver’s seat of our sensational FireTV partner products? We are looking for exceptional talent to join as Software Development Engineer in the Fire TV team.\n\nOur charter is to provide customers and partners a compelling, secure, and robust experience with a steady flow of engaging new features throughout the lifetime of a device.\n\nAs a member of the team, you will be working with business partners, software development engineers and testers UI/UX designers to design, implement, test, launch, document, and maintain complex software applications, tools, and systems. You will have significant influence on our overall strategy by helping define these product features, drive the system architecture, and spearhead the best practices that enable a quality product. You will learn a variety of cutting-edge technologies, development processes, and develop well-rounded skills such as leadership, and effective project management. You will also mentor junior software development engineers.\n\nKey job responsibilities\nIn this role, you will\nDesign, develop, implement, test, and document distributed software applications, tools, systems and services.\nTranslate functional requirements into robust, efficient, supportable solutions that work well within the overall system architecture.\nEvaluate and make decisions around the use of new or existing software products and tools.\nMentor junior engineers.\n\nAbout the team\nFireTV 3P engineering team is chartered to bring enchanting FireTV experiences to third party devices. This is an opportunity to design, develop and own the software that disrupts TV viewing experience and impact billions of viewers and devices.\n\nWe are spinning up a greenfield engineering team to build tools and technologies which will redefine the way 3P partners build their TVs on FireTV ecosystem. With exciting roadmap and launches planned ahead. FireTV 3P engineering team will independently own, deliver and support end to end product journey for partners.",
    "url": "https://www.amazon.jobs/en/jobs/3022912/software-development-engineer-ii-fire-tv"
  },
  {
    "title": "Support Engineer, Chronicle",
    "company": "Amazon",
    "location": "IND, TN, Chennai",
    "description": "DESCRIPTION\n\nImpact\nEver wondered how Amazon offers the Earth's biggest selection and still manages to offer lower prices every day to our customers? Our retail business teams work with a massive array of vendors and business financial performance metrics to expand selection and drive costs lower. Given the rapid growth of our business, this requires our category leaders, financial analysts, site merchandisers and vendor managers to quickly analyze vendors, categories and brands, diving deep into data showing business efficiency down to the unit sale level. The technology that enables this has huge visibility and impact and is critical to Amazon's continued profitability and growth.\n\nInnovation\nWe're working on the future. If you are seeking an environment where you can drive innovation. If you want to apply state-of-the-art software technologies to solve real world problems. If you want the satisfaction of providing visible benefit to end-users in an iterative fast paced environment, this is your opportunity. The responsibilities of this role will be key in paving the future of Amazon Retail and transforming how we do business.\n\nOpportunity\nYou will be part of a team of creative, top-notch engineers who work hard, have fun, and make history.\nAs a Support Engineer, you will build systems that secure and govern our data end to end: control access across multiple storage and access layers (like in-house Applications and external aplications ), track data quality, catalogue datasets and their lineage, detect duplication, audit usage and ensure correct data semantics.\nYou will be responsible for crunching and providing support for petabytes of in-coming data from dozens of sources and financial events around the company.\nBe part of a high performance, high profile team with a complete, entirely localized business charter to enhance business profitability for the Amazon Consumer business.\nPlatform runs entirely on AWS; high scale, cutting edge engineering challenges.\nVery successful team that has developed a reputation of delivering results within Amazon.\nWe regularly research new technologies and invest for the future of our scalability\nThis role is on the Chronicle team within Selling Partner Services. We own the Turismo product suite, which is powered by Ripple, a dynamic query engine. Turismo is a well loved product, with 15k+ users globally. Ripple is a PrestoDB based query engine that is built to scale, and processes 2M+ queries per week. We are a full stack team, with Product managers, UX designers, TPMs, SDEs, DEs and Data Scientists.\n\nKey job responsibilities\n* Provide support of incoming tickets, including extensive troubleshooting tasks, with responsibilities covering multiple products, features and services\n* Work on operations and maintenance driven coding projects\n* Software deployment support in staging and production environments\n* Develop tools to aid operations and maintenance\n* System and Support status reporting\n* Ownership of one or more ETL products or components\n* Customer notification and workflow coordination and follow-up to maintain service level agreements\n* Work with support team for handing-off or taking over active support issues and creating a team specific knowledge base and skill sets",
    "url": "https://www.amazon.jobs/en/jobs/2872518/support-engineer-chronicle"
  },
  {
    "title": "Software Development Engineer II",
    "company": "Amazon",
    "location": "IND, KA, Bengaluru",
    "description": "DESCRIPTION\n\nWe are seeking an exceptional Machine Learning Engineer to join a team of experts in the field of AI/ML, and work together to tackle challenging business problems across diverse compliance domains. We leverage and train state-of-the-art multi-modal, large-language-models (LLMs), and vision language models (VLMs) to detect illegal and unsafe products across the Amazon catalog. We work on machine learning problems for generative AI, agentic systems, multi-modal classification, intent detection, information retrieval, anomaly and fraud detection.\n\nAs a machine learning engineer, you will work with a highly skilled cross-functional team to invent, design, build and manage scalable ML systems. You will be solving challenging customer problems that are yet to be solved, conduct rapid prototyping, and deploy ML models to production. You will be using the latest innovations in AI, AWS, and industry technologies to build software, keeping our customers safe.\n\nIf you’d like to make a real-world difference by working hard, having fun, and making history, this is the team for you!\n\nKey job responsibilities\nIn this role you will:\n- Contribute to defining the system architecture, own implementation of specific components, and help shape the overall experience\n- Collaborate closely with other team members to help define the scope of the product\n- Take responsibility for technical problem solving to creatively meeting objectives, while insisting on best practices\n- Write high-quality, efficient, testable code in Python and other object-oriented languages\n- Design Amazon-scale tools to facilitate internal business\n- Build highly available, secure, and low-latency systems\n- Find out what it takes to engineer systems for \"Amazon Scale\"\n- Own and operate the systems that you build based on real-time customer data and demanding service-level agreements\n\n\n\nA day in the life\nHigh-level designs, cross-team alignment, long-term architectural roadmap and technical strategy, understanding the business domain and proposing solutions to address customer and business problems, helping scope and analyze product requirements, mentorship, reviewing and writing high quality code.\n\nAbout the team\nWe are a team of scientists and engineers building AI/ML solutions to make Amazon the Earth’s most trusted shopping destination for safe and compliant products.",
    "url": "https://www.amazon.jobs/en/jobs/3023139/software-development-engineer-ii"
  },
  {
    "title": "Software Development Engineer II",
    "company": "Amazon",
    "location": "IND, KA, Bengaluru",
    "description": "DESCRIPTION\n\nAre you looking for an opportunity to create a new supply chain product? We are a startup team working working to enable organizations across the world with reliable, cost effective and flexible end-to-end supply chain solutions, to help them scale, succeed and offer best in class experience to their customers.\n\nAmazon has spent years building one of the world’s most efficient and optimized supply chains. Amazon Warehousing and Distribution (AWD) org will build on that foundation and continue to innovate to offer a multi-tenant, bulk storage and distribution service.\n\nAs a developer on the team you’ll drive improvements to our technology, collaborating with sharp engineers and highly-engaged users to ship code continuously. We have many domains ranging from highly-scalable transactional backend systems, to complex optimization problems, to customer facing applications/APIs, so if you love building world-class software of any type, most likely we have a place for you.\n\nWe’re looking for software development engineers who share our passion for continuously improving the customer experience, who are motivated by challenging problems in distributed systems, algorithms, and HCI and who love writing great code. If you have an entrepreneurial spirit, know how to deliver, are deeply technical, highly innovative and long for the opportunity to build pioneering solutions to challenging problems, we want to talk to you.",
    "url": "https://www.amazon.jobs/en/jobs/2974518/software-development-engineer-ii"
  },
  {
    "title": "Software Development Engineer II, Device OS",
    "company": "Amazon",
    "location": "IND, KA, Bengaluru",
    "description": "DESCRIPTION\n\nDo you want to develop the next generation products in Entertainment Devices space? Do you enjoy working in an entrepreneurial environment solving complex technical problems and delivering innovative solutions? Do you like to directly impact the customer experience of Purchase, Download & Install the apps in Amazon AppStore? If so, join us on the Amazon Appstore Distribution team.\n\nThe Appstore Distribution team develops products, services, SDKs, tools for mobile app developers to manage their apps on Amazon Appstore as well as build systems to curate catalog of hundreds of thousands of mobile apps to enable them on Fire TV and Fire Tablet store.\n\nKey job responsibilities\nDo you want to solve business challenges through innovative technology? Do you enjoy working on efficient, scalable services in a team environment? Do you like working on industry-defining projects that move the needle?\n\nAt Amazon, we hire the best minds in technology to innovate and build on behalf of our customers. Our Software Development Engineers (SDEs) use high-end technology to solve complex problems and get to see the impact of their work first-hand.\n\nThe challenges SDEs solve in Amazon Appstore are big and influence hundreds of millions of customers, millions of App Developers and varieties of products around the world. We are looking for individuals who are passionate about creating new products, features, and services from scratch while managing ambiguity and the pace of a company where development cycles are measured in weeks, not years.\n\nIf this sounds interesting to you, apply and come chart your own path at Amazon.\n\nA day in the life\nAs a Software Dev Engineer II in this team, you will define and build innovative consumer product experiences with a direct impact on the design, architecture and implementation of flagship products that customers love and use every day. The ideal candidate will have industry-leading programming skills, an established background developing consumer applications and services across mobile platforms (Android) or high-volume service architectures, and an industry-leading knowledge of object-oriented development.\n\nYour day starts with daily stand-up call, connecting & collaborating with your peers for design & code reviews, come up with robust & highly scalable solutions, Agile practices etc.\n\n\nAbout the team\nIn Appstore, “We entertain, and delight, hundreds of millions of customers across devices with a vast selection of relevant apps, games and services by making it trivially easy for developers to deliver”. Appstore team enables the customer and developer flywheel on devices by enabling developers to seamlessly launch and manage their apps/in-app content on Amazon. It helps customers discover, buy and engage with these apps on Fire TV, Fire Tablets and mobile devices. The technologies we build on vary from device software, to high scale services, to efficient tools for developers.",
    "url": "https://www.amazon.jobs/en/jobs/3016746/software-development-engineer-ii-device-os"
  },
  {
    "title": "Software Development Engineer - II, SPIV",
    "company": "Amazon",
    "location": "IND, TS, Hyderabad\nIND, KA, Bangalore",
    "description": "DESCRIPTION\n\nSelling Partner Identity Verification (SPIV) team ensures that Amazon is a safe and trustworthy place to shop and an amazing place to build a successful business selling products. We support this mission through providing a secure and accurate Identity verification platform. Identity verification is becoming a critical component to protect our customers from bad actors and provide fast and secure registration and account management capabilities. We provide an end to end solution for identity verification and account lifecycle management for various Amazon businesses across globe (North America, Europe, Japan, China and more). Our customers include Mechanical Turk, Selling on Amazon, Amazon Pay, Amazon Flex etc. We continuously strive to scale our systems to serve millions of Amazon customers with high accuracy, least friction, in a highly secure manner to enable a safe and secure shopping experience for customers.\n\nKey job responsibilities\nEngineers in the team need a strong understanding of Computer fundamentals and practical experience in working with large scale distributed systems. Experience with web services-based applications, especially at massive scale, is helpful.",
    "url": "https://www.amazon.jobs/en/jobs/2950421/software-development-engineer-ii-spiv"
  },
  {
    "title": "Software Development Engineer II, Pre Station Planning Technology",
    "company": "Amazon",
    "location": "IND, KA, Bangalore",
    "description": "DESCRIPTION\n\nAmazon has come a long way since opening on the World Wide Web in July 1995. Today, we operate retail websites in multiple countries across geographies, offering products in many categories (books, media, digital, electronics etc.) worldwide, and we still like to work hard, have fun and make history! The Amazon.com brand has become synonymous with a superior level of convenience, selection, low prices, and customer service. The Last Mile Planning team, within the LMT organization, is at the heart of our growing logistics network at Amazon. We build all the software that creates efficient route, station and capacity plans that operations uses to deliver billions of packages that Amazon customers order worldwide, right up to their doorsteps. We’re challenged to constantly improve and innovate on our vehicle routing/planning software and tools to better support fast delivery to customers. The technology innovations that are developed by the Last Mile Technology team scale our growing network and include a wide breadth of solutions from ML and operations research-based routing and planning algorithms, our own in-house maps and navigation platform, IoT and hardware innovations, doorstep delivery experience, and the consumer grade native mobile apps that brings all these experiences together.\n\nThe Pre Station Planning Technology team is one of the critical teams supporting and enabling Last Mile operations for Amazon Worldwide. We build software for demand forecasting, capacity planning, jurisdiction and topology management and fleet planning among other areas. All of these services help estimate the precise number of stations, vehicles, drivers and routes to deliver billions of packages to customers worldwide and have a high impact on cost as well as deliver efficiency.\n\nWe are looking for a SDE with exceptional technical skills and a passion for delivering great software to join our team. As a member of this team, you will be responsible to own and deliver highly visible, innovative projects that directly impact the customer experience. You will be involved in driving the technical and architectural vision for a planning team that touches every Amazon package, as well as all the aspects of the software development cycle including scoping, design, implementation, testing & delivery of our product.",
    "url": "https://www.amazon.jobs/en/jobs/3026068/software-development-engineer-ii-pre-station-planning-technology"
  },
  {
    "title": "Software Development Engineer II",
    "company": "Amazon",
    "location": "IND, KA, Bengaluru",
    "description": "DESCRIPTION\n\nREADY TO DO SOMETHING BIG?\n\nHow would you build the next generation of mission critical systems and services that power the ability to send, store and manage billions of products across the globe on behalf of our selling partners?\n\nFulfillment by Amazon (FBA) is the Amazon service for world-wide sellers that offers access to Amazon’s vast distribution network as a service. Similar to how AWS provides infrastructure as a service, FBA allows sellers to only pay for what they use, creating a seamless experience to leverage our world-class infrastructure. Sellers, from Fortune 50 companies to hundreds of thousands of small businesses and entrepreneurs, in 135 countries worldwide, rely upon our world-leading technology to grow and thrive on Amazon’s Marketplaces.\n\nAs a leader within FBA, you will provide both strategic and tactical oversight to build the features and functionality required to have the best in class offering for sellers. This leader will create mechanisms to drive optimal seller behavior for FBA inventory management, reducing total supply chain costs and making it easier for sellers to get their inventory close to customers, delivering more items with a Prime delivery promise. This leader will invent new ways to deliver value for sellers and their products, while leveraging the scale and innovation of technology from across the Amazon family, including AWS.\n\nWe operate as a startup within Amazon, providing our team great flexibility in product and technology direction. Come, join us and build the future!\n\nKey job responsibilities\n• You will solve ambiguous business problems and map them to elegant technical solutions\n• You will use object-oriented concepts, algorithms and data structures to build systems at Amazon scale\n• You will design, launch, and re-architect multi-tier systems with large amounts of data\n• You will quickly adapt to fast-paced development environment with bias towards simple and extensible code\n\nAbout the team\nFBA Inventory Management team has a charter to help selling partners and enterprises to optimally plan and manage their inventory in Amazon's fulfillment and warehousing network to meet their on- and off-Amazon demand while minimizing risk of understock and overstock. We do this by providing sellers detailed visibility of their inventory in our network, performance metrics, planning & automation tools and recommendations to manage their inventory.",
    "url": "https://www.amazon.jobs/en/jobs/3009037/software-development-engineer-ii"
  },
  {
    "title": "Software Development Engineer II",
    "company": "Amazon",
    "location": "IND, KA, Bengaluru",
    "description": "DESCRIPTION\n\nREADY TO DO SOMETHING BIG?\n\nHow would you build the next generation of mission critical systems and services that power the ability to send, store and manage billions of products across the globe on behalf of our selling partners?\n\nFulfillment by Amazon (FBA) is the Amazon service for world-wide sellers that offers access to Amazon’s vast distribution network as a service. Similar to how AWS provides infrastructure as a service, FBA allows sellers to only pay for what they use, creating a seamless experience to leverage our world-class infrastructure. Sellers, from Fortune 50 companies to hundreds of thousands of small businesses and entrepreneurs, in 135 countries worldwide, rely upon our world-leading technology to grow and thrive on Amazon’s Marketplaces.\n\nAs a leader within FBA, you will provide both strategic and tactical oversight to build the features and functionality required to have the best in class offering for sellers. This leader will create mechanisms to drive optimal seller behavior for FBA inventory management, reducing total supply chain costs and making it easier for sellers to get their inventory close to customers, delivering more items with a Prime delivery promise. This leader will invent new ways to deliver value for sellers and their products, while leveraging the scale and innovation of technology from across the Amazon family, including AWS.\n\nWe operate as a startup within Amazon, providing our team great flexibility in product and technology direction. Come, join us and build the future!\n\nKey job responsibilities\n• You will solve ambiguous business problems and map them to elegant technical solutions\n• You will use object-oriented concepts, algorithms and data structures to build systems at Amazon scale\n• You will design, launch, and re-architect multi-tier systems with large amounts of data\n• You will quickly adapt to fast-paced development environment with bias towards simple and extensible code\n\nAbout the team\nFBA Inventory Management team has a charter to help selling partners and enterprises to optimally plan and manage their inventory in Amazon's fulfillment and warehousing network to meet their on- and off-Amazon demand while minimizing risk of understock and overstock. We do this by providing sellers detailed visibility of their inventory in our network, performance metrics, planning & automation tools and recommendations to manage their inventory.",
    "url": "https://www.amazon.jobs/en/jobs/3000348/software-development-engineer-ii"
  },
  {
    "title": "Senior Technical Program Manager",
    "company": "Amazon",
    "location": "IND, KA, Bengaluru",
    "description": "DESCRIPTION\n\nAre you passionate about improving the quality of customer experiences? Do you strive to create customer-centric solutions that drive measurable results? Do you like to design and implement scalable end-to-end solutions built on sound process excellence principles? Does leading resource coordination and priority setting across teams, countries and cultures sound exciting? If so, the Selling Partner Support team is looking for a Senior Technical Program Manager (TPM) to build and manage large-scale technology initiatives that impact our Selling Partners and Support Associates positively.\nThird-party sellers represent significant value to Amazon’s online retail customers and Selling Partner Support (SP-Support) drives success for these sellers through a combination of people, processes and services. We are the primary interface between Selling Partners and Amazon by building communication tools that sellers use to receive help, and by driving cross-functional initiatives to improve the seller experience. Additionally, we possess a wealth of data regarding the reason sellers contact us for help and we use this information to identify and drive improvements to our seller solutions across the Company.\n\nKey job responsibilities\nAs a Senior TPM in the SP-Support organization, you will lead highly visible projects with dozens of stakeholders. You will collaborate directly with stakeholders across Product, Engineering and Science teams to build systems that harness the power of NLP including Large Language Models (LLM), to extract insights, generate content and create transformative experiences for our Selling Partners and Associates. You will ensure the teams are delivering the highest quality products and services predictably while meeting the technical needs of our community.\n\nThe role will require constant balance between long term product vision along with addressing immediate needs, driving an incremental approach that is metrics and data driven. You will need to articulate technology choices and decisions to a diverse group and be able to influence them. It will require communicating effectively with leaders across Director and VP level on a regular basis while ensuring that the teams are aligned and stakeholders are aware of key performance indicators.",
    "url": "https://www.amazon.jobs/en/jobs/3010691/senior-technical-program-manager"
  },
  {
    "title": "Software Developement Engineer",
    "company": "Amazon",
    "location": "IND, KA, Bengaluru",
    "description": "DESCRIPTION\n\nAmazon strives to be Earth's most customer-centric company where people can find and discover virtually anything they want to buy online. By giving customers more of what they want – low prices, vast selection, and convenience – Amazon continues to grow and evolve as a world-class e-commerce platform. We are looking for a Software Engineer with expertise and passion to imagine, build and develop innovative products. This is a high growth space and a big opportunity that needs an entrepreneurial minded product creator.\n\nThe ideal candidate will be curious, have attention to detail, be energized by challenging entrepreneurial environment, be comfortable thinking big while also diving deep.Are you a smart, hungry, flexible, and world-class software engineer excited by the challenge of launching a new business initiative for Amazon? Smart Commerce team in India is looking for software engineers to be part a new team being built from ground up.\n\nThey will be primarily working on our product Smartbiz. SmartBiz by Amazon is a one-stop shop for Indian sellers to fulfill their online selling needs. Whether a small business, an entrepreneur, or a neighborhood store, a seller can now create your own e-commerce store within minutes and start showcasing and selling their products online.\n\nKey job responsibilities\nWork with product managers in developing a strategy and road map to provide compelling capabilities that helps them succeed in their business goals.\n\nWork closely with senior engineers to develop the best technical design and approach for new product development.\n\nInstill best practices for software development and documentation, assure designs meet requirements, and deliver high-quality work on tight schedules.\n\nProject management - prioritization , planning of projects and features, Stakeholder management and tracking of external commitments\n\nOperational Excellence - monitoring & operation of production services",
    "url": "https://www.amazon.jobs/en/jobs/3025782/software-developement-engineer"
  },
  {
    "title": "Front-End Engineer",
    "company": "Amazon",
    "location": "IND, KA, Bengaluru",
    "description": "DESCRIPTION\n\nAmazon strives to be Earth's most customer-centric company where people can find and discover virtually anything they want to buy online. By giving customers more of what they want – low prices, vast selection, and convenience – Amazon continues to grow and evolve as a world-class e-commerce platform. We are looking for a Software Engineer with expertise and passion to imagine, build and develop innovative products. This is a high growth space and a big opportunity that needs an entrepreneurial minded product creator.\n\nThe ideal candidate is passionate about framework development for web, mobile devices and mobile web browsers. Experience with mobile cross platform development frameworks like React Native on iOS and Android, and fluency with Typescript/Javascript is highly desirable. Knowledge on query language APIs like GraphQL and ServerSide/ Isomorphic Rendering frameworks is an added advantage. They should have a strong track record of creating reliable, scalable, and high-performance tools, services and thrive on delivering high quality technology solutions, in a hyper-growth environment where priorities shift fast.\n\nThey will be primarily working on our product Smartbiz. SmartBiz by Amazon is a one-stop shop for Indian sellers to fulfill their online selling needs. Whether a small business, an entrepreneur, or a neighborhood store, a seller can now create your own e-commerce store within minutes and start showcasing and selling their products online.",
    "url": "https://www.amazon.jobs/en/jobs/3025784/front-end-engineer"
  },
  {
    "title": "Front-End Engineer I",
    "company": "Amazon",
    "location": "IND, KA, Bengaluru",
    "description": "DESCRIPTION\n\nAmazon strives to be Earth's most customer-centric company where people can find and discover virtually anything they want to buy online. By giving customers more of what they want – low prices, vast selection, and convenience – Amazon continues to grow and evolve as a world-class e-commerce platform. We are looking for a Software Engineer with expertise and passion to imagine, build and develop innovative products. This is a high growth space and a big opportunity that needs an entrepreneurial minded product creator.\n\nThe ideal candidate is passionate about framework development for web, mobile devices and mobile web browsers. Experience with mobile cross platform development frameworks like React Native on iOS and Android, and fluency with Typescript/Javascript is highly desirable. Knowledge on query language APIs like GraphQL and ServerSide/ Isomorphic Rendering frameworks is an added advantage. They should have a strong track record of creating reliable, scalable, and high-performance tools, services and thrive on delivering high quality technology solutions, in a hyper-growth environment where priorities shift fast.\n\nThey will be primarily working on our product Smartbiz. SmartBiz by Amazon is a one-stop shop for Indian sellers to fulfill their online selling needs. Whether a small business, an entrepreneur, or a neighborhood store, a seller can now create your own e-commerce store within minutes and start showcasing and selling their products online.",
    "url": "https://www.amazon.jobs/en/jobs/3025776/front-end-engineer-i"
  },
  {
    "title": "Business Intelligence Engineer, Cross Border Business",
    "company": "Amazon",
    "location": "IND, TN, Chennai",
    "description": "DESCRIPTION\n\n* 12 Month, Fixed Term Contract*\n\nAs a Business Intelligence Engineer, you will be deciphering our customers' ever-evolving needs and shaping solutions that elevate their experience with Amazon.\n\nA successful candidate will possess:\nStrong analytical and problem-solving skills, leveraging data and metrics to inform strategic decisions.\nImpeccable attention to detail and a clear and compelling communication skills, capable of articulating data insights to diverse stakeholders.\n\nKey job responsibilities\nDeliver on all analytics requirements across business areas.\nOwn the design, development, and maintenance of ongoing metrics, reports, analyses, dashboards, data pipelines etc. to drive key business decisions.\nEnsure data accuracy by validating data for new and existing tools.\n\nPerform both ad-hoc and strategic data analyses\nBuild various data visualizations to tell the story and let the data speak for itself.\nRecognize and adopt best practices in reporting and analysis: data integrity, test design, analysis, validation, and documentation.\nBuild automation to reduce dependencies on manual data pulls etc.\n\nA day in the life\nA day in the life of Business Intelligence Engineer will include working closely with Product Managers and Software Developers. Working on building dashboards, performing root cause analysis and sharing actionable insights with the stakeholders to enable data-informed decision making.\n\nLead reporting and analytics initiatives to drive data-informed decision making.\nDesign, develop, and maintain ETL processes and data visualization dashboards using Amazon QuickSight.\nTransform complex business requirements into actionable analytics solutions.",
    "url": "https://www.amazon.jobs/en/jobs/3018486/business-intelligence-engineer-cross-border-business"
  },
  {
    "title": "Software Development Engineer, JWO Tech Corporate",
    "company": "Amazon",
    "location": "IND, KA, Bengaluru",
    "description": "DESCRIPTION\n\nAs part of the AWS Solutions organization, we have a vision to provide business applications, leveraging Amazon’s unique experience and expertise, that are used by millions of companies worldwide to manage day-to-day operations. We will accomplish this by accelerating our customers’ businesses through delivery of intuitive and differentiated technology solutions that solve enduring business challenges. We blend vision with curiosity and Amazon’s real-world experience to build opinionated, turnkey solutions. Where customers prefer to buy over build, we become their trusted partner with solutions that are no-brainers to buy and easy to use.\n\nAs a Software Development Engineer, you will help solve a variety of technical challenges and mentor other engineers. You will play an active role in translating business and functional requirements into concrete deliverables and build quick prototypes or proofs of concept in partnership with other technology leaders within the team. You will help invent new features, design, develop and deploy reliable distributed services. You will work with a variety of core languages and technologies including Java and AWS technologies.\n\nYou will tackle challenging situations every day and you’ll have the opportunity to work with multiple technical teams at Amazon. You should be comfortable with a degree of ambiguity that’s higher than most projects and relish the idea of solving problems. Along the way, we guarantee that you’ll learn a ton, have fun and make a positive impact on many customers.\n\nKey job responsibilities\n* Leading development and maintenance of key system features\n* Working with other team members to investigate design approaches\n* Prototyping designs and testing them with teammates\n* Working in an Agile/Scrum environment to deliver high quality software against tight schedules\n\nAbout the team\nDiverse Experiences\nAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\nWhy AWS?\nAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\nInclusive Team Culture\nHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (diversity) conferences, inspire us to never stop embracing our uniqueness.\nMentorship & Career Growth\nWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\nWork/Life Balance\nWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.",
    "url": "https://www.amazon.jobs/en/jobs/3025789/software-development-engineer-jwo-tech-corporate"
  },
  {
    "title": "Software Dev Engineer II",
    "company": "Amazon",
    "location": "IND, KA, Bangalore",
    "description": "DESCRIPTION\n\nThe Amazon Prime Video team is looking for a smart, motivated, and results-oriented software development engineer to join the team. We are a high-energy and innovative group changing the way customers watch TV and movies.\n\nWe are looking for candidates who are passionate about delivering world-class digital media experiences to our customers. Successful candidates for this position will be self-starters with strong problem solving skills who love getting things done. Strong communication skills and a desire to tackle complex problems that emerge from driving a large business at Amazon are also a must.\n\nAs a norm, Amazon SDE’s have industry-leading technical abilities. They recognize and adopt best practices in software engineering: design, testing, version control, documentation, build, deployment, and operations. They write high quality, maintainable, and robust code, often in Java or C++. They solve problems at their root, stepping back to understand the broader context. They build flexible systems without over-engineering and choose simple, straightforward solutions over more complex ones. They understand a broad range of data structures and algorithms and know how, when and when not to use them; recognize and use design patterns to solve business problems. They understand how operating systems work, perform and scale.",
    "url": "https://www.amazon.jobs/en/jobs/3014146/software-dev-engineer-ii"
  },
  {
    "title": "Software Development Engineer II",
    "company": "Amazon",
    "location": "IND, TN, Chennai",
    "description": "DESCRIPTION\n\nWe are looking for Software Development Engineer with passion to innovate on behalf of eBook customers to easily purchase eBooks and Kindle subscriptions. We build innovative experiences that reduces transaction friction and increase extensible solution for digital purchase experience that can be leveraged across multiple digital businesses.\n\nThe role will challenge with unique opportunity to collaborate on cross service, design changes to propose new architecture and/or modify existing architecture, and drive the right technical trade-offs between short-term and long-term concerns. You will have to deal with significant complexity while building features, due to changes necessary in various services/pages such as eBooks purchase experience, pre-purchase and checkout experience for digital products and so on. The complexity manifests further as those features will have to be scalable and work seamlessly for multiple digital businesses and on different surfaces like PC Web Browser, Mobile Web browser, Amazon Android application, Free Kindle reading app on iOS and Android and Amazon’s E-reader",
    "url": "https://www.amazon.jobs/en/jobs/3025874/software-development-engineer-ii"
  },
  {
    "title": "Software development Engineer, Device Management Systems, India",
    "company": "Amazon",
    "location": "IND, TN, Chennai",
    "description": "DESCRIPTION\n\nWe are the cloud platform solution provider for the Device businesses ranging from the E-Reader to Echo Family of Devices and expanding into third-party devices that connect to Amazon eco-system.\n\nKey job responsibilities\n• Define the long term technical strategy and architecture vision for device management, leveraging new technologies to deliver features to our customers.\n• Think big and continuously pitch for foundational solutions that will help device businesses to use these solutions, where applicable, instead of building their own.\n• Define technical approach to ensure data privacy is considered while providing foundational solutions.\n• Partner with each device team to understand their customer needs and influence adoption of new services.\n• Possess expert knowledge in performance, scalability, enterprise system architecture, and engineering best practices.\n• Assist in the career development of others, actively mentoring individuals and the Amazon developer community on advanced technical issues and helping managers guide the career growth of their team members.\n\n\nA day in the life\n- Communicate with other business teams in E-Reader/Tablet/Fire-TV/Alexa to name a few.\n- Collect the business requirements,\n- Help describe software product features,\n- Build technical designs and architecture.\n- Write code with at most care for customer data's security and customer's privacy.\n\nAbout the team\nThe Device Management Services (DMS) organization is specialized in building foundational platform solutions that cater to a number of critical customer experiences.",
    "url": "https://www.amazon.jobs/en/jobs/3006511/software-development-engineer-device-management-systems-india"
  },
  {
    "title": "QA Manager, LLM Quality Assurance",
    "company": "Amazon",
    "location": "IND, TS, Hyderabad",
    "description": "DESCRIPTION\n\nAs the QA Manager, you will be building and managing a team of QA Testers who work as integrated members of a cross-functional software team. You will lead them in the design and execution of QA strategies and methods to deliver creative experiential software products that surprise and delight our customers. You should possess excellent communication and interpersonal skills, attention to detail, patience, and a real passion for testing and quality. We are seeking a QA Manager with a strong foundation in software engineering QA methodologies and proven experience leading teams to deliver successful creative interactive entertainment software experiences.\n\nKey job responsibilities\nHandle diverse team of Quality Assurance specialists.\nAssist continuous professional plans of QA team members.\nHelp in resource allocation and estimation efforts and delegate duties for routine activities.\nDocument and follow through issues for prompt resolution.\nCollaborate with stakeholders from different time zones.\nEnhance QA methodology for test and defect management and tools supporting processes.\nMaintain defect triage process and continuous defect review in software organization.\nTrack customer facing issues in customer support tracking tool.\nEscalate unresolved issues for suitable customer support level.\nOffer continuous improvement by assessing customer issues for root cause and future prevention.\nInvestigate and explore upcoming new technologies and suggest for enhancements.\nConduct test and demos and inspect to certify product readiness for quality gates.\nEnsure and record requirements coverage by verification\n\n\nAbout the team\nThe International Seller Growth Team’s mission is to set our worldwide Sellers up for success across our global Marketplaces. We deliver needle-moving initiatives which provide a seamless experience to Amazon Sellers at each step of the Seller journey. We enable Sellers across the world to list millions of products at scale across multiple categories and dozens of languages in our global Marketplaces. This includes automatically mapping Seller product information to the Amazon namespace and automating complex decision making (like Product Classification in our Catalog) on the Seller’s behalf. We provide Sellers with strategic selling recommendations based on hybrid demand signals (like high-value products they should start selling in additional Marketplaces). We partner with Amazon Business to build best-in-class solutions that allow B2B Sellers to reach a wide customer base and drive billions of dollars in revenue. We continuously improve the state of the existing catalog created by Amazon Sellers through smart solutions that automatically identify and fix defects using self-learning heuristics leveraging textual and image-based signals.",
    "url": "https://www.amazon.jobs/en/jobs/3025667/qa-manager-llm-quality-assurance"
  },
  {
    "title": "Software Development Engineer , Ordering",
    "company": "Amazon",
    "location": "IND, TS, Hyderabad",
    "description": "DESCRIPTION\n\nAre you passionate about enabling millions of customers around to world buy anything, anywhere, anytime? Dealing with large scale distributed systems, orchestrating the entire retail ordering workflow?\nWe, the Ordering team, need strong software development engineers, able to dive deep into abstract problems and come up with innovative designs to help us continuously make our platform ready for our current and future challenges.\n\nYou need to be an active practitioner of engineering excellence: keeping a high bar for quality, consistency, maintainability, efficiency, security and all the other things that make great software great. You will work with the best of Amazon to build systems that accelerates our engineering and product teams.\n\nSDEs at Amazon work on real world problems on a global scale, own their systems end to end and influence the direction of our technology that impacts hundreds of millions customers around the world. At Amazon an SDE can expect to design flexible and scalable solutions, and work on some of the most complex challenges in large-scale computing by utilizing your skills in data structures, algorithms, and object oriented programming. Come to Amazon and work in one of our teams in the eCommerce services group.",
    "url": "https://www.amazon.jobs/en/jobs/3015064/software-development-engineer-ordering"
  },
  {
    "title": "Software Development Engineer , Ordering",
    "company": "Amazon",
    "location": "IND, TS, Hyderabad",
    "description": "DESCRIPTION\n\nAre you passionate about enabling millions of customers around to world buy anything, anywhere, anytime? Dealing with large scale distributed systems, orchestrating the entire retail ordering workflow?\nWe, the Ordering team, need strong software development engineers, able to dive deep into abstract problems and come up with innovative designs to help us continuously make our platform ready for our current and future challenges.\n\nYou need to be an active practitioner of engineering excellence: keeping a high bar for quality, consistency, maintainability, efficiency, security and all the other things that make great software great. You will work with the best of Amazon to build systems that accelerates our engineering and product teams.\n\nSDEs at Amazon work on real world problems on a global scale, own their systems end to end and influence the direction of our technology that impacts hundreds of millions customers around the world. At Amazon an SDE can expect to design flexible and scalable solutions, and work on some of the most complex challenges in large-scale computing by utilizing your skills in data structures, algorithms, and object oriented programming. Come to Amazon and work in one of our teams in the eCommerce services group.",
    "url": "https://www.amazon.jobs/en/jobs/3015065/software-development-engineer-ordering"
  },
  {
    "title": "Sr. Software Development Engineer, Device OS",
    "company": "Amazon",
    "location": "IND, KA, Bengaluru",
    "description": "DESCRIPTION\n\nAmazon Lab126 is an inventive research and development company that designs and engineers high-profile consumer electronics. Lab126 began in 2004 as a subsidiary of Amazon.com, Inc., originally creating the best-selling Kindle family of products. Since then, Lab126 has produced groundbreaking devices like Fire tablets, Fire TV, Amazon Echo, and Dash Button. The Device OS team is a big part of creating these innovative devices at Lab126 providing the core OS, platform, features and components.\nIn the Device OS group, we are inventing the future for consumer electronics and are looking for a software development engineer to help us bring the vision into reality and solve real world challenges that will transform our customers’ experiences in ways we can’t even imagine yet. The team develops scalable cloud solutions that enable our partners to quickly build and launch devices quickly and in a cost-effective way. If you love to be hands on designing and implementing quality platform for our consumer electronic devices while working with a world class, highly accomplished team, we would love to talk with you.\nAs a Sr. Software Development Engineer, you will lead the technical aspects of core Device customer experience and engage with an experienced cross-disciplinary staff to design implement and bring to market innovative consumer products. You must be responsive, flexible and able to succeed within an open collaborative peer environment.\n\nThis Sr. Software Development Engineer role will be responsible to create innovative Embedded solutions enabling new/unique experiences for our customers with a wide range of Amazon Devices. This hands-on position also requires broad engineering competency in Embedded Software, Linux middleware, C/C++ based device software modules and application development, Strong experience in Multimedia domain (Audio, Video), good knowledge on HAL/HIDL is preferred along with a strong code craftsmanship principles and a good understanding of the scalable software system design. In addition, provide technical consultation across different organization, find innovative ways to solve customer needs and take up interesting technical problems that are unique to devices. You will work closely with Platform and application teams to ensure the highest level of quality for the Device OS deliverable.\n\nKey job responsibilities\nSoftware Development Engineer will deeply be involved in design of various middleware and cloud services by collaborating with the various internal and external stakeholders. Software Development Engineer will closely work with the Product Management team to detail out/disambiguate the requirements. Software Development Engineer will own the quality of his/her own work (code/design) and also help junior members in the team to meet or exceed the quality bar.",
    "url": "https://www.amazon.jobs/en/jobs/2996296/sr-software-development-engineer-device-os"
  },
  {
    "title": "Software Dev Engineer II, ESTech",
    "company": "Amazon",
    "location": "IND, TS, Hyderabad",
    "description": "DESCRIPTION\n\nAmazonian Experience and Technology (AET) is responsible for building and running Amazon’s human capital management technology, as well as business applications for benefits, time and attendance, disability and leave, immigration, learning, document management, health and safety, and HR contact center solutions. Our mission is to make Amazon “Earth’s Best Employer and Earth’s Safest Place to Work”.\n\nWe are looking for a Software Development Engineer II to build the experience and technology for Amazonians to get support on their important life events. In this role you will drive and execute the technology vision to create 1-click employee experience, where employees can manage their professional and personal life events, and do their day-to-day work of innovating on behalf of their customers, without any issue. You will use innovative technology to anticipate and understand the needs of employees, and create simple to use experiences that resolve their issues with low effort. Creating simple and low effort support experience for complex life events require building new capabilities, extending and adapting existing services, and orchestrating available resolutions across multiple organizations. You will create shared services using core and common building blocks that other teams can onboard to create seamless and comprehensive experience that works back from employees. You will drive the three year architectural plan for the technology as well as drive tradeoff decisions balancing long term vision with delivering immediate impact to our customers. You will be a mentor in the organization, coaching your peers on engineering excellence and leadership principles. You will be a champion of diversity, equity and inclusion. You will foster a safe environment for diversity of thought, encourage teams to experiment, fail-fast, learn and improve.\n\nCome join us to build the Earth’s best employee experience!",
    "url": "https://www.amazon.jobs/en/jobs/2987330/software-dev-engineer-ii-estech"
  },
  {
    "title": "Software Development Engineer, AWD",
    "company": "Amazon",
    "location": "IND, KA, Bengaluru",
    "description": "DESCRIPTION\n\nAre you looking for an opportunity to create a new supply chain product? We are a startup team working working to enable organizations across the world with reliable, cost effective and flexible end-to-end supply chain solutions, to help them scale, succeed and offer best in class experience to their customers.\n\nAmazon has spent years building one of the world’s most efficient and optimized supply chains. Amazon Warehousing and Distribution (AWD) org will build on that foundation and continue to innovate to offer a multi-tenant, bulk storage and distribution service.\n\nAs a developer on the team you’ll drive improvements to our technology, collaborating with sharp engineers and highly-engaged users to ship code continuously. We have many domains ranging from highly-scalable transactional backend systems, to complex optimization problems, to customer facing applications/APIs, so if you love building world-class software of any type, most likely we have a place for you.\n\nWe’re looking for software development engineers who share our passion for continuously improving the customer experience, who are motivated by challenging problems in distributed systems, algorithms, and HCI and who love writing great code. If you have an entrepreneurial spirit, know how to deliver, are deeply technical, highly innovative and long for the opportunity to build pioneering solutions to challenging problems, we want to talk to you.",
    "url": "https://www.amazon.jobs/en/jobs/2974516/software-development-engineer-awd"
  },
  {
    "title": "Software Development Engineer - II, SPIV",
    "company": "Amazon",
    "location": "IND, KA, Bangalore",
    "description": "DESCRIPTION\n\nSelling Partner Identity Verification (SPIV) team ensures that Amazon is a safe and trustworthy place to shop and an amazing place to build a successful business selling products. We support this mission through providing a secure and accurate Identity verification platform. Identity verification is becoming a critical component to protect our customers from bad actors and provide fast and secure registration and account management capabilities. We provide an end to end solution for identity verification and account lifecycle management for various Amazon businesses across globe (North America, Europe, Japan, China and more). Our customers include Mechanical Turk, Selling on Amazon, Amazon Pay, Amazon Flex etc. We continuously strive to scale our systems to serve millions of Amazon customers with high accuracy, least friction, in a highly secure manner to enable a safe and secure shopping experience for customers.\n\nKey job responsibilities\nEngineers in the team need a strong understanding of Computer fundamentals and practical experience in working with large scale distributed systems. Experience with web services-based applications, especially at massive scale, is helpful.",
    "url": "https://www.amazon.jobs/en/jobs/2959938/software-development-engineer-ii-spiv"
  },
  {
    "title": "Software Development Engineer",
    "company": "Amazon",
    "location": "IND, TS, Hyderabad",
    "description": "DESCRIPTION\n\nAt Amazon Business, a fast-growing startup passionate about building solutions, we set out every day to innovate and disrupt the status quo. We stand at the intersection of tech & retail in the B2B space developing innovative purchasing and procurement solutions to help businesses and organizations thrive. At Amazon Business, we strive to be the most recognized and preferred strategic partner for smart business buying. Bring your insight, imagination and a healthy disregard for the impossible. Join us in building and celebrating the value of Amazon Business to buyers and sellers of all sizes and industries. Unlock your career potential.\n\nAmazon Business team is seeking Software Development Engineers who want to disrupt the way businesses purchase online.\n\nWe're building an exciting new team in Hyderabad that will revolutionize how Amazon Business connects with its customers and we are ready to take it to the next level!\n\nCandidates need to have ownership, passion to provide great customer experience, and excellent troubleshooting skills. Experience with building web-based applications and/or web services-based applications is desired.",
    "url": "https://www.amazon.jobs/en/jobs/3005235/software-development-engineer"
  },
  {
    "title": "SDE, IIoT, Decision Science and Technology (DST)",
    "company": "Amazon",
    "location": "IND, TS, Hyderabad",
    "description": "DESCRIPTION\n\nInterested in creating systems and services that bring the power of Machine Learning (ML) to new application fields? With IIoT products, our organization is setting the standard for high-performance, easy-to-use, and cost-effective ML services. Our team expands this portfolio to new applications, enhancing our condition-based maintenance program, and maximizing equipment availability.\n\nAs a Software Development Engineer, you will be responsible for designing, developing, testing, and deploying distributed machine learning systems and large-scale solutions for our world-wide customer base. In this role, you will collaborate closely with a team of research and applied scientists to influence our overall strategy and define the team’s roadmap. You will also drive the system architecture, spearhead best practices that enable a quality product, and help coach and develop junior engineers. A successful candidate will have an established background in engineering large-scale software systems, a strong technical ability, great communication skills, and a motivation to achieve results in a fast-paced environment.\n\nOur team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we’re building an environment that celebrates knowledge sharing and mentorship. Our senior members enjoy one-on-one mentoring and thorough, but kind, code reviews. We care about your career growth and strive to assign projects based on what will help each team member develop into a better-rounded engineer and enable them to take on more complex tasks in the future.\n\nKey job responsibilities\n- Solving difficult problems with elegant and practical code\n- Helping define engineering best practices and providing technical mentorship to other members of the engineering team\n- Being thoughtful for the customer and ensuring their needs come first\n- Designing and building software for a multitude of sensors (vibration, temperature), mobile clients, and back-end cloud server systems\n\nYou're an awesome fit if you demonstrate:\n\n- Industry-leading technical abilities show-casing a breadth and depth of technical knowledge\n- The ability to build good working relationships within the team by communicating clearly both verbally and in writing\n- Strong problem solving and trouble shooting skills with the ability to come up with creative solutions to seemingly impossible problems\n- Effective technical leadership skills to improve technologies and infrastructure of the team\n- Are curious trying new technologies, and passionate about innovating on behalf of customers\n\nAbout the team\nDST combines the expertise from talented program, product managers, engineers, and scientists to create programs and products that support such programs to drive cost optimization, and prevent events (e.g., unplanned downtime) that negatively impact customer experience.",
    "url": "https://www.amazon.jobs/en/jobs/3004899/sde-iiot-decision-science-and-technology-dst"
  },
  {
    "title": "SDE, IIoT, Decision Science and Technology (DST)",
    "company": "Amazon",
    "location": "IND, TS, Hyderabad",
    "description": "DESCRIPTION\n\nInterested in creating systems and services that bring the power of Machine Learning (ML) to new application fields? With IIoT products, our organization is setting the standard for high-performance, easy-to-use, and cost-effective ML services. Our team expands this portfolio to new applications, enhancing our condition-based maintenance program, and maximizing equipment availability.\n\nAs a Software Development Engineer, you will be responsible for designing, developing, testing, and deploying distributed machine learning systems and large-scale solutions for our world-wide customer base. In this role, you will collaborate closely with a team of research and applied scientists to influence our overall strategy and define the team’s roadmap. You will also drive the system architecture, spearhead best practices that enable a quality product, and help coach and develop junior engineers. A successful candidate will have an established background in engineering large-scale software systems, a strong technical ability, great communication skills, and a motivation to achieve results in a fast-paced environment.\n\nOur team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we’re building an environment that celebrates knowledge sharing and mentorship. Our senior members enjoy one-on-one mentoring and thorough, but kind, code reviews. We care about your career growth and strive to assign projects based on what will help each team member develop into a better-rounded engineer and enable them to take on more complex tasks in the future.\n\nKey job responsibilities\n- Solving difficult problems with elegant and practical code\n- Helping define engineering best practices and providing technical mentorship to other members of the engineering team\n- Being thoughtful for the customer and ensuring their needs come first\n- Designing and building software for a multitude of sensors (vibration, temperature), mobile clients, and back-end cloud server systems\n\nYou're an awesome fit if you demonstrate:\n\n- Industry-leading technical abilities show-casing a breadth and depth of technical knowledge\n- The ability to build good working relationships within the team by communicating clearly both verbally and in writing\n- Strong problem solving and trouble shooting skills with the ability to come up with creative solutions to seemingly impossible problems\n- Effective technical leadership skills to improve technologies and infrastructure of the team\n- Are curious trying new technologies, and passionate about innovating on behalf of customers\n\nAbout the team\nDST combines the expertise from talented program, product managers, engineers, and scientists to create programs and products that support such programs to drive cost optimization, and prevent events (e.g., unplanned downtime) that negatively impact customer experience.",
    "url": "https://www.amazon.jobs/en/jobs/3004902/sde-iiot-decision-science-and-technology-dst"
  },
  {
    "title": "SDE, IIoT, Decision Science and Technology (DST)",
    "company": "Amazon",
    "location": "IND, TS, Hyderabad",
    "description": "DESCRIPTION\n\nInterested in creating systems and services that bring the power of Machine Learning (ML) to new application fields? With IIoT products, our organization is setting the standard for high-performance, easy-to-use, and cost-effective ML services. Our team expands this portfolio to new applications, enhancing our condition-based maintenance program, and maximizing equipment availability.\n\nAs a Software Development Engineer, you will be responsible for designing, developing, testing, and deploying distributed machine learning systems and large-scale solutions for our world-wide customer base. In this role, you will collaborate closely with a team of research and applied scientists to influence our overall strategy and define the team’s roadmap. You will also drive the system architecture, spearhead best practices that enable a quality product, and help coach and develop junior engineers. A successful candidate will have an established background in engineering large-scale software systems, a strong technical ability, great communication skills, and a motivation to achieve results in a fast-paced environment.\n\nOur team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we’re building an environment that celebrates knowledge sharing and mentorship. Our senior members enjoy one-on-one mentoring and thorough, but kind, code reviews. We care about your career growth and strive to assign projects based on what will help each team member develop into a better-rounded engineer and enable them to take on more complex tasks in the future.\n\nKey job responsibilities\n- Solving difficult problems with elegant and practical code\n- Helping define engineering best practices and providing technical mentorship to other members of the engineering team\n- Being thoughtful for the customer and ensuring their needs come first\n- Designing and building software for a multitude of sensors (vibration, temperature), mobile clients, and back-end cloud server systems\n\nYou're an awesome fit if you demonstrate:\n\n- Industry-leading technical abilities show-casing a breadth and depth of technical knowledge\n- The ability to build good working relationships within the team by communicating clearly both verbally and in writing\n- Strong problem solving and trouble shooting skills with the ability to come up with creative solutions to seemingly impossible problems\n- Effective technical leadership skills to improve technologies and infrastructure of the team\n- Are curious trying new technologies, and passionate about innovating on behalf of customers\n\nAbout the team\nDST combines the expertise from talented program, product managers, engineers, and scientists to create programs and products that support such programs to drive cost optimization, and prevent events (e.g., unplanned downtime) that negatively impact customer experience.",
    "url": "https://www.amazon.jobs/en/jobs/3004901/sde-iiot-decision-science-and-technology-dst"
  },
  {
    "title": "SDM, IIoT, Decision Science and Technology (DST)",
    "company": "Amazon",
    "location": "IND, TS, Hyderabad",
    "description": "DESCRIPTION\n\nAs an SDM within the Reliability & Maintenance Engineering (RME) organization, you’ll support the development and management of Compute, Database, Storage, Industrial Internet of Things (IIoT), Platform, and Productivity Apps services using AWS.\n\nAs the SDM for Condition Based Monitoring and IIoT, you will be responsible for leading a strong team of firmware and software engineers to help optimize the end-to-end experience from registration of new devices, data storage, monitoring and alerting systems. You will be responsible for the full development life cycle of sensor-based solutions to monitor the health of assets (e.g., conveyors, motors, gearboxes). You will ensure the right thing is being built and delivered to customers.\n\nA successful candidate will have an established background in delivering on ML roadmaps for demanding, fast-changing customers balancing across with internal Product roadmap. The ideal candidate should have a strong technical ability to work/deliver on a vertically integrated system stack that consists of a combinatorial matrix of hardware, frameworks, and workflows.\n\nKey job responsibilities\n- Lead the engineering team through an agile transformation that delivers higher software development velocity and quality\n- Develop strong engineering leaders and managers\n- Create, prioritize, communicate, manage, and execute roadmaps, project plans, and commitments\n- Regularly communicate status of development, quality, operations, and system performance to management\n- Lead Engineers to architect and develop the best technical design and approach\n- Foster culture of continuous engineering improvement through mentoring, feedback, and metrics\n- Interface with a diverse customer base to understand requirements, priorities, and processes from around the world\n- Propose and implement new projects or recommend system improvements.\n- Own all operational metrics and support\n- Have the obsession to drive a better customer experience through everything that we do\n- Bring innovative ideas to the table every day, in order to find better ways of accomplishing our customer objectives\n- Set clear, measurable quality goals for an organization in a data-driven way\n\nAbout the team\nDST combines the expertise from talented program, product managers, engineers, and scientists to create programs and products that support such programs to drive cost optimization, and prevent events (e.g., unplanned downtime) that negatively impact customer experience.",
    "url": "https://www.amazon.jobs/en/jobs/3017490/sdm-iiot-decision-science-and-technology-dst"
  },
  {
    "title": "Software Development Engineer - FinTech, Fintech - Tax",
    "company": "Amazon",
    "location": "IND, TS, Hyderabad",
    "description": "DESCRIPTION\n\nAmazon's Financial Technology team is looking for a passionate, results-oriented, inventive software developers who can work on massively scalable and distributed systems. The candidate thrives in a fast-paced environment, understands how to deal with large sets of data and transactions and will help us deliver on a new generation of software, leveraging Amazon Web Services. The candidate is passionate about technology and wants to be involved with real business problems. Our platform serves Amazon's finance, tax and accounting functions across the globe.\nAs a member of this team, your mission will be to design, develop, document and support massively scalable, distributed real time systems. Using C++, python,Java, object oriented design patterns, distributed databases and other innovative storage techniques, you will build and deliver software systems that support complex and rapidly evolving business requirements.\nWe're looking for individuals with a range of experience, from brilliant and motivated new college graduates to technical leaders with the scars and battle-tested wisdom. If you can think big and want to join a fast moving team breaking new ground at Amazon, and you meet the qualifications below, we would like to speak with you!\n\n\nKey job responsibilities\nDesign and build solutions that offers optimised experience for Tax customers.\nPlay a key role in the definition, vision, design, roadmap and development of a new platform from beginning to end.\nWork through all phases of the project lifecycle, including reviewing requirements, designing services that lay foundation for the new technology platform, building new interfaces and also integrate with existing architectures, developing and testing code, and delivering seamless implementations for Global Tax customers.\nBe very hands-on; work with others on the engineering team to manage the day-to-day activities, participate in designs, design review, code review.\nEvaluate and utilize AWS technologies where appropriate, such as EC RDS/DynamoDB/RedShift, SWF, S3 and QuickSight to and build backend services and customer facing APIs.\nDesign and code technical solutions in tools such as , Angular JS, React, Node.js, JQuery and/ SQL Server to deliver value to tax customers.\nContribute to a suite of tools that will be hosted on the AWS infrastructure.\nBuild dashboard and visualization services.\nWork with variety of tools across the spectrum of lifecycle.\nBuild iteratively using agile methodologies.\n\nA day in the life\nThis role works closely with Tax teams, understand their business problems, adjust quickly to changing needs and aligns with the customer priorities.\nShould be able to act fast, build quick solutions, create POCs and suggest right solutions to the customers.\nShould work closely with peer engineers, involve in designing solutions, performing deep dives and contribute to quality code reviews.\nShould shoulder the responsiblities of owning and resolving operational tickets along with the peers.\n\nAbout the team\nOur charter includes building software solutions for tax compliance and auditing teams with special focus on Geo-Expansions, that includes in-country, new-country, merges and acquisitions. We work closely with various stake holders - Tax Compliance and Auditing teams spread across different geographies. We are currently involved in building data lineage based reporting solution that allows tax teams to generate report based on the linkages of transactional data across various financial systems\n\nAbout the team\nOur charter includes building software solutions for tax compliance and auditing teams with special focus on Mexico Tax Compliance Reporting , that includes in-country, new-country, merges and acquisitions. We work closely with various stake holders - Tax Compliance and Auditing teams spread across different geographies. We are currently involved in building self-server reporting solution that allows tax teams to generate report based on the linkages of transactional data across various financial systems",
    "url": "https://www.amazon.jobs/en/jobs/2977190/software-development-engineer-fintech-fintech-tax"
  },
  {
    "title": "Software Development Engineer, Amazon",
    "company": "Amazon",
    "location": "IND, KA, Bangalore",
    "description": "DESCRIPTION\n\nThe Amazon Purchase Experience team is seeking a full stack software development engineer with a passion for engineering excellence. We offer you the opportunity to deliver and lead high visibility & high-impact innovation for customers across the Cart application services in Amazon. We extend to you the opportunity to develop upon multi-tiered, low-latency, highly resilient distributed systems on a grand scale. You will play a pivotal role in crafting solutions that profoundly enhance the shopping experience, handling vast data volumes, delivering lightning-fast response times, and simplifying the cart process to a remarkable degree. You must understand the importance of quality and testability in regards to the long term health and operational excellence of the Amazon eco system and you will be expected to drive improvements to current and future systems in these areas. You will contribute to both funcational and non-functional aspects of the application in the form of enhacing customer experience, improving latency, performance, and business investigations. You will learn and grow by working closely with senior engineers across our organisation.\n\nThe ideal candidate will have excellent technical design, problem solving, Computer Science fundamentals, and communication skills. The candidate should be comfortable interacting with technical and non-technical stakeholders at all levels. The ability to work backwards and think from a customer perspective is crucial as the ideal candidate is expected to contribute to the product vision in addition to the technical design and implementation.",
    "url": "https://www.amazon.jobs/en/jobs/2917213/software-development-engineer-amazon"
  },
  {
    "title": "Software Development Engineer",
    "company": "Amazon",
    "location": "IND, TS, Hyderabad",
    "description": "DESCRIPTION\n\nWould you like to work on one of the world's largest transactional distributed systems? How about working with customers and peers from the entire range of Amazon's business on cool new features? Whether you're passionate about building highly scalable and reliable systems or a software developer who likes to solve business problems, Amazon Tax Platform Services is the place for you.\n\nWe are responsible for the tax platform, providing the core services that calculate taxes (sales tax and VAT) for all Amazon sales, physical and digital, globally and generate tax invoices for the same. We thrive on providing the correct tax amounts to the customer at order time, and make sure audit records are stored safely to meet tax law requirements around the globe and generate tax compliant invoices for our customers. Our challenges include staying on top of the complex and ever-changing global tax rates and laws as well as computing calculations correctly and quickly, thousands of times a second, and each one needs to be right.\n\nWe are looking for software engineers who thrive on complex problems and relish the challenge of operating complex and mission critical systems under huge loads. Our systems manage hundreds of millions of records, and respond to millions of service requests per minute. Do you think you are up to the challenge? Or would you like to learn more and stretch your skills and career?\n\nThe successful candidate is expected to contribute to all parts of the software development and deployment lifecycle, including design, development, documentation, testing and operations. They must possess verbal and written communication skills, be self-driven and deliver high quality results in a fast paced environment. They need to enjoy working closely with their peers in a group of very smart and talented engineers.\n\nWe're looking for people who are smart and can get things done, though the following skill sets provide a good foundation for a quick ramp up to being productive in our Java, Linux and Oracle-based environment. We're looking for a range of experience, from brilliant and motivated new college graduates to technical leaders with battle-tested wisdom.\n\nAs a software development engineer on this team, you will play a pivotal role in the following:\n\n- Work with the team to help drive business decisions\n- Design, implement, test, deploy and maintain innovative software solutions to drive services optimisations, cost, and security.\n- Use software engineering best practices to ensure a high standard of quality for all of the team deliverables\n- Write high quality distributed system software\n- Work in an agile, startup-like development environment, where you are always working on the most important stuff.",
    "url": "https://www.amazon.jobs/en/jobs/3022409/software-development-engineer"
  },
  {
    "title": "Software Development Engineer, Smart Home Cameras",
    "company": "Amazon",
    "location": "IND, MH, Pune\nIND, KA, Bangalore",
    "description": "DESCRIPTION\n\nThe Alexa Smart Home Cameras team is seeking an experienced software development engineer. The ideal candidate is an innovative self-starter who is looking for an opportunity to be both an individual contributor and technical lead.\nAlexa Smart Home Cameras team enables Alexa with a sense of sight around customers homes with innovative experiences like “Alexa, show the front door” or other ambient features like automatic announcements with a live view of cameras where interesting events (person/package/doorbell) were detected. We provide a suite of APIs for 1P (Ring, Blink) and 3P partners to integrate with and enable these capabilities for their cameras. We achieve this by developing technology across Computer Vision, media streaming, real-time communication, and the Alexa app. Our customers are end-consumers who want to use Alexa-enabled devices to simplify their experiences with their smart home cameras and doorbells, as well as the developers that make the devices, like Ring, Arlo, Nest, and Wyze.\n\nKey job responsibilities\nAs a Software Development Engineer on the Cameras team, you will lead the technical aspects of core Cameras customer experience on Echo, FireTV devices and engage with experienced cross-disciplinary teams to design implement and bring to market innovative products and features. You must be responsive, flexible and able to succeed within an open collaborative peer environment.",
    "url": "https://www.amazon.jobs/en/jobs/2966144/software-development-engineer-smart-home-cameras"
  },
  {
    "title": "Sofware Dev Engineer II, ARTS IN",
    "company": "Amazon",
    "location": "IND, TS, Hyderabad",
    "description": "DESCRIPTION\n\nAre you interested in applying your strong software development and tech management skills to world-changing problems? Are you interested in driving the development of methods, models and systems for strategy planning, transportation and fulfillment network? If so, then this is the job for you.\n\nOur team is responsible for creating core analytics tech capabilities, platforms development and data engineering. We develop scalable analytics applications and research modeling to optimize operation processes. We standardize and optimize data sources and visualization efforts across geographies, builds up and maintains the online BI services and data mart. You will work with professional software development managers, data engineers, scientists, business intelligence engineers and product managers using rigorous quantitative approaches to ensure high quality data tech products for our customers around the world, including India, Australia, Brazil, Mexico, Singapore and Middle East.\n\nWe are looking for individuals with a passion for building server-less applications and services. You'll join a team of software engineers, programming specialists that own a suite of applications that provide support tools, automation solutions for internal teams as well as Amazon customers.\n\nKey job responsibilities\nYou’ll design and develop systems and applications used by supply chain operations across IN and emerging countries and you will regularly interact with engineering and business leadership. You will participate in the planning and execution of technology projects and operational excellence initiatives. You’ll also mentor junior engineers in employing strong design and implementation practices.\n\nTo accomplish this, you will be expected to have an established background in building highly scalable systems and applications, great communication skills, and a motivation to achieve results in a fast-paced environment. You should be somebody who enjoys working on complex system software, is customer-centric, and feels strongly about building good software as well as making that software achieve its operational goals. Experience with building and operating web-based applications and/or web services-based applications, especially at massive scale, will be very applicable and helpful..",
    "url": "https://www.amazon.jobs/en/jobs/2944995/sofware-dev-engineer-ii-arts-in"
  },
  {
    "title": "Software Development Engineer, Amazon",
    "company": "Amazon",
    "location": "IND, TS, Hyderabad",
    "description": "DESCRIPTION\n\nAre you an innovative and accomplished professional seeking for a role with a significant impact and growth? Amazon is looking for a dynamic Software Development Engineer to join our Core Services team under Worldwide Customer purchase Journey.\n\nThe Shipping and Region Authority (SARA) organization innovates on foundational products that shape the customer shopping journey, beginning from the gateway page of their visit through search and discovery experiences. SARA’s products also help drive checkout and fulfillment customer experiences. Through a complex orchestration of its four domains (Shipping, Regions, Locations, Restrictions), SARA influences and frames the shopping CX. Our systems are architected for scale and consistency, offering configurable, flexible, and global solutions (standardized globally but customized for local regulations). We integrate with multiple cross technology and functional services to identify customer locations , identify the shipping options and apply sales and shipping restrictions.\n\nIn this role, you will scope complex projects and deliver simple, elegant solutions by collecting product and business requirements, driving the development schedule from design to release, making appropriate trade-offs to optimize time-to-market, and clearly communicating goals, roles, responsibilities, and desired outcomes to internal cross-functional teams. You will interact with a broad cross-section of the Amazon organization, clarify ambiguous issues, and negotiate effective technical solutions between development and business teams. You will anticipate bottlenecks and escalate issues when required to ensure on-time delivery. This role requires a seasoned individual with excellent experience as a Software Development Engineer for distributed SOA software systems and the ability to guide high-level technical design while considering potential future areas of fraud our platform might encounter.\n\nKey job responsibilities\n• Collaborate with experienced cross-disciplinary Amazonian to conceive, design, and bring innovative products and services to market.\n• Design and build innovative technologies in a large distributed computing environment and help lead fundamental changes in the industry.\n• Create solutions to run predictions on distributed systems with exposure to innovative technologies at incredible scale and speed.\n• Build distributed storage, index, and query systems that are scalable, fault-tolerant, low cost, and easy to manage/use.\n• Design and code the right solutions starting with broadly defined problems.\n• Work in an agile environment to deliver high-quality software.\n\n\nKey job responsibilities\n• Collaborate with experienced cross-disciplinary Amazonian to conceive, design, and bring innovative products and services to market.\n• Design and build innovative technologies in a large distributed computing environment and help lead fundamental changes in the industry.\n• Create solutions to run predictions on distributed systems with exposure to innovative technologies at incredible scale and speed.\n• Build distributed storage, index, and query systems that are scalable, fault-tolerant, low cost, and easy to manage/use.\n• Design and code the right solutions starting with broadly defined problems.\n• Work in an agile environment to deliver high-quality software.",
    "url": "https://www.amazon.jobs/en/jobs/3008222/software-development-engineer-amazon"
  },
  {
    "title": "Software Development Engineer, Global Logistics",
    "company": "Amazon",
    "location": "IND, TS, Hyderabad",
    "description": "DESCRIPTION\n\nAt Amazon we are working to be the most customer-centric company on earth. Towards this, Amazon Global Logistics (AGL) is working to enable the largest selection of inventory on earth for our customers. AGL vision is to build Amazon's global logistics pipeline for any supplier to supply to any location in the world. AGL offers intercontinental logistics services to selling partners to enable them to move their product from an origin country to Amazon fulfillment centers.\n\nAGL is also responsible for exports from fulfillment centers to other countries outside of the fulfillment network. AGL enables global expansion for the selling partners with the highest standard of quality, accountability, and transparency.\n\n\nWe are looking for highly technical, passionate, self-motivated and talented Software Development Engineers who love solving and challenging problems. You would be solving complex problems for Sellers, Shippers and Trade agents around International Shipment Management, Customs Compliance, Shipment Tracking, Seller & Shipper Identity, Financial Automation, Small Parcel Consolidation/De-consolidation with a good focus on offering a cost effective, reliable and high-quality solution for international shipping. If you are excited by the opportunity to work with a high performing engineering team in the design and development of this AGL solution, this is the right career move for you! Do you want to be part of our innovative team?",
    "url": "https://www.amazon.jobs/en/jobs/3025645/software-development-engineer-global-logistics"
  },
  {
    "title": "Sr. Software Development Engineer, Governance, Risk & Compliance (GRC)",
    "company": "Amazon",
    "location": "IND, TS, Hyderabad",
    "description": "DESCRIPTION\n\nAre you a seasoned software engineer passionate about building scalable and highly available systems that drive innovation? Join Amazon Finance Technology (FinTech) and be part of a team that develops applications supporting Amazon's global growth.\n\nIn this role, you will be responsible for designing, implementing, and deploying mission-critical software solutions that enable Amazon to meet compliance, lineage, and security goals across all AWS services.\n\nKey job responsibilities\n* Architect and develop highly scalable, fault-tolerant, and available services that underpin large-scale processing solutions.\n* Collaborate with senior engineers to design and implement innovative software applications using modern techniques.\n* Leverage AI/ML technologies to improve compliance accuracy.\n* Work in an agile environment, focusing on delivering the most important features for our customers.\n* Provide technical guidance and mentorship to junior engineers, fostering a culture of continuous learning and growth.\n\nA day in the life\nA Software Development Engineer-III on the FinTech-Delta team is an autonomous contributor that leads the development, maintenance, and evolution of software features that help to establish stronger governance and controllership over AWS security assurance, financial data and business processes and reduce risk in financial reporting\n\nAbout the team\nAt Amazon FinTech, you'll have the opportunity to work with top engineering talent, drive innovation, and develop your career in an environment that encourages creative thinking and speed. Join us and be part of a team that shapes the future of financial technology at Amazon.",
    "url": "https://www.amazon.jobs/en/jobs/3013594/sr-software-development-engineer-governance-risk-compliance-grc"
  },
  {
    "title": "SDE II – Amazon Expansions , Amazon Expansions",
    "company": "Amazon",
    "location": "IND, TS, Hyderabad",
    "description": "DESCRIPTION\n\nAre you interested in building next generation experiences that will re-define international trade at Amazon? Do you want to improve how shoppers around the world discover and purchase global merchandise? Amazon Exports and Expansion is building new experiences responsible for customers globally. Our mission is to provide a one-stop shopping experience to international customers that includes:\n• Build solutions that reach millions of new customers and sellers all over the world, providing them with a localized experience\n• Drive innovation in customer experience technology\n• Work closely with the business to define the expansion strategy and figure out innovative solutions to help this thriving business continue to its growth\n\nKey job responsibilities\n- Translate complex functional and technical requirements into detailed architecture and design.\n- Responsible for portions of the systems architecture, scalability, reliability, and performance. Build new software services and tools from scratch and improve existing systems\n- Create simple solutions for complex business and operational problems. Build robust solutions that operate at Amazon scale\n- Design systems, take mission critical decisions on how we design production systems, what technology to use and how to solve problems\n- Lead software developers in design, implementation and operations\n- Be very hands-on, participate in designs, reviews and develop code\n- Real-time operational support of the team’s functional areas\n- Must be able to work with minimal technical supervision and supplemental engineering support, while responding efficiently to multiple program priorities\n- Work with senior technical leaders to review and improve your designs and solutions\n- Works well in a team environment and be able to effectively drive cross-team solutions that have complex dependencies and requirements\n\nA day in the life\nHigh-level designs, cross-team alignment, long-term architectural roadmap and technical strategy, understanding the business domain and proposing solutions to address customer and business problems, helping scope and analyze product requirements, mentorship, reviewing CRs, writing high-quality code to be an example for the team.\n\nAbout the team\nInternational Expansions team launches Amazon in new non-footprint countries.\n\nThis role is for a new team in International Expansions organization.",
    "url": "https://www.amazon.jobs/en/jobs/3025644/sde-ii-amazon-expansions-amazon-expansions"
  },
  {
    "title": "Software Development Engineer, Retail Foundation Systems",
    "company": "Amazon",
    "location": "IND, TS, Hyderabad",
    "description": "DESCRIPTION\n\nRetail Foundations Systems (RFS) manages critical procurement data for our purchase orders, supplier contracts and Retail offer intent, covering $166.9B PCOGs WW. Our primary themes in are reducing defects and improving data accuracy (aligning on sources of truth for our systems). Delivering on these will ensure Amazon can efficiently buy the right products, at the right costs, and offer them to customers.\n\n\n\n\n\n\n\nKey job responsibilities\nDo you want to work on latest technologies, solve new problems that didn’t exist before, and have the ability to see the impact of your contributions?\n\nAmazon is growing, and so is our team, looking for SDE who moves fast, is capable of cracking and solving complex problems, and has a strong will to get things done. SDEs at Amazon work on real world problems on a global scale, own their systems end to end and influence the direction of our technology that impacts hundreds of millions customers around the world.\n\nAs SDE you are expected to design flexible and scalable solutions, and work on some of the most complex challenges in large-scale computing by utilizing your skills in data structures, algorithms, and object oriented programming.",
    "url": "https://www.amazon.jobs/en/jobs/2926355/software-development-engineer-retail-foundation-systems"
  },
  {
    "title": "Developer Advocate, Frontend, AWS Developer Experience",
    "company": "Amazon",
    "location": "IND, KA, Bengaluru",
    "description": "DESCRIPTION\n\nAre you a frontend developer with a passion for cloud technology and a knack for sharing knowledge? Do you love creating sleek user interfaces and want to inspire others to build amazing web experiences using cloud services? If so, we have an exciting opportunity for you!\n\nAmazon Web Services (AWS) is seeking a Frontend Developer Advocate to join our team in Bangalore, India. In this role, you'll be at the forefront of cloud-powered web development, showcasing how AWS can supercharge frontend applications and workflows.\n\n\nKey job responsibilities\nAs a Frontend Developer Advocate for AWS in Bangalore, you'll be responsible for showcasing how AWS can enhance frontend development and inspiring developers to leverage cloud services in their web projects. Your role will involve a mix of hands-on coding, content creation, and community engagement. Key responsibilities include:\n\n- Developing demos and prototypes that demonstrate the integration of AWS services with frontend technologies\n- Creating educational content such as blog posts, tutorials, and workshop materials\n- Preparing and delivering technical presentations and workshops to developer audiences\n- Engaging with the developer community through social media, forums, and Q&A platforms\n- Staying current with the latest frontend technologies and AWS services\n- Collaborating with internal teams to provide feedback on developer experiences and needs\n- Contributing to the AWS frontend developer ecosystem through open-source projects or experimental coding\n- Traveling to events and conferences to represent AWS and share knowledge with the developer community\n\nA day in the life\nYour day might start with a team standup to align on projects. You could spend the morning coding a demo showcasing server-side rendering for a React app using AWS Lambda and API Gateway. After lunch, you might write a blog post about optimizing frontend asset delivery with Amazon CloudFront. The afternoon could involve answering developer questions on social media platforms. You might end your day experimenting with integrating latest Web APIs and AWS services to create innovative web experiences.\n\nWant to learn more about life as an AWS Developer Advocate? Check out this video: https://www.youtube.com/watch?v=xddeWeNEVkg\n\nAbout the team\nThe Developer Experience team's mission is to explore the future of development so that we can help developers navigate a path to that future. Our goal is to inspire developers around the world. We show them how to practically use new technologies to build efficiently in the cloud. We show them new things they are now able to achieve, both in tackling more complex cloud problems and building new solutions that leverage generative AI. We earn trust with developers by being authentic, and by being practitioners ourselves. We are on an exciting journey together, and not everything is solved yet.",
    "url": "https://www.amazon.jobs/en/jobs/2920604/developer-advocate-frontend-aws-developer-experience"
  },
  {
    "title": "Software Development Engineer II",
    "company": "Amazon",
    "location": "IND, KA, Bengaluru",
    "description": "DESCRIPTION\n\nREADY TO DO SOMETHING BIG?\n\nHow would you build the next generation of mission critical systems and services that power the ability to send, store and manage billions of products across the globe on behalf of our selling partners?\n\nFulfillment by Amazon (FBA) is the Amazon service for world-wide sellers that offers access to Amazon’s vast distribution network as a service. Similar to how AWS provides infrastructure as a service, FBA allows sellers to only pay for what they use, creating a seamless experience to leverage our world-class infrastructure. Sellers, from Fortune 50 companies to hundreds of thousands of small businesses and entrepreneurs, in 135 countries worldwide, rely upon our world-leading technology to grow and thrive on Amazon’s Marketplaces.\n\nAs a leader within FBA, you will provide both strategic and tactical oversight to build the features and functionality required to have the best in class offering for sellers. This leader will create mechanisms to drive optimal seller behavior for FBA inventory management, reducing total supply chain costs and making it easier for sellers to get their inventory close to customers, delivering more items with a Prime delivery promise. This leader will invent new ways to deliver value for sellers and their products, while leveraging the scale and innovation of technology from across the Amazon family, including AWS.\n\nWe operate as a startup within Amazon, providing our team great flexibility in product and technology direction. Come, join us and build the future!\n\nKey job responsibilities\n• You will solve ambiguous business problems and map them to elegant technical solutions\n• You will use object-oriented concepts, algorithms and data structures to build systems at Amazon scale\n• You will design, launch, and re-architect multi-tier systems with large amounts of data\n• You will quickly adapt to fast-paced development environment with bias towards simple and extensible code\n\nAbout the team\nFBA Inventory Management team has a charter to help selling partners and enterprises to optimally plan and manage their inventory in Amazon's fulfillment and warehousing network to meet their on- and off-Amazon demand while minimizing risk of understock and overstock. We do this by providing sellers detailed visibility of their inventory in our network, performance metrics, planning & automation tools and recommendations to manage their inventory.",
    "url": "https://www.amazon.jobs/en/jobs/3009043/software-development-engineer-ii"
  },
  {
    "title": "Software Development Engineer II, Tax Services",
    "company": "Amazon",
    "location": "IND, TS, Hyderabad",
    "description": "DESCRIPTION\n\nWould you like to work on one of the world's largest transactional distributed systems? How about working with customers and peers from the entire range of Amazon's business on cool new features? Whether you're passionate about building highly scalable and reliable systems or a software developer who likes to solve business problems, Tax Services is the place for you.\n\nWe are also responsible for the tax invoicing platform. We provide the core services that generate tax invoicing at Amazon. We thrive on providing the correct tax amounts to the customer at order time, and make sure audit records are stored safely to meet tax law requirements around the globe. Our challenges include staying on top of the complex and ever-changing global tax rates and laws as well as computing calculations correctly and quickly, thousands of times a second, and each one needs to be right.\n\nWe are looking for software engineers who thrive on complex problems and relish the challenge of operating complex and mission critical systems under high loads. Our systems manage hundreds of millions of records, and responds to millions of service requests per minute. Do you think you are up to the challenge? Or would you like to learn more and stretch your skills and career?\n\nThe successful candidate is expected to contribute to all parts of the software development and deployment lifecycle, including design, development, documentation, testing and operations. They must possess verbal and written communication skills, be self-driven and deliver high quality results in a fast paced environment. They need to really enjoy working closely with their peers in a group of very smart and talented engineers.\n\nWe're looking for people who are smart and can get things done, though the following skill sets provide a good foundation for a quick ramp up to being productive in our Java, Linux based environment. We're looking for a range of experience, from brilliant and motivated new college graduates to technical leaders with the scars and battle-tested wisdom.",
    "url": "https://www.amazon.jobs/en/jobs/3011979/software-development-engineer-ii-tax-services"
  },
  {
    "title": "SDE II, Amazon",
    "company": "Amazon",
    "location": "IND, TS, Hyderabad",
    "description": "DESCRIPTION\n\nWould you like to work on one of the world's largest transactional distributed systems? How about working with customers and peers from the entire range of Amazon's business on cool new features? Whether you're passionate about building highly scalable and reliable systems or a software developer who likes to solve business problems, Tax Services is the place for you.\n\nWe are also responsible for the tax invoicing platform. We provide the core services that generate tax invoicing at Amazon. We thrive on providing the correct tax amounts to the customer at order time, and make sure audit records are stored safely to meet tax law requirements around the globe. Our challenges include staying on top of the complex and ever-changing global tax rates and laws as well as computing calculations correctly and quickly, thousands of times a second, and each one needs to be right.\n\nWe are looking for software engineers who thrive on complex problems and relish the challenge of operating complex and mission critical systems under extreme loads. Our systems manage hundreds of millions of records, and responds to millions of service requests per minute. Do you think you are up to the challenge? Or would you like to learn more and stretch your skills and career?\n\nThe successful candidate is expected to contribute to all parts of the software development and deployment lifecycle, including design, development, documentation, testing and operations. They must possess verbal and written communication skills, be self-driven and deliver high quality results in a fast paced environment. They need to really enjoy working closely with their peers in a group of very smart and talented engineers.\n\nWe're looking for people who are smart and can get things done, though the following skill sets provide a good foundation for a quick ramp up to being productive in our Java, Linux based environment. We're looking for a range of experience, from brilliant and motivated new college graduates to technical leaders with the scars and battle-tested wisdom.\n\nWould you like to work on one of the world's largest transactional distributed systems? How about working with customers and peers from the entire range of Amazon's business on cool new features? Whether you're passionate about building highly scalable and reliable systems or a software developer who likes to solve business problems, Tax Services is the place for you.\n\nWe are also responsible for the tax invoicing platform. We provide the core services that generate tax invoicing at Amazon. We thrive on providing the correct tax amounts to the customer at order time, and make sure audit records are stored safely to meet tax law requirements around the globe. Our challenges include staying on top of the complex and ever-changing global tax rates and laws as well as computing calculations correctly and quickly, thousands of times a second, and each one needs to be right.\n\nWe are looking for software engineers who thrive on complex problems and relish the challenge of operating complex and mission critical systems under extreme loads. Our systems manage hundreds of millions of records, and responds to millions of service requests per minute. Do you think you are up to the challenge? Or would you like to learn more and stretch your skills and career?\n\nThe successful candidate is expected to contribute to all parts of the software development and deployment lifecycle, including design, development, documentation, testing and operations. They must possess verbal and written communication skills, be self-driven and deliver high quality results in a fast paced environment. They need to really enjoy working closely with their peers in a group of very smart and talented engineers.\n\nWe're looking for people who are smart and can get things done, though the following skill sets provide a good foundation for a quick ramp up to being productive in our Java, Linux based environment. We're looking for a range of experience, from brilliant and motivated new college graduates to technical leaders with the scars and battle-tested wisdom.\n\nBASIC QUALIFICATIONS\n- 3+ years of non-internship professional software development experience\n- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\n- Experience programming with at least one software programming language\n\nPREFERRED QUALIFICATIONS\n- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\n- Bachelor's degree in computer science or equivalent\n\nInternal job description\nLoop competencies\n--\nBasic qualifications\n- 3+ years of non-internship professional software development experience\n- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\n- Experience programming with at least one software programming language\n\nPreferred qualifications\n- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\n- Bachelor's degree in computer science or equivalent\n\nInternal job description\nLoop competencies\n--\nBasic qualifications\n- 3+ years of non-internship professional software development experience\n- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\n- Experience programming with at least one software programming language\n\nPreferred qualifications\n- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\n- Bachelor's degree in computer science or equivalent\n\nInternal job description\nLoop competencies\n--\nBasic qualifications\n- 3+ years of non-internship professional software development experience\n- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\n- Experience programming with at least one software programming language\n- Bachelor's degree in computer science or equivalent\n\nPreferred qualifications\n- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience",
    "url": "https://www.amazon.jobs/en/jobs/3012016/sde-ii-amazon"
  },
  {
    "title": "Delivery Consultant - AI/ML and Generative AI, Professional Services GCC",
    "company": "Amazon",
    "location": "IND, MH, Maharashtra",
    "description": "DESCRIPTION\n\nThe Amazon Web Services Professional Services (ProServe) team is seeking a skilled Delivery Consultant to join our team at Amazon Web Services (AWS). In this role, you'll work closely with customers to design, implement, and manage AWS solutions that meet their technical requirements and business objectives. You'll be a key player in driving customer success through their cloud journey, providing technical expertise and best practices throughout the project lifecycle.\n\nPossessing a deep understanding of AWS products and services, as a Delivery Consultant you will be proficient in architecting complex, scalable, and secure solutions tailored to meet the specific needs of each customer. You’ll work closely with stakeholders to gather requirements, assess current infrastructure, and propose effective migration strategies to AWS. As trusted advisors to our customers, providing guidance on industry trends, emerging technologies, and innovative solutions, you will be responsible for leading the implementation process, ensuring adherence to best practices, optimizing performance, and managing risks throughout the project.\n\nThe AWS Professional Services organization is a global team of experts that help customers realize their desired business outcomes when using the AWS Cloud. We work together with customer teams and the AWS Partner Network (APN) to execute enterprise cloud computing initiatives. Our team provides assistance through a collection of offerings which help customers achieve specific outcomes related to enterprise cloud adoption. We also deliver focused guidance through our global specialty practices, which cover a variety of solutions, technologies, and industries.\n\n10034\n\nKey job responsibilities\nAs an experienced technology professional, you will be responsible for:\n- Designing, implementing, and building complex, scalable, and secure GenAI and ML applications and models built on AWS tailored to customer needs\n- Providing technical guidance and implementation support throughout project delivery, with a focus on using AWS AI/ML services\n- Collaborating with customer stakeholders to gather requirements and propose effective model training, building, and deployment strategies\n- Acting as a trusted advisor to customers on industry trends and emerging technologies\n- Sharing knowledge within the organization through mentoring, training, and creating reusable artifacts\n\nAbout the team\nDiverse Experiences: AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job below, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\nWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\n\nInclusive Team Culture - Here at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (diversity) conferences, inspire us to never stop embracing our uniqueness.\n\nMentorship & Career Growth - We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\n\nWork/Life Balance - We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.",
    "url": "https://www.amazon.jobs/en/jobs/2944592/delivery-consultant-ai-ml-and-generative-ai-professional-services-gcc"
  },
  {
    "title": "Consultant - AI/ML and Generative AI, Professional Services GCC",
    "company": "Amazon",
    "location": "IND, HR, Gurugram",
    "description": "DESCRIPTION\n\nThe Amazon Web Services Professional Services (ProServe) team is seeking a skilled Delivery Consultant to join our team at Amazon Web Services (AWS). In this role, you'll work closely with customers to design, implement, and manage AWS solutions that meet their technical requirements and business objectives. You'll be a key player in driving customer success through their cloud journey, providing technical expertise and best practices throughout the project lifecycle.\n\nPossessing a deep understanding of AWS products and services, as a Delivery Consultant you will be proficient in architecting complex, scalable, and secure solutions tailored to meet the specific needs of each customer. You’ll work closely with stakeholders to gather requirements, assess current infrastructure, and propose effective migration strategies to AWS. As trusted advisors to our customers, providing guidance on industry trends, emerging technologies, and innovative solutions, you will be responsible for leading the implementation process, ensuring adherence to best practices, optimizing performance, and managing risks throughout the project.\n\nThe AWS Professional Services organization is a global team of experts that help customers realize their desired business outcomes when using the AWS Cloud. We work together with customer teams and the AWS Partner Network (APN) to execute enterprise cloud computing initiatives. Our team provides assistance through a collection of offerings which help customers achieve specific outcomes related to enterprise cloud adoption. We also deliver focused guidance through our global specialty practices, which cover a variety of solutions, technologies, and industries.\n\n10034\n\nKey job responsibilities\nAs an experienced technology professional, you will be responsible for:\n- Designing and implementing complex, scalable, and secure AWS solutions tailored to customer needs\n- Providing technical guidance and troubleshooting support throughout project delivery\n- Collaborating with stakeholders to gather requirements and propose effective migration strategies\n- Acting as a trusted advisor to customers on industry trends and emerging technologies\n- Sharing knowledge within the organization through mentoring, training, and creating reusable artifacts\n\nAbout the team\nAbout AWS:\nDiverse Experiences: AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job below, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\n\nWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\n\nInclusive Team Culture - Here at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\n\nMentorship & Career Growth - We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\n\nWork/Life Balance - We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.",
    "url": "https://www.amazon.jobs/en/jobs/2943450/consultant-ai-ml-and-generative-ai-professional-services-gcc"
  },
  {
    "title": "Software Development Engineer I, UTR, Last Mile",
    "company": "Amazon",
    "location": "IND, KA, Bengaluru",
    "description": "DESCRIPTION\n\nAmazon has come a long way since opening on the World Wide Web in July 1995. Today, we operate retail websites in multiple countries across geographies, offering products in many categories (books, media, digital, electronics etc.) worldwide, and we still like to work hard, have fun and make history! The Amazon.com brand has become synonymous with a superior level of convenience, selection, low prices, and customer service. We are looking for Fresh College Graduate or software engineers with less than 1 year of Software engineering experience involving solving complex problems.\n\nKey job responsibilities\nKey Responsibilities include:- • Ability to code right solutions starting with broadly defined problems, • Understand basic Algorithm fundamentals • Development of code in object oriented languages like C++ and java and build large scale robust distributed systems Candidates for this role must have: • A solid grounding in Computer Science fundamentals (based on a BS or MS in CS or related field) • Understanding of the tools of the trade, including an understanding of any of modern programming languages (Java / JavaScript / C/C++). • Proven educational track record with sound data structure and algorithm knowledge",
    "url": "https://www.amazon.jobs/en/jobs/2976865/software-development-engineer-i-utr-last-mile"
  }
]